[{"venue":"The Milestone Club","event":"Bob Fleming and the Drunk Girl Chorus, Quinlan Conley, Bart Lattimore, The Kyle Perkins Band","date":"08 31 17","times":"9:00","tuneStub":"","href":"","desc":"Riverton Records NC sad songs.","ticketfly":"1529641"},{"venue":"The Milestone Club","event":"Stay Wild, Recover The Satellite, Trash Room, Van Huskins","date":"09 01 17","times":"9:00","tuneStub":"","href":"","desc":"Intersectional feminists, strong supporters of the LGBTQ community, animal rights advocates and complete goofs who laugh at their own jokes. That is Stay Wild in a boisterous nutshell. Their exuberant live performance paired with a wide range of song subjects like rape culture, consumerism, and white privilege, they have carved their own unique form of energetic, veracious socio-political music into the realm of hardcore and punk rock.","ticketfly":""},{"venue":"The Milestone Club","event":"Black Ritual, AuxiliA, Violent Life Violent Death, Proxima","date":"09 02 17","times":"9:00","tuneStub":"","href":"","desc":"Welcome to the fierce world known as Black Ritual. Having been around 10 years playing in the local music scene and supporting their fellow musicians, Black Ritual is firmlygrounded in their own unique style. With their original metal, thrash, southern, power groove, and melodic sounds and influences, this band aims to stand apart from the rest. Guitarists Gary Rackley stated, “We just want to make every song its own, our own. For each song to sounddifferent in more ways than the last.” Forever ready to throw down whether in the studio or on the stage, this band brings the energy and the passion of music.Coming from Charlotte North Carolina the band is as follows: Charlie Calebro - vocals,Gary Rackley - guitarEddie “E-Rock”Cousins - bassBrad Sellers-drums. With all members having a rock solid history in playing live music, they bring heavy rhythms, blood curdling vocals, chunky guitars, and a stage performance that’s sure to get the crowd pumped and moving.In 2008 the band released their debut album 1,000 Yard Stare.Black Ritual has shared the stage with bands such as Exodus, Corrosion of Conformity, Obituary, Cradle of Filth, Butcher Babies, Nonpoint, Joey Belladonna from Anthrax, FearFactory, Adema, Carnifex, and Hate Eternal just to name a few. One thing that the crowd can be certain of is that they are going to see an amazing and unforgettable show by this band. BlackRitual has created their mark in the metal scene and will continue to do so for years to come.","ticketfly":""},{"venue":"The Milestone Club","event":"Only Sibling, Messenger Down, The Chroma Divide, The Hooliganz","date":"09 03 17","times":"9:00","tuneStub":"","href":"","desc":"Only Sibling is a band from Staten Island, NY.","ticketfly":"1534949"},{"venue":"The Milestone Club","event":"Karaoke!","date":"09 07 17","times":"9:00","tuneStub":"","href":"","desc":"Free karaoke night with Battleship a","ticketfly":""},{"venue":"The Milestone Club","event":"Major Player, Morrowville","date":"09 08 17","times":"9:00","tuneStub":"","href":"","desc":"Major Player is the creation of songwriter and instrumentalist Jeffrey York. A native of Syracuse, York has spent years writing in the indie rock vein, with influences that span from Pop to Experimental. Building on the success of previous projects such as the rock outfit Animal Pants, Major Player is Indie Rock rooted in Soul and R&B.York first broke ground on Major Player with help from drummer Liz Strodel and producer Andrew Greacen. What began as an experiment in hip-hop beat-making transformed into a full fledged indie rock ensemble. The latest configuration of Major Player includes Brent Spreter on Bass, Stephen Collie on drums, Ian Doherty and Deion Patterson on Keys.In the summer of 2016 Major Player released its debut album “Extended Play.” The record is deliberate in its simplicity, intentionally lo-fi and moody. The tonality of these songs call up something dream like and familiar, making use of repetition and overlapping layers that build on one another. With lyrics that explore the shadowy faces of love and age, Major Player maintains a pop driven focus, while delivering dark creative melodies and catchy vocal hooks.","ticketfly":"1539447"},{"venue":"The Milestone Club","event":"Blackwater Drowning, Divine Treachery, Annabel Lee, Den of Wolves","date":"09 09 17","times":"9:00","tuneStub":"","href":"","desc":"We are Blackwater Drowning, a metal band from western NC blending equal measures of melodic and aggressive elements to form a sound that has something to offer every listener.","ticketfly":"1533026"},{"venue":"The Milestone Club","event":"Kayo Dot, El Malpais, Pullover","date":"09 10 17","times":"9:00","tuneStub":"","href":"","desc":"Kayo Dot is an American avant-rock/experimental music group that was formed in 2003 by Toby Driver. They released their debut album Choirs of the Eye on John Zorn's Tzadik Records label that year. Tzadik's descriptive label on that album reads: \"Kayo Dot powerfully integrates elements of modern classical composition with the layers of guitars and vocals more common to rock and metal. With a compositional map that is strict in form yet malleable in execution, Kayo Dot uses a vast array of instrumentation to create an exciting convergence of violence and serenity.\"Since then, Kayo Dot's music has undergone several identity shifts, largely influenced by the band's constantly-changing lineup and instrumentation. One predominant element of Driver's compositional voice which remains consistent throughout all of Kayo Dot's output, however, is the band's use of abstract timing and performance cues. This lends to the music the element of \"malleability\" mentioned in Tzadik's description above.The music of Kayo Dot is commonly categorized as post-metal, post-rock, progressive rock, or avant-garde. Their songs involve complex instrumentation (composed by singer and frontman Driver). They are substantially longer than typical rock songs, usually ranging from 8 to 18 minutes in length.","ticketfly":"1529643"},{"venue":"The Milestone Club","event":"The Hooliganz, Destroi, The Commonwealth, Queen City Rejects","date":"09 14 17","times":"9:00","tuneStub":"","href":"","desc":"The Hooliganz' music is for the working class, the working poor, degenerates, skinheads, punk rockers and hardcore kids. This is the spirit of American Oi!","ticketfly":"1529637"},{"venue":"The Milestone Club","event":"Omnislash, Rites to Sedition, Waft, Morganton","date":"09 15 17","times":"9:00","tuneStub":"","href":"","desc":"Omnislash is Historical Power Thrash","ticketfly":"1539439"},{"venue":"The Milestone Club","event":"Dirtbag Love Affair, The Fill Ins, Graveyard Boulevard, The Rufftons","date":"09 16 17","times":"9:00","tuneStub":"","href":"","desc":"Dirtbag Love Affair comes out of the corner swinging with hard hitting combos consisting of 70s style garage/glam rock and drunken sing along punk. They have taken their wide open show to over 100 different stages in 15 states across the United States.Dirtbag Love Affair walks it just like they talk it with attitude and music to match their loud and unapologetically rude lifestyle. Each song is a tale of living life with no regrets, no matter how many broken hearts, noses, or bottles are piled up along the way.The band was born with a hard working do it yourself attitude. With one official studio album, \"Wakin' Up In My Chucks\", Dirtbag Love Affair has electrified audiences and shared the stage with acts as diverse as Sex Slaves, Wednesday 13, ANTIseen, and L.A. Guns.","ticketfly":"1529646"},{"venue":"The Milestone Club","event":"Moodie Black, Mikal kHill, Joules, B-Villainous, Shadow","date":"09 17 17","times":"9:00","tuneStub":"","href":"","desc":"Moodie Black is rap-gaze currently living at Fake Four, Inc.","ticketfly":"1528473"},{"venue":"The Milestone Club","event":"Dubamine, Makak, Zeplinn, Snakko","date":"09 22 17","times":"9:00","tuneStub":"","href":"","desc":"Lucas Heinel, aka Dubamine, is a Bay Area-based producer with a solid dub foundation and penchant for reggae-influenced bass-heavy riddims. Originally from Santa Cruz, Dubamine has released on Yuk Records, Duploc, and Dub-Stuy Records.","ticketfly":"1551425"},{"venue":"The Milestone Club","event":"Digital Noir featuring Michael Price and DJ Spider","date":"09 23 17","times":"9:00","tuneStub":"","href":"","desc":"Charlotte’s darkest and most aggressive Goth / Industrial dance night.","ticketfly":"1384689"},{"venue":"The Milestone Club","event":"Howling Giant, Rites to Sedition, Warpath","date":"09 24 17","times":"9:00","tuneStub":"","href":"","desc":"Born out of some space fuzz chamber and dropped down on Nashville, Tennessee, Howling Giant’s form of metal is a unique and eclectic fairy tale trip through the stars. - New Noise Magazine","ticketfly":""},{"venue":"The Milestone Club","event":"Jon Dwyer, Ben Tricky, Charles Walker","date":"09 26 17","times":"9:00","tuneStub":"","href":"","desc":"","ticketfly":"1539451"},{"venue":"The Milestone Club","event":"Wolves and Wolves and Wolves and Wolves, Karbomb, Shehehe, Minimums, Weary Legs","date":"09 29 17","times":"9:00","tuneStub":"","href":"","desc":"Wolves&wolves&wolves&wolves (also known as WolvesX4 or WX4) is an indie punk rock band from Winston Salem, NC, that combine the soul and ferocity of punk rock with the brash intensity of rock n’ roll. They've seen their fair share of member changes over the years, but the current lineup is -founding members/brothers Brian(lead vocals and guitar) and Kyle(drums); Ryan(lead guitar and vocals) who joined after filling in on the band's 2014 southeast tour; and Jake(bass and vocals) a longtime friend that stepped in after Wolves parted ways with their original bassist late last year.Since 2013, Wolves has released a full length album, two seven inches, and been featured on countless compilations in the U.S. and Europe. In January 2013 they self released the full length \"Subtle Serpents\" which would later see release in Europe through Gunner Records in March of 2015. June 2014 saw the release of \"Scorched Earth\" a 4‐song EP on vinyl through their own label XV/XIII, and on cassette through Flesh and Bone Records. In August 2015, in collaboration with Wiretap Records, they released \"Scars\" another 4‐song EP on vinyl. 2016 will see multiple releases from the band, first a split EP cassette tape with NC friends Almost People, and then their sophomore album. \"The Cross and The Switchblade\" will be available in the Fall, in the U.S. through Wiretap-XV/XIII Records and in Europe through Gunner Records.Wolves has played all over the southeast and mid-Atlantic seaboard of the United States over the years and in April/May of 2016 they embarked on a full tour of the U.S. In conjunction with the European release of \"Subtle Serpents\" they flew to Germany for a month long tour in 2015, and will be returning in September of 2016 to support the release of \"The Cross and The Switchblade\".Over the years the band has had the opportunity to share the stage with or open for acts like; Tim Vantol, Cymbals Eat Guitars, The Misfits, The Ataris, Guttermouth, The Attack, The Swellers, Government Issue, Arliss Nancy, Veara, Bad Luck, Sheer Terror, Far Less, He Is Legend, Maylene and The Sons of Disaster, Artifex Pereo, On My Honor, and many more.","ticketfly":"1533013"},{"venue":"The Milestone Club","event":"Rapid Fire Fest: Old Scratch, All Hell, Written in Gray","date":"09 30 17","times":"9:00","tuneStub":"","href":"","desc":"","ticketfly":"1539437"},{"venue":"The Milestone Club","event":"Tender Mercy, JPH, The Whiskey Predicament","date":"10 04 17","times":"9:00","tuneStub":"","href":"","desc":"\"Tears open chakras that haven't been discovered yet\" -Ghettoblaste","ticketfly":""},{"venue":"The Milestone Club","event":"StereoLoud, Sulfur, Height Keech, B-Villainous, The Last Wordbenders","date":"10 12 17","times":"9:00","tuneStub":"","href":"","desc":"Dj Ray and Exactly making that StereoLoud music you wanna listen to. That Raw Funky Experimental Hip-Hop music. We've been doin' this for a while and we aren't slowing up anytime soon. \"StereoLoud Got Louder Can Ya Follow?!?","ticketfly":"1549042"},{"venue":"The Milestone Club","event":"New Wave Undertow with DJ Price","date":"10 14 17","times":"9:00","tuneStub":"","href":"","desc":"All the dark 80's and New Wave you can wrap your arms around in one night! One night only!Devo, Kraftwerk, Gary Numan, Old Ministry, Billy Idol, Flock of Seagulls, Falco, Duran Duran, Depeche Mode, INXS, When in Rome, Bauhaus, Heaven 17, Psychedelic Furs, Petshop Boys, Human League, The Fixx,Talk Talk, David Bowie, The Cure...etc. etc. and all that shit.","ticketfly":"1384693"},{"venue":"The Milestone Club","event":"The Fest & The Furious: Slingshot Dakota, Dollar Signs, City Mouse, Alright, Fk Mt., Weary Legs, Corporate Fandango, Wolves and Wolves and Wolves and Wolves, The Mineral Girls, Pink Pots","date":"10 20 17","times":"","tuneStub":"","href":"","desc":"","ticketfly":"1545067"},{"venue":"The Milestone Club","event":"MDC, The Elected Officials, No Anger Control","date":"10 24 17","times":"9:00","tuneStub":"","href":"","desc":"MDC is an American Hardcore band founded in 1979 in Austin, Texas.","ticketfly":"1550969"},{"venue":"The Milestone Club","event":"Everyone Leaves, Young and Heartless, Knowne Ghost, Ol' Sport","date":"10 25 17","times":"9:00","tuneStub":"","href":"","desc":"Everyone Leaves is an alternative rock band from Columbus, Ohio.","ticketfly":"1549063"},{"venue":"The Milestone Club","event":"Flounder Warehouse, The Chroma Divide","date":"11 05 17","times":"9:00","tuneStub":"","href":"","desc":"Flounder Warehouse is progressive-pop from Philadelphia, PA.","ticketfly":""},{"venue":"The Milestone Club","event":"Digital Noir featuring Michael Price and DJ Spider","date":"11 25 17","times":"9:00","tuneStub":"","href":"","desc":"Charlotte’s darkest and most aggressive Goth / Industrial dance night.","ticketfly":"1384691"},{"venue":"The Milestone Club","event":"New Wave Undertow with DJ Price","date":"12 16 17","times":"9:00","tuneStub":"","href":"","desc":"All the dark 80's and New Wave you can wrap your arms around in one night! One night only!Devo, Kraftwerk, Gary Numan, Old Ministry, Billy Idol, Flock of Seagulls, Falco, Duran Duran, Depeche Mode, INXS, When in Rome, Bauhaus, Heaven 17, Psychedelic Furs, Petshop Boys, Human League, The Fixx,Talk Talk, David Bowie, The Cure...etc. etc. and all that shit.","ticketfly":"1384692"},{"venue":"The Milestone Club","event":" New Wave Undertow with DJ Price","date":"08 26 17","times":"9:00","tuneStub":"","href":"","desc":"All the dark 80's and New Wave you can wrap your arms around in one night! One night only!Devo, Kraftwerk, Gary Numan, Old Ministry, Billy Idol, Flock of Seagulls, Falco, Duran Duran, Depeche Mode, INXS, When in Rome, Bauhaus, Heaven 17, Psychedelic Furs, Petshop Boys, Human League, The Fixx,Talk Talk, David Bowie, The Cure...etc. etc. and all that shit.","ticketfly":"1384695"},{"venue":"The Milestone Club","event":"El Malpais, Chocala, TKO Faith Healer","date":"08 25 17","times":"9:00","tuneStub":"","href":"","desc":"EL MALPAIS (PRONOUNCED EL MAL PIE EES)desert winds. cold mountains. an insatiable pack of wolves running through space.classically influenced instrumental avant-punk / prog-rock compositions for guitar, flute & drums.psychedelic instrumental trio.","ticketfly":"1521231"},{"venue":"The Milestone Club","event":"The Widdler, Cut Rugs, Murkury","date":"08 24 17","times":"9:00","tuneStub":"","href":"","desc":"Originally born in Tel-Aviv but now living in New Jersey, Yoni Oron aka The Widdler has been making and recording all types of music since the age of 8.As of 2008 he began exploring the deep trenches of dubstep bringing his own flavor of urban music and electronic dub to listeners ears and chests","ticketfly":"1523742"},{"venue":"The Milestone Club","event":"Brain Dead, Railgun, Warpath","date":"08 23 17","times":"9:00","tuneStub":"","href":"","desc":"","ticketfly":"1553817"},{"venue":"The Milestone Club","event":"Hectagons!, Recover The Satellite, Joules","date":"08 21 17","times":"9:00","tuneStub":"","href":"","desc":"HECTAGONS! was started near the end of the year 2008 in Charlotte, North Carolina by Wyley Buck Boswell (of Hell Or High Water, Appalucia, Andy The Door Bum, etc...) and Richard Edwin Culp (of Zeus, The Pelicans, Andy The Door Bum, For Disaster, Hot House Hefftones, Pig Mountain, etc...) after the end of their band Clavius (www.myspace.com/claviusrocks). In the summer of 2009 Korey Dudley (of Abe Reid & The Spikedrivers, Tropic Culture, Afrojazziacs, American Fetus, etc...) joined on upright bass and HECTAGONS! was born. Many songs are written like \"Get It On, Bang A Hectagon\", \"Hectagons On Holiday a.k.a. Beast Feast!\", \"Hectagons Love Trashy Women\", \"Hectagons All Night Long\", \"Hectagons In Hospitals a.k.a. Spicy Christ And The Beaver Ruin All Stars\", \"Hectagons Reject The Call a.k.a. Please Hang Up And Try Again\", \"Hectagons Spank Out The Gate\", \"Hectagons In Space\", \"Hectagons Go West a.k.a. A Honky Tonk Angel (To Hold Me Tight)\", \"Speedy Hectagonzales\", and more. Since the Summer of 2009 HECTAGONS! has shared the stage with Birds Of Avalon, Fight Amp, Grids, Maserati, Twin Tigers, Scapegoat, 25 Minutes To Go, The Have And The Have Nots, MonstrO, The Lights Fluorescent, Junior Bruce, Death Becomes Even The Maiden, The Lesser Pauls, Zeus, Sundrone, For Disaster, 2013 Wolves, Andy The Door Bum, Pain After Death, Shroud Eater, The Vessel, The Emotron, Sign Of The Southern Cross, Bo White, The Art Department, Culture Prophet, PPR, Treephort, Planet Piss, Husky, Radio Taiwan, Arsonists Vs. Arborists, Boolow, Southside Punx, and more. PLEASE KEEP LISTENING! best heard at the loudest possible volume...","ticketfly":""},{"venue":"The Milestone Club","event":"Group Text, Cheem, Futurists, Taxing","date":"08 19 17","times":"9:00","tuneStub":"","href":"","desc":"\"Cheem's elasticity isn't limited to an instrument. Sure, the Hartford boys' guitars do bounce and snap as most energetic indie should, with the drums shocked and wobbling in time. What began on 2016's Making a Planet as finding the perfect mix of enveloping rhythm and atmosphere continues with \"Spiral,\" the band's latest single ahead of their speedy follow-up. Here, the ambition is tuned a little higher – whether in the infectious chorus, the way the vocals flirt with soul and sharpness...The result is a band firmly planted towards their future, whether on stage or mapping a new world with their recently unearthed pop-rock sensibilities rocketing upward.\" -James Cassar","ticketfly":"1523064"},{"venue":"The Milestone Club","event":"Snatch the Snail, Natural Born Leaders, Nevernauts, Poor Pie","date":"08 18 17","times":"9:00","tuneStub":"","href":"","desc":"Snatch the Snail is a three piece band originally from Wilmington, NC. A nice blend of surf, reggae, psychedelic and punk rock all come together to form a cool, cohesive snail sound. Snatch the Snail records all their own music and can break out any song from a long list of albums to put on an attention grabbing, snail snatching live experience.","ticketfly":"1529649"},{"venue":"The Milestone Club","event":"Karaoke!","date":"08 17 17","times":"9:00","tuneStub":"","href":"","desc":"Free karaoke night with Battleship and ","ticketfly":""},{"venue":"The Milestone Club","event":"Ellis Dyson & The Shambles, Caroilne Keller Band, Moses Jones","date":"08 16 17","times":"9:00","tuneStub":"","href":"","desc":"Ellis Dyson & the Shambles expertly blends old-time influences ranging from Piedmont murder ballads, to Dixieland, to big band swing. The result: whiskey-soaked, foot-stompin’ songs that bring party music of departed eras to crowds both young and old. The Shambles have made waves with their theatrical and explosive live shows and masterful musicianship that electrifies every audience. Bursting with exuberance and effortless expertise, this playfully hootin’ and hollerin’ act is guaranteed to bring the ruckus.","ticketfly":"1509652"},{"venue":"The Milestone Club","event":"The Coma Kids, Placeholder, Minimums, Blame It On Bart","date":"08 15 17","times":"9:00","tuneStub":"","href":"","desc":"Inspired by post-hardcore and pop-punk alike, The Coma Kids take a unique 3-piece approach to the genre, creating vivid musical atmospheres and intense, energetic live shows.","ticketfly":"1532994"},{"venue":"The Milestone Club","event":"Messenger Down, Never I, Harm, Arborlea","date":"08 13 17","times":"9:00","tuneStub":"","href":"","desc":"Messenger Down is a rock/alternative pop artist from Charlotte, NC. Pairing infectious hooks and ambiguous lyrics with a wide array of sounds from electronic to raw and classical to modern, Messenger Down's Garrett Foster creates a diverse resonance that is sure to keep any listener on the edge of their seat.","ticketfly":"1521729"},{"venue":"The Milestone Club","event":"The Fill Ins, The Stir, The Hooliganz","date":"08 12 17","times":"9:00","tuneStub":"","href":"","desc":"Have you heard? No really, have you heard? The Fill Ins are unlike any other band you will see.... Some have said that the band is \"a joke\" and that we're a fake.... Some say we are \"epic winning and badass\".... How ever you wanna word it, we are here to stay. ","ticketfly":"1502889"},{"venue":"The Milestone Club","event":"Nemesis, Sadistic Ritual, Suppressive Fire, KRVSADE","date":"08 11 17","times":"9:00","tuneStub":"","href":"","desc":"Nemesis is a three piece thrash band! Band members include:Corey Hetrick (Guitars/vocals) ,Viken Tashjian (Drums), Jason Duncan (Bass) True, old school thrash!","ticketfly":""},{"venue":"The Milestone Club","event":"The Damned Diamonds, Tongues of Fire, Rothschild, Blu House","date":"08 10 17","times":"9:00","tuneStub":"","href":"","desc":"","ticketfly":"1506586"},{"venue":"The Milestone Club","event":"Take the Fall, East Viridian, So Yesterday, From The Fall","date":"08 09 17","times":"9:00","tuneStub":"","href":"","desc":"We are Take the Fall: a Pop-Punk band from Charlotte, NC comprised of four crazy, kid-like adults who quit our day jobs for our love of music. Taking influence from 90's and early 2000's Pop-Punk, we all love like Blink 182, New Found Glory, Taking Back Sunday.... and it can be heard in our music.","ticketfly":"1509664"},{"venue":"The Milestone Club","event":"Mauve Angeles, Solemn Shapes, IIOIOIOII, 30 Year Sick","date":"08 05 17","times":"9:00","tuneStub":"","href":"","desc":"Mauve Angeles is diy experimental wavegazedisconoise.","ticketfly":"1519292"},{"venue":"The Milestone Club","event":"Corporate Fandango, Shagwuf, Dr. Cirkustien, Stray Cat Sideshow, The Cocker Spaniels","date":"08 04 17","times":"9:00","tuneStub":"","href":"","desc":"Corporate Fandango is a salubrious ska septet of kindred spirits that haunt the streets of Greensboro, North Carolina. We've been described as \"theatrical,\" \"hard-hitting,\" and \"rocket-fueled.\" We are these things and more, rolled neatly into a ball and then thrown at your unsuspecting face. ;)","ticketfly":"1523073"},{"venue":"The Milestone Club","event":"Charles Walker, David Z. Cox & The Extenders, Dylan Gilbert, Nicolas Peter Eichen","date":"08 03 17","times":"9:00","tuneStub":"","href":"","desc":"David Z. Cox is a musician from Charlotte, NC who has no business asking anyone to care about him. Yet here he is.","ticketfly":"1521193"},{"venue":"The Milestone Club","event":"Soul Remnants, Solium Fatalis, Suaka, Black Fleet","date":"07 31 17","times":"9:00","tuneStub":"","href":"","desc":"Soul Remnants is a Massachusetts death metal fivesome.","ticketfly":"1515303"},{"venue":"The Milestone Club","event":"Dead Sea $crilla, 187 Live, Miggs, Freak Tha Monsta, Shadow","date":"07 29 17","times":"9:00","tuneStub":"","href":"","desc":" AIN'T NOTHING SOFT ABOUT SUNSHINE AND LOVE. FRED AND RED SMACK YO FACE WITH IT.","ticketfly":"1519294"},{"venue":"The Milestone Club","event":"Arborlea, Machinist!, Weary Legs, Van Huskins","date":"07 28 17","times":"9:00","tuneStub":"","href":"","desc":"Out of the garbled watered down mess that is today's hardcore scene comes Machinist!, a group of people who play fast nasty simple music. This collection of musicians will move your mind and heart in many directions, leading you on an often hectic journey through a world of truth and lies. Machinist! has something to say, and they're going to tell the world. See them on the road.","ticketfly":"1501500"},{"venue":"The Milestone Club","event":"Karaoke!","date":"07 27 17","times":"9:00","tuneStub":"","href":"","desc":"Free karaoke night with Battleship and ","ticketfly":""},{"venue":"The Milestone Club","event":"Ben Millburn & Sunglass Moustache, Reaves, Bad Karol","date":"07 26 17","times":"9:00","tuneStub":"","href":"","desc":"Louisiana native and Austin resident Ben Millburn released a two part EP series called The Balance EPs over the last year. Austin Town Hall described Part I as \"brimming with the perfect backing harmony and this swelling of huge guitar riffs that ring out in your speaker long after the tune is over.\" PopMatters described Part II as \"downright chilly, like if Kurt Vile’s weirdest stuff was even more glacial and empty. Its folksy guitar is less down-home friendliness and more tumbleweedy desert, no life around for miles.\" Millburn is joined live by his new group, Sunglass Moustache, who bring the records to life and who make the live show a unique psychedelic rock and roll experience.","ticketfly":""},{"venue":"The Milestone Club","event":"Dollar Signs, Bad Idols, Aloha Broha, Pink Pots","date":"07 25 17","times":"9:00","tuneStub":"","href":"","desc":"There’s a fear to growing old in a world that doesn’t care about you, and Dollar Signs can relate; as a diverse group of friends who try to solve their problems in sweat-soaked rooms and dingy basements, singing and dancing away the fear. It’s group therapy for weekend warriors who have to work jobs that they hate. It’s a gala of cheap beer and sweaty hugs. Dollar Signs may as well be the band that played on the deck of the Titanic as it sank into the freezing ocean. We’re all in this together, and Dollar Signs knows that. After the release of their self-released full length album, Yikes, the band has been hitting the road and getting acquainted with the van - and now two tours, three blown tires, a branded hot sauce, and a family-size box of Tums later, they’re ready to do it again. This may not last forever, but for now, while there’s still a tinge of hopelessness in the air, Dollar Signs needs to party with you, because it’s the only way to survive the times.","ticketfly":"1512578"},{"venue":"The Milestone Club","event":"Forges, Ol' Sport, Pet Peeves, The Chroma Divide","date":"07 23 17","times":"9:00","tuneStub":"","href":"","desc":"Forges is from Baltimore.","ticketfly":"1519290"},{"venue":"The Milestone Club","event":"The AWARD WINNING BEACH FORMAL 6! Featuring: Sext Message, Crunk Witch, Minimums, The Gore Gore Luchadores, and Death Fair 2000","date":"07 22 17","times":"9:00","tuneStub":"","href":"","desc":"Jonathan and Stephanie Hughes are the married duo known as Sext Message.  Their musical adventure together began in the fall of 2013, though Jonathan was a veteran of the local Charlotte punk scene for many years prior.Their start came when their comedian friend was hosting a variety/stand-up show with a female headliner and was searching for a female-fronted band to open the show.  After a whirlwind writing process, a month later Sext Message made their debut with a handful of mildly offensive songs and a Roland AX-9.Since their first show the duo has gained a reputation and following for their high energy, danceable live show, that feels more like a party than a performance.  Armed with two keytars and their companion light show, they just released their sophomore album, Brace Yourself, and are booking dates across the southeastern US.","ticketfly":"1515450"},{"venue":"The Milestone Club","event":"Stitchy C, DJ Kyng Rash, F. Dux, Ghost Unknown, Marshall Alexander, Red Jesse, J Rosevelt","date":"07 21 17","times":"9:00","tuneStub":"","href":"","desc":"Stitchy C's HIGHLY anticipated debut album \"Dizzlexic Dialogue\" featuring his head-bangin' single \"Headbangaz\" ft. Barber-Q & L.I.V.E. with the follow-up single \"Talkin' Bout tha South\" ft. Ed E. Ruger, a song dedicated to critic's hatred towards southern hip-hop. With production by JJ the Jenius (Adult Swims \"The Boondocks\", this album will be high in demand.","ticketfly":""},{"venue":"The Milestone Club","event":"Swanky Tiger, Jistu, Farewell Albatross, Earth That Was","date":"07 20 17","times":"9:00","tuneStub":"","href":"","desc":"Swanky Tiger is nasty rock and roll from NYC.","ticketfly":"1514374"},{"venue":"The Milestone Club","event":"Friends at the Falls, Reaves, Futurists","date":"07 18 17","times":"9:00","tuneStub":"","href":"","desc":"Birthed in Mahopac, New York, Friends At The Falls is composed of Jake Stam on vocals and guitar, Matt Montgomery on drums, Don Senese on the keys, Daen Walsh on bass, and Nick Gennusa on lead guitar. Together, these five individuals makeup more than just a band, they are five creative minds and five talented souls that come together to make one cohesive sound. A sound that is unique due to all of the memories these contemporaries share.Off stage, the boys of Friends At The Falls are infamous for jumping off cliffs, sleeping on rooftops, and narfing down slices of ZA. Couple their uniform love for adventure with a mutual appreciation for artists such as The Killers, Coldplay, and Bruce Springsteen— you’ll get a beautiful thriller, one that has you sprinting up ocean side bluffs one day to playing a show at Webster Hall the next.","ticketfly":""},{"venue":"The Milestone Club","event":"Digital Noir featuring Michael Price and DJ Spider","date":"07 15 17","times":"9:00","tuneStub":"","href":"","desc":"Charlotte’s darkest and most aggressive Goth / Industrial dance night.","ticketfly":"1384688"}]