[{"venue":"Evening Muse","event":"Find Your Muse Open Mic with Margo Cilker","date":"08 28 17","times":"\n  Doors: 7:00 pm / Show: 8:00 pm ","ticketfly":"1520891","tuneStub":"","href":"http://www.eveningmuse.com/event/1520891-find-your-muse-open-mic-margo-charlotte/","desc":"","img":""},{"venue":"Evening Muse","event":"Find Your Muse Open Mic with Margo Cilker","date":"08 28 17","times":"\n  Doors: 7:00 pm / Show: 8:00 pm ","ticketfly":"1520891","tuneStub":"","href":"http://www.eveningmuse.com/event/1520891-find-your-muse-open-mic-margo-charlotte/","desc":"","img":""},{"venue":"Evening Muse","event":"Noah Guthrie","date":"08 30 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1520866","tuneStub":"","href":"http://www.eveningmuse.com/event/1520866-noah-guthrie-charlotte/","desc":"With nearly half a million Facebook fans and over 66 million YouTube views, it’s easy to see why Noah Guthrie, a rising blues singer-songwriter has become one of the most talked about viral sensations in years. Growing up in the suburban community of Greer, South Carolina, Noah credits his father, a studio singer and musician, with encouraging him to pursue music at a young age.\n\nWhen Noah received his first guitar at age fourteen, his musical gift became apparent to friends and family when he would perform small concerts for them. Noah has become a polished multi-talented instrumentalist, perfecting his craft on guitar, bass and trumpet. \n\nHis rise to stardom began in May 2012 when Noah posted a stripped-down blues cover of the popular Billboard #1 single “Sexy and I Know It” by hip-hop group LMFAO.  The video reached worldwide audiences and accumulated over eight million views in just under a week.  Its views continue to climb daily, reaching over 24 million views to date. As a result of the explosive popularity, Noah was invited to appear on NBC’s Today Show, The Tonight Show with Jay Leno and Dancing with the Stars.  His arrangement of the song has also been performed on The Voice and The X-Factor. \n\nNoah has the stage presence of a seasoned veteran, sharing the stage with high profile artist like Ed Sheeran, Selena Gomez, Neon Trees, Ben Rector, Cobra Starship, Matisyahu, and Matt Nathanson.  He has toured across the continental United States and even has a strong touring base in Germany and the Netherlands after his cover of “Sexy and I Know It’ was spun on European radio.\n\nAfter his national media exposure, Noah was invited to join the cast of the hit TV show Glee during the sixth and final season.  He portrayed Roderick Meeks, a recurring character, who joins the New Directions glee club at William McKinley High School.  It’s an experience Noah recounts as “an amazing opportunity.” \n\nNoah released his debut album, Among The Wildest Things, in 2014.  He has recently finished his second project and is releasing the first single, “Pardon Me,” from the six track EP this Spring with the Full EP releasing early Summer.  Noah Guthrie continues to focus on touring, songwriting, collaborating and posting more popular covers on YouTube based on fan requests. \n\nThe South Carolina native never forgets his roots, though.  “In the end I’m just a small-town kid who is out there trying to pursue his dreams,” Noah said. “It feels good whenever I get to come home and perform for the town that really made me who I am.”","img":""},{"venue":"Evening Muse","event":"The 4 Korners","date":"09 08 17","times":"\n  Doors: 10:00 pm / Show: 10:30 pm ","ticketfly":"1532618","tuneStub":"","href":"http://www.eveningmuse.com/event/1532618-4-korners-charlotte/","desc":"With influences from Chick Corea Elektric Band, Dave Weckl Band, Yellowjackets and Tribal Tech, The 4 Korners have completed their second album titled \"Portal of Gold\" released on  Rope-a-Dope records. This brotherhood started with Clarence Hill (Keys), James Thompson (Bass) and Isaac Thompson (Guitar) around the late 90's early 2000's. Jerrod Sullivan (Drums) joined the band in 2014 and has been a great addition to the band. They aspire to reignite the music scene with their passionate, high energy sound of original live instrumental music. They put their hearts and souls into every piece that they compose and their audiences always feel it. Although they are in the jazz fusion genre, they prefer to call it \"Journey Music,\" encouraging the listener to take a musical joyride from start to finish. Just let your mind run free and enjoy the ride as you listen to the sound of The 4 Korners!","img":""},{"venue":"Evening Muse","event":"Happy Labor Day","date":"09 04 17","times":"\n  Doors: 7:00 pm / Show: 8:00 pm ","ticketfly":"1536358","tuneStub":"","href":"http://www.eveningmuse.com/event/1536358-happy-labor-day-charlotte/","desc":"The Muse Crew wishes everyone a safe and happy Labor Day holiday!!!  See you soon for more LIVE original music.","img":""},{"venue":"Evening Muse","event":"Nathan AngeloMatt Simons","date":"09 02 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1490599","tuneStub":"","href":"http://www.eveningmuse.com/event/1490599-nathan-angelo-matt-simons-charlotte/","desc":"Matt Simons BioEven before a record label or traditional backing, Matt Simons had already been heard around the globe. After being noticed from a Facebook ad he created for his independent album Pieces, the song “With You” received a high-profile 2013 placement on one of the biggest Dutch soap operas. Before the Northern California-born and Brooklyn-based singer-songwriter knew it, he began selling out shows in Europe and was serving as guest judge on the Netherlands X-Factor, while “With You” went platinum in Holland and earned the unofficial title of the country’ s “most played funeral song.”“As strange as it may sound, that was the ultimate compliment,” he says. “My music was being used to celebrate legacies. The fact that people could be that affected by a song I wrote was incredible to me. I didn’ t know that’ s what I loved about writing so much, but I learned it.”He can speak to any occasion though, and that’ s why his 2015 single “Catch & Release” and its (Deepend Remix) became a runaway international smash. Cumulatively, the song amassed over 150 million-plus Spotify streams and counting in less than a year’ s time, and the remixed version soared to #1 on HypeMachine twice. Stateside, it went Top 5 at AAA radio and soundtracked a tourism ad for the state of Arizona, whileBillboard pegged it as one of “Tomorrow’ s Hits.” He made his North American television debut on NBC’ s Today Show, performing the song. Globally, it clinched #1 in 7 countries including France, Germany, Belgium, and Spain, reaching platinum in Germany, Belgium, Holland & Switzerland, and gold certifications in Italy and Sweden. Sold out tours followed as well as festival appearances at Pinkpop, Frequency, and many more. A marriage between styles, “Catch & Release” lithely balances a deep house soundscape with finger-picked acoustic guitars and his soulful crooning. “’ Catch & Release’  is about the common shared struggle of the grind and how everyone’ s got their own way of dealing with it,” he explains. “Some people will go for a run, or others will have a drink, etc. It’ s whatever your way of releasing all the tension you build over the course of any given day. We wanted to do something different with the remix. The dance community seems hungry for songs with a deeper meaning. It felt really natural.”“Catch & Release” paved the way for his 2016 EP, When The Lights Go Down [[PIAS] Recordings]. Building off that hybrid of tropical house charm and acoustic soul, he crafted the collection’ s five tracks at various spots across the world, while touring behind “Catch & Release.”Matt cut the first single “Lose Control” during a stop in London with producer Steve Mac [James Blunt, Kelly Clarkson, Leona Lewis]. He delicately expands his sound once more with sunny production and another undeniable refrain. Next to Steve, Matt worked again with his friends Bob and Falco of Deepend on the track, who added additional production. “Whereas ‘ Catch & Release’  is about self-introspection and self-awareness, ‘ Lose Control’  is about letting your inhibitions go and connecting with another person,” he reveals. “It’ s in that tropical house lane, but it takes another step forward.  The EP is a little bit of everything.”The EP title When The Lights Go Down speaks to his knack for lyrical storytelling. Throughout the new music, he perfects that penchant for a captivating tale.\n“I like to write based off of a concept,” he says. “There’ s a narrative at the heart of When The Lights Go Down. When you’ re going through a breakup, everything could feel fine during the day, but once it turns nighttime and it’ s time go to sleep, you really start missing somebody.”It’ s no surprise he’ s been honing his chops since childhood. For Matt, music’ s a family tradition as both of his grandparents were professional opera singers, and his dad shared a love for The Beatles and the classics with him early on. Playing saxophone his whole life, he got a degree in Jazz Saxophone Performance at The Purchase College Conservatory. That background ultimately gave him the foundation to write these kinds of songs.“I won’ t ever lose that influence,” he leaves off. “I started off with jazz and those rhythms and patterns have been ingrained in me. Now, my main focus is to continue writing these songs that really can resonate.”","img":""},{"venue":"Evening Muse","event":"Nathan AngeloMatt Simons","date":"09 02 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1490599","tuneStub":"","href":"http://www.eveningmuse.com/event/1490599-nathan-angelo-matt-simons-charlotte/","desc":"Matt Simons BioEven before a record label or traditional backing, Matt Simons had already been heard around the globe. After being noticed from a Facebook ad he created for his independent album Pieces, the song “With You” received a high-profile 2013 placement on one of the biggest Dutch soap operas. Before the Northern California-born and Brooklyn-based singer-songwriter knew it, he began selling out shows in Europe and was serving as guest judge on the Netherlands X-Factor, while “With You” went platinum in Holland and earned the unofficial title of the country’ s “most played funeral song.”“As strange as it may sound, that was the ultimate compliment,” he says. “My music was being used to celebrate legacies. The fact that people could be that affected by a song I wrote was incredible to me. I didn’ t know that’ s what I loved about writing so much, but I learned it.”He can speak to any occasion though, and that’ s why his 2015 single “Catch & Release” and its (Deepend Remix) became a runaway international smash. Cumulatively, the song amassed over 150 million-plus Spotify streams and counting in less than a year’ s time, and the remixed version soared to #1 on HypeMachine twice. Stateside, it went Top 5 at AAA radio and soundtracked a tourism ad for the state of Arizona, whileBillboard pegged it as one of “Tomorrow’ s Hits.” He made his North American television debut on NBC’ s Today Show, performing the song. Globally, it clinched #1 in 7 countries including France, Germany, Belgium, and Spain, reaching platinum in Germany, Belgium, Holland & Switzerland, and gold certifications in Italy and Sweden. Sold out tours followed as well as festival appearances at Pinkpop, Frequency, and many more. A marriage between styles, “Catch & Release” lithely balances a deep house soundscape with finger-picked acoustic guitars and his soulful crooning. “’ Catch & Release’  is about the common shared struggle of the grind and how everyone’ s got their own way of dealing with it,” he explains. “Some people will go for a run, or others will have a drink, etc. It’ s whatever your way of releasing all the tension you build over the course of any given day. We wanted to do something different with the remix. The dance community seems hungry for songs with a deeper meaning. It felt really natural.”“Catch & Release” paved the way for his 2016 EP, When The Lights Go Down [[PIAS] Recordings]. Building off that hybrid of tropical house charm and acoustic soul, he crafted the collection’ s five tracks at various spots across the world, while touring behind “Catch & Release.”Matt cut the first single “Lose Control” during a stop in London with producer Steve Mac [James Blunt, Kelly Clarkson, Leona Lewis]. He delicately expands his sound once more with sunny production and another undeniable refrain. Next to Steve, Matt worked again with his friends Bob and Falco of Deepend on the track, who added additional production. “Whereas ‘ Catch & Release’  is about self-introspection and self-awareness, ‘ Lose Control’  is about letting your inhibitions go and connecting with another person,” he reveals. “It’ s in that tropical house lane, but it takes another step forward.  The EP is a little bit of everything.”The EP title When The Lights Go Down speaks to his knack for lyrical storytelling. Throughout the new music, he perfects that penchant for a captivating tale.\n“I like to write based off of a concept,” he says. “There’ s a narrative at the heart of When The Lights Go Down. When you’ re going through a breakup, everything could feel fine during the day, but once it turns nighttime and it’ s time go to sleep, you really start missing somebody.”It’ s no surprise he’ s been honing his chops since childhood. For Matt, music’ s a family tradition as both of his grandparents were professional opera singers, and his dad shared a love for The Beatles and the classics with him early on. Playing saxophone his whole life, he got a degree in Jazz Saxophone Performance at The Purchase College Conservatory. That background ultimately gave him the foundation to write these kinds of songs.“I won’ t ever lose that influence,” he leaves off. “I started off with jazz and those rhythms and patterns have been ingrained in me. Now, my main focus is to continue writing these songs that really can resonate.”","img":""},{"venue":"Evening Muse","event":"LILLY HIATT","date":"09 09 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1505873","tuneStub":"","href":"http://www.eveningmuse.com/event/1505873-lilly-hiatt-charlotte/","desc":"Royal Blue, the second album by East Nashville firebrand Lilly Hiatt, is about the majesty of melancholy—or, as she explains it, “accepting the sadder aspects of life and finding some peace in them.” A dance between pedal steel and synths, the album examines the vagaries of love and commitment but steadfastly refuses to romanticize any notion of romance. Singing in a barbed lilt full of deep worry and gritty determination in equal measure, she conveys emotions too finely shaded to be easily named, yet will be familiar to any listener who’s had their heart broken—or has broken a heart.\n\nThis is, in other words, not a well-behaved singer-songwriter album. Instead, it’s feisty and rough-around-the-edges, full of humor and bite and attitude from a woman who proclaims, “I’d rather throw a punch than bat my eye.” Royal Blue hints at autobiography without sounding self-absorbed, as Lilly transforms a rough patch of life into smart, sturdy, sometimes even hilarious songs that don’t sit squarely in any one genre. Instead, Royal Blue reaches out boldly and playfully into many different sounds and styles: Austin folk rock, Pacific Northwest indie, pre-Oasis Britpop, New York punk ca. 1977. There are ‘90s alt guitars and ’00 indie synths, some twang and some Neko Case and Kim Deal.\n\nSetting the tone for the album, “Far Away” marries a shimmery Cure synth theme to a steady rock-and-roll backbeat, as Lilly explains the devastating realities of a love gone sour: “I have never felt more far away than when you were right here.” When she delivers a volley of ooo-ooo-ooohs on the coda, it’s hard to tell whether she’s lamenting her loss or proclaiming her freedom. Even at its most personal, Royal Blue remains complicated and often contradictory. The surging surf-country number “Machine” hints at rebellious adolescence while “Somebody’s Daughter” is a nod to Lilly’s songwriting father, John Hiatt.\nLilly’s songs are equal parts romantic autopsy and acid kiss-off to a dismissive lover. He shows up again on the fidgety “Get This Right,” with its insistent drum patter, churning guitars, and anthemic chorus. “When you turn your lamp off, please hear my sweet, soft voice,” Lilly sings over the gentle acoustic strums and Doppler-effect synths on “Your Choice.” Then she adds, with startling finality, “You made your choice.” Royal Blue is not your typical break-up album, though. Lilly would rather rock than mope.\n\nTo say she comes by it naturally shouldn’t imply that it’s all easy for her. Her father is a famously eclectic singer-songwriter whose tunes have been covered by Emmylou Harris, Nick Lowe, Willie Nelson, and Bob Dylan, among others. Living just outside of Nashville, he provides gentle counsel and sage advice to his daughter. “I’d be a fool not to take it,” she says. “We have a really good relationship, and there’s a lot of trust there, so I feel comfortable talking to him about certain songwriting predicaments. I played him some songs I was trying to write, and he said, these are really good, but it sounds like you’re trying to do something different. You don’t have to come up with special chords or anything. Why don’t you just be you? That was simple advice, but good advice.”\n\nLilly being herself means playing songs that are sharply witty, brutally frank, and musically adventurous. In that regard, her backing band has proved crucial in helping her realize her full potential as a songwriter and performer. The group has been playing and touring with her for years, and they played on her 2012 debut, Let Down. “We’re tougher now with a new confidence in our playing,” she says of the band, which includes Beth Finney on lead guitar, Jake Bradley on bass, Luke Schneider on pedal steel guitar and Jon Radford on drums.\n\nIt helps that they all share a love of ‘90s alt-rock bands, which comes through in the distressed guitars, the urgent backbeats, and the post-punk synths. Lilly cites the Pixies and the Breeders as influences on this record, as well as Dinosaur Jr. and—her all-time faves—Pearl Jam. The group recorded these dozen songs at Playground Sound, a small studio located in producer Adam Landry’s backyard in Nashville.\n\n“I know Adam and am a fan of his work,” Lilly says. “I also knew he did analog recording, which excited me. I wanted to try that.” She chose Landry because he was a versatile rock producer who has worked with Deer Tick, T. Hardy Morris of Dead Confederate, and Hollis Brown. “Sometimes I think it might be easy to take my songs to Twang Town, if someone wanted to, but they’re not country songs. I had a feeling Adam would bring out other things in the music. Which is exactly what he did.”\n\nIn the studio, Adam credits Lilly with being game for anything: “She would be playing electric guitar with her band, and I’d be in the control room running the tape machine. I had an old KORG polysynth plugged into a Memory Man. I reached over and started playing it, and she didn’t miss a beat. She’d just go with it. She trusted me and was open-minded, and I think that helped create that sort of late ‘80s/early ‘90s vibe on the record.” But it all comes down to the songs themselves. “A killer backing track and a killer vocal can be totally ruined by really stupid lyrics,” says Adam, who was drawn to the stark candor of Lilly’s songwriting. “She’s just real honest. That’s the big thing here.”\n\n“That’s the only way I know how to write as of now,” she admits. “Maybe that will change, because writing always does, and maybe I’ll learn to take myself out of it a little more and embellish the details. But right now I don’t know any other way. I hope people don’t think, wow, she really has some issues. But you know what? If they do, that’s fine, too. I have a hard time saying a lot of things in life, so it’s easier to do it through the song. It’s a healthy coping process for me.”","img":""},{"venue":"Evening Muse","event":"the grand shell gameDavid Childers","date":"09 02 17","times":"\n  Doors: 10:00 pm / Show: 10:30 pm ","ticketfly":"1536330","tuneStub":"","href":"http://www.eveningmuse.com/event/1536330-grand-shell-game-david-charlotte/","desc":"David Childers is a musician, poet, historian, painter, father and champion of people who get tangled up in the bureaucratic legal system; he specializes in helping people navigate the maze of the Social Security system to obtain their benefits. \nHe grew up in the cotton mill country of North Carolina and started playing banjo when he was 14. “I didn’t have the confidence to be a musician,” he says. “I sang in the church choir so I could get close to the good looking girls I knew.” He started playing guitar in college, but he was a 37-year-old practicing lawyer before he got serious about his songwriting. His first album, Godzilla! He Done Broke Out!, was released in 1994. It marked the beginning of 13 years of relentless touring, while working 60 hours a week as a lawyer. \nHe made nine more albums before he burned out and stopped performing in 2007. “I ran into a brick wall, burned out from the touring, drinking, staying out late and my work schedule.” Childers sat in a chair for a few months before having a spiritual awakening. “I wanted to investigate God. I dove into the Quran, but I grew up with the Bible and began reading. It helped me understand the spiritual consequences of the things I was doing. I became happier and more at peace. Now, I try to set an example with my life and be decent to other people.” \nHe started playing music again in 2010, recording two albums, Glorious Day (2010) and Next Best Thing (2013) with the Overmountain Men, a band that Avett Brother bassist Bob Crawford – a huge fan and close friend of Childers’ - helped produce. “David is the most prolific North Carolina songwriter alive,” Crawford said. “Everywhere I go, people ask about him. It’s great to see people constantly discovering this man and his massive body of work.”","img":""},{"venue":"Evening Muse","event":"the grand shell gameDavid Childers","date":"09 02 17","times":"\n  Doors: 10:00 pm / Show: 10:30 pm ","ticketfly":"1536330","tuneStub":"","href":"http://www.eveningmuse.com/event/1536330-grand-shell-game-david-charlotte/","desc":"David Childers is a musician, poet, historian, painter, father and champion of people who get tangled up in the bureaucratic legal system; he specializes in helping people navigate the maze of the Social Security system to obtain their benefits. \nHe grew up in the cotton mill country of North Carolina and started playing banjo when he was 14. “I didn’t have the confidence to be a musician,” he says. “I sang in the church choir so I could get close to the good looking girls I knew.” He started playing guitar in college, but he was a 37-year-old practicing lawyer before he got serious about his songwriting. His first album, Godzilla! He Done Broke Out!, was released in 1994. It marked the beginning of 13 years of relentless touring, while working 60 hours a week as a lawyer. \nHe made nine more albums before he burned out and stopped performing in 2007. “I ran into a brick wall, burned out from the touring, drinking, staying out late and my work schedule.” Childers sat in a chair for a few months before having a spiritual awakening. “I wanted to investigate God. I dove into the Quran, but I grew up with the Bible and began reading. It helped me understand the spiritual consequences of the things I was doing. I became happier and more at peace. Now, I try to set an example with my life and be decent to other people.” \nHe started playing music again in 2010, recording two albums, Glorious Day (2010) and Next Best Thing (2013) with the Overmountain Men, a band that Avett Brother bassist Bob Crawford – a huge fan and close friend of Childers’ - helped produce. “David is the most prolific North Carolina songwriter alive,” Crawford said. “Everywhere I go, people ask about him. It’s great to see people constantly discovering this man and his massive body of work.”","img":""},{"venue":"Evening Muse","event":"IAIN MATTHEWS","date":"09 14 17","times":"\n  Doors: 6:30 pm / Show: 7:30 pm ","ticketfly":"1444776","tuneStub":"","href":"http://www.eveningmuse.com/event/1444776-iain-matthews-charlotte/","desc":"Iain Matthews first gained attention as a founding member of and vocalist for the innovative Fairport Convention’s first three albums, changing the face of folk music in this country. He moved on to create Matthews’ Southern Comfort, exploring his interest in American music. They had a No 1 hit in the UK with Joni Mitchell’s Woodstock.  Never one to stand still for very long Iain moved on during the 1970’s with another group, Plainsong an ensemble that allowed Iain to blossom as a songwriter and acoustic guitarist -  supported by his ex-Fairport mates Sandy Denny and Richard Thompson both in the studio and in Richard’s case on tour. Between his own solo recording and various Plainsong line-ups Iain released ten albums to critical acclaim including another well known Top Ten US hit with the single, Shake It. \n\n During the early 1980’s Matthews turned towards the business side of music as a rep for Island Records, but was persuaded by Robert Plant of Led Zeppelin to get back to making music. He moved to the USA for more solo work and Plainsong records. During this period he recorded a wonderful version of Peter Gabriel’s, “Mercy Street”, contributed to a Phil Ochs’s tribute album and recorded plus toured with Nanci Griffith. Next he released another respected record with the somewhat sarcastic title, “Excerpts from Swine Lake”.\n\n In 2000 Matthews settled in The Netherlands and found a busy, happy life in Europe with more touring of the UK and Continent. Yet more well received collaborative recording were issued including a tribute album to Sandy Denny. Since then Matthews has found one of his most sympathetic musical companions the pianist, Egbert Derix. However, Matthews feels he has finally found an almost perfect musical sweet spot, playing solo, in support of his most recent solo album \" The Art of Obscurity”. \n\nAs his 50 years ( can this be true ) in the business prove, things do come around again and again....and Iain Matthews, guitar in hand and songs springing from his muse, is available for bookings.","img":""},{"venue":"Evening Muse","event":"ALLISON PIERCE","date":"09 12 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1547484","tuneStub":"","href":"http://www.eveningmuse.com/event/1547484-allison-pierce-charlotte/","desc":"Allison Pierce was born in Birmingham, Alabama to a family of creative individuals. In their teens, Allison and sister Catherine formed the acclaimed duo The Pierces who released four full-length albums, most recently on Polydor/Universal. In 2007 Rolling Stone magazine named the sisters as a Breaking Artist to watch. The duo’s songs have been placed in various network TV shows including the song “Secret” which has been the theme song for the HBO show Pretty Little Liars for the run of the show. In live performance the sisters have toured as the supporting act for Coldplay and Lissie among others. Allison Pierce now steps into the spotlight as a solo artist.\n\n“This album feels like the most important creative outpouring of my life so far,” Allison Pierce says of her solo debut, Year of the Rabbit (Sony Masterworks), produced by Ethan Johns (Ryan Adams, Ray LaMontagne, Paul McCartney). “It feels like the most genuine expression of who I am, musically and personally.”\n\nThe new album is Allison’s first as a solo artist, following two decades of recording and performing with her sister Catherine as The Pierces. The duo’s five albums and constant tours brought them critical acclaim and a loyal fanbase, especially in Britain. But as the years passed, each longed to express herself unfettered by the other, and in August 2015, The Pierces decided to take a break, whereupon the sisters launched solo careers.\n\n“When you’re in a group with another person, there’s always compromise,” says Allison. “There were amazing times, and there were some really challenging times—probably some of the most challenging times in my life. You know that saying from Proverbs, ‘As iron sharpens iron, so one man sharpens another’? That’s what it felt like. Now, we’re both free to finally express exactly who we are. \n\n\"Year Of The Rabbit\" is out on Sony Masterworks May 5. Debut single coming soon.","img":""},{"venue":"Evening Muse","event":"NoDa Neighborhood & Business Assoc. Monthly Meeting","date":"09 05 17","times":"\n  Doors: 6:00 pm / Show: 6:30 pm ","ticketfly":"1536366","tuneStub":"","href":"http://www.eveningmuse.com/event/1536366-noda-neighborhood-business-charlotte/","desc":"This meeting is for everyone:\n\nNoDa Businesses\nNoDa Homeowners\nNoDa Renters\nNoDa Workers\nNoDa Artists\nNoDa Aficionados\n\nEVERY MONTH (except for July), find out what is going on in your 'hood: construction, rezonings, business openings, events, crime concerns, volunteer opportunities, and much much more.\n\nIt's a great way to meet your neighbors (hello, we meet at a bar) and be in the know.","img":""},{"venue":"Evening Muse","event":"The Tosco Music Open Mic - Still GREAT Summer night fun!","date":"09 06 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1536400","tuneStub":"","href":"http://www.eveningmuse.com/event/1536400-tosco-music-open-mic-still-charlotte/","desc":"Open Mic format for the Tosco Music Open Mic is we gather for a sing-a-long session from 7:30 to 8 pm or so, then we start going down the list of performers.  Everyone gets one song, so be in tune and ready to play when your name is called.  It is first come, first play on the sign up sheet, however we give priority to school aged performers.  \n\nTosco Music’s mission is to…\npresent a wide variety of music through performances and outreach programs;\nfoster a sense of community among listeners and performers through inclusive participation; and\nconnect professional and amateur musicians to share and inspire one another.","img":""},{"venue":"Evening Muse","event":"SEAN MCCONNELL","date":"09 07 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1531494","tuneStub":"","href":"http://www.eveningmuse.com/event/1531494-sean-mcconnell-charlotte/","desc":"“From a very young age, I just knew that I was gonna spend my life making music,” Sean McConnell states. “I never really questioned it, so I just forged ahead and didn’t let anything stop me.”\n\nAlthough his self-titled new Rounder album will serve as his introduction to many listeners, the personable young artist is actually a seasoned, distinctive songwriter and an experienced performer with a quartet of D.I.Y. indie releases to his credit. Having built a substantial grass-roots fan base through tireless touring and old-fashioned hard work, McConnell is primed for a mainstream breakthrough.\nSean McConnell demonstrates exactly why McConnell has already won such a devoted audience. He writes vivid, forthright, effortlessly catchy songs whose incisive melodic craft is matched by their resonant emotional insight. Such instantly memorable tunes as “Holy Days,” “Beautiful Rose,” “Bottom of the Sea” and “Best We’ve Ever Been” are both catchy and personally charged, conveying an unmistakable sense of personal experience while exploring universal truths.\n\n“This record’s a bit of a step for me,” McConnell asserts. “It’s a real storyteller record, and it’s pretty autobiographical. I’m learning how to be more honest and understated in my writing, and I wanted to match that sonically and vocally. When I look at this collection of songs, I see a lot of nostalgia, and looking back on sacred moments. I’m kind of nostalgic and reflective by nature.”\n\nMcConnell recorded the album in his adopted hometown of Nashville with producers Jason Lehning and Ian Fitchuk, who also contributed keyboards and drums, respectively. The recording took place prior to McConnell signing with Rounder, with the artist financing the sessions himself.\n\n“This project started,” he explains, “when I went to a cabin by myself for a week, with the intention of writing some songs. In that week, I wrote about half of the songs on the record, and I could see the thread of what this record was gonna be. That was exciting for me, because it normally takes me a year to find an album’s worth of songs that belong together. The whole recording process was really fun and liberating, and the energy in the studio was really positive.”\n\nSongwriting and music-making have been a part of Sean McConnell’s life for as long as he can remember. “My mom was a singer and my dad was a guitar player and songwriter,” he notes. “They’d play in coffeehouses and I’d go along and watch them perform, and seeing that lifestyle showed me that music was an option. And seeing my dad painstakingly writing songs had a huge influence on me, and gave me license to feel like I could enter into that world.”\n\nBy the age of ten, he had become proficient on guitar and was writing his first songs. “I fell in love with the instrument first,” McConnell recalls. “Learning guitar gave me a feeling of uncharted territory laid out in front of me. And as I got better on guitar, the songs started to come naturally. At around the same time, we moved from Massachusetts to Georgia, and the first song I wrote was about the feeling of leaving the familiar and feeling lost in a new place. Music gave me a focus and became an emotional outlet for me.”\n\nHis supportive family background helped to instill the confidence and drive to pursue his muse early on. “I started playing in middle school, doing any gig I could get just to get my chops up,” he says. “By high school, I would be doing local gigs and really promoting them, bringing out a couple hundred kids to my shows a few times a month and starting to make a decent living at it. That made me think that maybe I could do this in other towns. So I started traveling around the southeast a little bit, and there was always enough progress to take things to the next level. While I was in college, I did a lot of college touring, just me driving all over the United States in a Toyota Corolla. It was hard work, but it showed me that I could do it.”\n\nMcConnell was just 15 when he self-released his first album, Faces, in 2000. Followed by 2001’s Here In The Lost and Found, 2004’s 200 Orange Street, 2006’s Cold Black Sky, 2007’s Tell The Truth, 2008’s The Walk Around EP, 2010’s Saints, Thieves and Liars, 2012’s Midland and the 2014 EP The B Side Session.\n\n“I had a guitar teacher in Atlanta who had a home studio, and he was the first one to say ‘Hey, you should make a record,'” he says. “If I go back and listen to that first record now, the songs are kind of crude, but at the same time there’s a directness about them that I like. My writing has evolved since then, but at the same time I’ve tried to hold on to some of that directness.”\n\n“I’m really attracted to songwriters who just put it out there honestly, and I feel like I’m getting back to basics and expressing things in a simple, direct way on the new album,” he continues. “I’m just trying to learn how to be a more honest storyteller, trying to get my mind in a place where I’m not actually thinking and the music’s just kind of happening naturally. When I read interviews with songwriters that I admire, they always say that the best songs are the ones that just kind of happen, like they’re operating from the unconscious. That’s a place I want to get to.”\n\nHaving spent much of his life honing his craft and paying his dues, Sean McConnell is eager to launch the next chapter of his career.\n“I kind of feel like I’ve been in a really long boot camp,” he concludes. “I’m really grateful for that, because I feel like I’ve gained enough experience to know the deal and be prepared for anything. I’m excited to see where the next part of the journey takes me.”","img":""},{"venue":"Evening Muse","event":"CURTIS MCMURTRY","date":"09 13 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1540464","tuneStub":"","href":"http://www.eveningmuse.com/event/1540464-curtis-mcmurtry-charlotte/","desc":"Curtis McMurtry writes about villains that think they're victims. Influenced by Fiona Apple, Billy Strayhorn and Leonard Cohen, Curtis' music combines piercing lyrics with lush chords and unusual arrangements. His first solo album Respectable Enemy  was released in August 2014, and drew comparisons to Calexico and John Fullbright. His sophomore album The Hornet's Nest is was released in February 2017, and continues to garner critical acclaim.\n​\nCurtis was born and raised in Austin, Texas and grew up listening to local musicians Warren Hood, Ephraim Owens, Seela, and his father, James McMurtry. Curtis studied music composition and ethnomusicology in college, primarily writing contemporary chamber music for banjo and strings. After graduation, Curtis moved to Nashville to sharpen his songwriting by co-writing with elder statesmen including Fred Koller and Guy Clark. He has since moved back to Austin where he performs as a quartet with cellist Diana Burgess (of Mother Falcon), upright bassist Taylor Turner (of Magia Negra) and trumpeter Nathan Calzada.\n \n\"Backed by a stand-up bass, cello and occasionally a horn section, the 24-year-old McMurtry epitomizes the catch-all nature of Americana\" - Rollingstone.com\n \n\"Simply put, at 23, McMurtry's dark and deep debut solo album, Respectable Enemy, marks him as a world-class talent who not just stands on his own merits, but soars on them.\"\n- Thomas Gerbasi, New York Examiner\n​\n\"The second album by McMurtry shows its conceptual ambition in the way it coheres, exploring a range of emotions through  a variety of personae. From the vulnerable innocence of the opening “Hard Blue Stones” through the corpse picked clean on the closing “Silver World,” the 13-song cycle shimmers through the desires and flaws of a shared humanity. .\" - Don McLeese, No Depression","img":""},{"venue":"Evening Muse","event":"Eliot Bronson Album Release Show!","date":"09 01 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1530546","tuneStub":"","href":"http://www.eveningmuse.com/event/1530546-eliot-bronson-album-release-charlotte/","desc":"Picture a street in working-class Baltimore some 30 years ago. Kids play in the shadows of the row houses that line the sidewalks. Their parents sit on the stoops leading up to front doors. It all seems normal at first glance. \n\nBut zoom in on one of these homes — that old duplex built back when this part of town was still mainly open fields. Inside is a completely different community, where fundamentalism, hippie values and volatile, unpredictable emotions coexist and collide. Escape is difficult: the only way out is to pass through the bedrooms of people you might be trying to get away from.\n\nThis is where Eliot Bronson grew up. Yeah, he often wanted to slip away from there, but the first thing he saw once he exited was the Pentecostal Church across the street where his father and grandfather had preached and where congregants spoke in tongues.\n\nSo Eliot looked inward instead.\n\n“For better or worse, I’ve always been a weirdo,” he remembers. “I was reading about Zen Buddhism when all my friends were getting high and drunk in high school.\n\n“Of course,” he adds, “I did all that stuff later.”\n\nHe also observed. In this kaleidoscopic family, where glossolalia and, on occasion, alcohol-fueled ravings, sometimes bled into each other, Bronson found shelter in music. At age 15, he got his first guitar and started teaching himself to play. “Right away, I wanted to write my own songs,” he says. “My house was pretty chaotic, crazy, and unhealthy, so I took to music like it was a life raft. It was something I could do to keep myself alive.”\n\nPunk rock was his shelter at first. Then one day his dad put on a few of his favorite LPs — Bob Dylan’s The Times They Are A-Changin’, something by Brownie McGhee and Sonny Terry. Eliot had heard these albums a thousand times before. This time, though…\n\n“… it resonated with me,” Eliot says.  “It wasn’t just in the background. I tuned into it for the first time. There was a magic and a power there. It didn’t talk down to the listener but it was also high art. It asked you to be smart and to become a better version of yourself. For me, this was a moment when it became my music, not just my parents’ music.”\n\nFrom local coffee houses and venues beyond Baltimore, Bronson sharpened his writing and performance. He cultivated a working approach that involved singing to himself as ideas came to him and never jotting down chord changes or lyrics once he had committed the finished version to memory. A local following grew. Astute observers saw something different in the young artist’s work. The Baltimore Sun even anointed him “a folk singing wunderkind.”\n\nExpanding his range, Bronson toured as one-half of a duo. They moved to Atlanta and picked up a gig in a room frequented by The Indigo Girls, John Mayer, Shawn Mullins and other discerning clientele. When his partner quit to take a sensible non-musical job, Bronson persisted on his own. His songs won first-place honors at MerleFest’s Chris Austin Songwriting Contest and Eddie Owens Presents “Songwriter Shootout.”  He issued several solo albums, including a self-titled release in 2014 that prompted Glide Magazine to describe him as “a gorgeous, magnificent hybrid of (Ryan) Adams, Jason Isbell and Jim James.” Bop n Jazz upped that ante by heralding him as “maybe the best singer/songwriter since Dylan.”\n\nWriters may have trouble topping these accolades, though that’s what Bronson’s latest album merits. Scheduled to release Aug. 25 on Rock Ridge Music, James offers songs that are more like pictures than movies, capturing moments and digging deeply into their meanings. A stomping beat, raw harmonica and searing electric slide drives the opening track, “Breakdown In G Major,” followed by a selection of songs that only confirm Bronson’s restless, escalating excellence.\n\n“Good Enough,” for example, captures a relationship in its final stage — a stage that may end tomorrow or stretch on for years. Bronson sings it sorrowfully, asking the rhetorical question of whether “‘good enough’ is good enough for you” from this point. “When I stumbled onto that line, I was like, ‘That’ll probably stick,’” he says. “But I think the song really came from the first line, ‘Were we really that young?’ Sometimes it takes just one line to resonate with me and get me to start writing.”\n\nThen there’s “The Mountain,” whose elusive grandeur delivers a powerful message but leaves it to the listener to parse its meaning. “There’s a very literalist current in writing and music right now,” Bronson observes. “There aren’t a lot of layers to lyrics these days. It’s just what you see on the page. So when you don’t write that way, you get, ‘What are you hiding?’”\n\nHe laughs and then concludes, “I don’t look at it that way. For me, it’s more about how you feel when you hear it. What does it do for you? That’s the message!”\n\nOne more, “Rough Ride,” is a departure for Bronson. Here, the meaning is clear: When 25-year-old Freddie Gray fell unaccountably into a coma in the back of a Baltimore police van, much of America expressed shock and outrage. So did Bronson, but he channeled those emotions into this song.\n\n“I had mixed feelings about writing this because I don’t like inserting my political or social beliefs into art,” he explains. “Art should be about connecting people, not drawing lines between them. But I was listening to Dylan’s Desire album at the time, especially ‘Hurricane.’ I always wanted to write a song like that. It was like, ‘How can you tell a story almost journalistically with great emotional impact and yet not come off heavy-handed?’ I wanted to see if I could do it. Now I’m glad I did.”\n\nKnown for his empathetic work with Sturgill Simpson, Chris Stapleton, Jason Isbell and other utterly original artists, producer Dave Cobb played a critical role in bringing James to fruition. “His honesty and old-fashioned vibe were so appealing to me,” Bronson says. “They leant themselves to the way I created. And, of course, it was a huge boost to have this great artist/producer at your back.” \n\nThey had worked together previously on his 2014 release, Eliot Bronson. “But this album is different,” Bronson points out. “It’s more sparse and economical. My voice is stronger. And I think it’s a step away from the purely Americana vibe of the last one in a direction that I have a hard time defining. I’m excited to discover how this music will define itself.”\n\nWherever he’s bound, Bronson promises to write and sing the truth as he sees and feels it. “For the really great artists, like Dylan or Paul Simon, you never quite find what you’re looking for,” he says. “As you get closer, it changes. It stays elusive. What I want to do now isn’t the same as what I wanted to do five years ago. And that’s what keeps me going.” And it’s that shift that drives Bronson to continue to refine his art.","img":""},{"venue":"Evening Muse","event":"SIRSY","date":"09 08 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1497756","tuneStub":"","href":"http://www.eveningmuse.com/event/1497756-sirsy-charlotte/","desc":"SIRSY is a rock and soul duo with lots of pop sensibility  and just the right amount of sass. The Boston Globe sums it up, “Little band. Big Sound.” No more needs to be said. Although the only thing “little” about Sirsy is that there’s just two of them. The rest is bigger than a T-Rex.\n\nClose your eyes and listen to the power and heart in their music and you’ll swear there’s more than two people on stage. It’s crank up the volume, sing along at the top of your lungs music — even when the ballads kick in. Plus, “Their clever, smart songs have more hooks than a tacklebox.” (-Times Union).\n\n“One of most powerful and flexible voices you’ll ever hear. (-Times Union, NY)\n\nSIRSY is fronted by powerhouse vocalist Melanie (Mel) Krahmer, who is described as “one of the most powerful & flexible voices you’ll ever hear.” (-Times Union). Aftertaste Magazine said, “Bursting and belting out emotion and substance, she can be the queen of ‘in the groove’ rocking or be simple and delicate.” Still, there is more to Mel than her soul-inspired vocals: she also plays a full drum kit while standing up (she’s been featured in Modern Drummer Magazine and is officially endorsed by Paiste Cymbals and Vater Percussion). At their live shows, Mel also plays bass parts with a drum stick (on a keyboard mounted on her drums). She even throws in an occasional flute solo, too.\n\n“Killer rock guitar riffs that are every schoolboy’s dream.” (-Instrumental Magazine Scotland)\n\nGuitarist Rich Libutti plays a well-loved and road-worn Rickenbacker through a pedal board full of vintage effects. “The guitar player is flawless and raw. Clean enough to be enjoyed, and just edgy enough to make you grin.” (-SXSW Music Blog, Austin TX). Live, Rich also plays bass on a keyboard with his feet.\n\nSirsy has played over 250 shows per year nationally for the last 10 years. They average about 60,000 miles per year in their little white van aptly named “Miles”. They tour for a living. Although you’ll normally find them in the headline slot, they’ve also opened for: Maroon 5, Grace Potter and the Nocturnals, Train, RaRaRiot, Third Eye Blind, Collective Soul, Lifehouse, Blues Traveler, Cheap Trick, and many more. SIRSY has played official showcases at CMJ and SXSW as well as marquee venues like The Viper Room and Gramercy Theater.\n\n“Inventive rock and roll.” (-Hartford Courant, CT)\n\nBoth Mel and Rich have theater backgrounds. So, their energetic live show often includes stories and laughter from the stage. Although the lyrics can be introspective and the power of Sirsy can get pretty intense, “there is no sadness there”, Mel says. On stage they radiate joy. “It’s just us being free and playing music…”\n\nSIRSY is currently hard at work writing new songs for a follow-up to their latest EP “Sketches and Ghosts” and their most recent full-length offering, “Coming into Frame”. “Coming into Frame” was produced by Grammy-winners, Paul Kolderie & Sean Slade (Radiohead, Hole, Dresden Dolls, Pixies). SIRSY’s song “Cannonball” was featured on the hit tv show “Shameless” (on Showtime). Their music video for “Lionheart” was in rotation on MTVu and their song “Revolution” was the theme song for a PBS documentary “So Right, So Smart”. (The music video for ‘Revolution’ was also in rotation on HBO).\n\n“Edgy-feel-good” and fun to watch…”\n\n“Pouring their souls out and rocking the shit outta the crowd, was SIRSY … just phenomenal! SIRSY is NOT simply a two piece, they are a head scratching, ‘WOW!’ This is the complete package in a fun sized, rock and roll, smiling, laughing, have a good goddamn time with your friends, band!” (-SXSW Music Blog, Austin TX) “SIRSY is Highly talented, “edgy-feel-good” and fun to watch, you gotta go see them.” (-Houston Music Blog)","img":""},{"venue":"Evening Muse","event":"Circus No. 9","date":"09 21 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1542679","tuneStub":"","href":"http://www.eveningmuse.com/event/1542679-circus-no-9-charlotte/","desc":"Based out of East Tennessee, Circus No.9 is a new progressive acoustic group that embraces the influence of Bluegrass, Americana, and Folk. The group has appeared on stage alongside artists including David Grisman, Bryan Sutton, Larry Keel, and more. With awarded musicians Matthew Davis (2016 National Banjo Champion), Thomas Cassell (2016 Rockygrass Mandolin Champion), Jed Clark (guitar), and Vince Ilagan (bass), Circus No.9 is taking the new acoustic scene by force.","img":""},{"venue":"Evening Muse","event":"The All Organic Comedy Show with Luke Mones & David Spector","date":"09 20 17","times":"\n  Doors: 10:00 pm / Show: 10:30 pm ","ticketfly":"1546431","tuneStub":"","href":"http://www.eveningmuse.com/event/1546431-all-organic-comedy-show-luke-charlotte/","desc":"All Organic Comedy Show & Open Mic!  Part Open Mic, Part Show, All Organic... The All Organic Comedy Show is a NEW, monthly comedy open mic at The Evening Muse. \n\nA comedy open-mic/show hybrid in a cozy room with all the beer and wine you will need to find it funny. Hosted by your certified Comedy Open Mic Host, Jake Manning, this open mic is a great place for all comedians, both novice and experienced, to try out new jokes, polish up old ones, avoid expensive psychiatric bills, or just hang out and enjoy the show.\n\nThis month's FEATURE PERFORMER will actually be TWO: LUKE MONES & DAVID SPECTOR\n\nThe All Organic Open Mic is very lucky to have these two fine comedians to share our stage. \n\nCRAZY FOR ONLY THREE DOLLARS  $3\n\n\n\nSign ups are first come, first serve.","img":""},{"venue":"Evening Muse","event":"The Rocketboys","date":"10 21 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1549723","tuneStub":"","href":"http://www.eveningmuse.com/event/1549723-rocketboys-charlotte/","desc":"Mainstays of the Austin music scene for nearly a decade, anthemic ambient rock band The Rocketboys have steadily built a loyal following over the course of two LPs and a handful of EPs. Their dynamic, majestic songs have earned comparisons to Coldplay, Arcade Fire and Band of Horses, and they’ve captured audiences nationwide with a soaring, stirring live show.\n\nAfter nearly five years without a full-length release, The Rocketboys return with Certain Circles-- a seasoned and cohesive LP that combines the grandiosity of the band’s debut 20,000 Ghosts with the soul of sophomore effort Build Anyway-- with a sprinkling of their 2015 EP Left | Right's pop-sensibility.\n\nThe band's brief stint on an indie label in 2015, despite bringing notable accolades (single Viva Voce on GLEE and over 1 million Spotify streams), left them never quite feeling comfortable in their own artistic skin. Once they parted ways, songs that had been set aside during that time for not being “hit-worthy” resurfaced, and new songs were written with a focus on creating beautiful music regardless of immediate commercial appeal.\n\n“It’s liberating to return to doing what we love, remember why we were playing music in the first place,\" says keyboardist Justin Wiseman. \"We’re incredibly proud of all of the music we’ve created, but with this LP, it feels like we’re back to doing what we do best.”\n\nLead singer and guitarist Brandon Kinder agrees. “We’d gone from small Austin studios, to big LA super studios, to bedrooms, to literally the back of the van. This time, we mostly recorded at my home studio in Austin because we wanted to be able to spend a lot of time experimenting with sounds and parts. It was nice not to feel the pressure of an expensive studio. I think this is the best thing we’ve ever done because of the extra time we were able to spend chasing down ideas.”\n\nFor their last few releases, Kinder says, the band had drifted toward writing songs with an agenda behind them. And it was never really supposed to be that way.\n\n\"When we started this band (in college in Abilene, Texas, circa 2005), it wasn’t to make money, or to write a hit, or to hear our voices on the radio,\" Kinder says. \"We just wrote songs that we thought were cool, and we had fun playing them.\n\n\"I wouldn’t trade the experiences we’ve had for anything, because I think we’ve grown a lot as songwriters and musicians because of it. But I wanted to get back to that innocence, back to writing with our fans in mind, and not a dollar sign.”\n\n\"It’s why we love standing in front of a microphone and an audience-- and about what it is to chase a dream until you almost want to give up. Most of the songs on Certain Circles reflect that journey.”\n\nAdds Wiseman, \"Although we loved the songs on Left | Right and relish the successes it brought, we knew there was something better in terms of what this band can be. Ironically, we wrote many of the songs before and after that label stint during some long periods of just...waiting.”\n\nThe title Certain Circles refers to a Venn diagram. \"It’s one group pulling us one way, and a different group pulling us another,\" says Kinder. “We didn’t realize until we started making this record that there were some groups of people who had one idea of what they thought The Rocketboys should be, and there were other groups, other circles that had another idea of who we are. And at least for me, I lost my direction. I just thought I’d plow along and see what happened. But when we started making this record, we realized we wanted to take it back to where we started, and that's just making music that we love.”\n\nTalk, a live staple of the band for almost two years, makes its recorded debut on the new LP. \"It was going to be one of the main songs on Left | Right, but at the last minute it was axed,\" says Wiseman. \"To be able to re-think it gave us a chance to give the song far more meaning. I think it’s probably one of the best songs we’ve ever done. It always gets a big reaction when we perform it live.”\n\nThe Land that No one Promised Us went through an evolution on its way to the final tracklist. “Originally it was a super-poppy and fun song, and it would’ve probably ended up being our most upbeat track ever,\" says Wiseman. \"Then randomly Brandon did a version of it on piano, playing all seventh (jazzier) chords and way slower. At first it sounded like a joke. But then we couldn’t get past this new take, as it fit the lyrics perfectly. Brandon also did an amazing job with the guitar solo and some other little nuances.”\n\nKinder describes one of his favorite tracks \"You’re Just Going To Let Me Down Again\" (an angst-ridden accusation of a song) \"...it was already one of the best in my opinion, but we were able to add some really interesting keyboard stuff on it,\" he says. \"And Away We Go -- the ending still gives me goosebumps everytime I listen to it.”\n\nThe Rocketboys’ traditional DIY spirit lives on. The band did much of the recording themselves, but employed engineer Kevin Butler (Black Books, Quiet Company) and Andy Freeman (Eisley, Manchester Orchestra) to mix. It’s a natural progression for a band -- a streamlined, but ambitious effort. Certain Circles stands to bring nostalgia to longtime fans while standing out as The Rocketboys' best, most creative material to-date. The end result sublimely captures the arc of the band's circuitous career. Ten years of highs and lows are compressed neatly into 40 minutes of music.\n\nHaving previously toured with bands ranging from Twenty One Pilots, The Mowgli’s, and Relient K, and fresh from a nationwide tour backing Thrice frontman Dustin Kensrue, The Rocketboys previewed much of Certain Circles on a short fall tour at the end of 2016 and several tracks were released this year culminating in the full release of Certain Circles on May 12, 2017.","img":""},{"venue":"Evening Muse","event":"One Love NOLA Tour: Dust Bowl Faeries, Twiggy Branches, Patchwork Symphony","date":"09 23 17","times":"\n  Doors: 10:00 pm / Show: 10:30 pm ","ticketfly":"1542701","tuneStub":"","href":"http://www.eveningmuse.com/event/1542701-one-love-nola-tour-dust-bowl-charlotte/","desc":"Patchwork Symphony is a unique collection of pieces, saved, and assembled. Rock / synthesizers. Wesley Harper | Alex P. | Danny Sher | Aaron Martin","img":""},{"venue":"Evening Muse","event":"One Love NOLA Tour: Dust Bowl Faeries, Twiggy Branches, Patchwork Symphony","date":"09 23 17","times":"\n  Doors: 10:00 pm / Show: 10:30 pm ","ticketfly":"1542701","tuneStub":"","href":"http://www.eveningmuse.com/event/1542701-one-love-nola-tour-dust-bowl-charlotte/","desc":"Patchwork Symphony is a unique collection of pieces, saved, and assembled. Rock / synthesizers. Wesley Harper | Alex P. | Danny Sher | Aaron Martin","img":""},{"venue":"Evening Muse","event":"One Love NOLA Tour: Dust Bowl Faeries, Twiggy Branches, Patchwork Symphony","date":"09 23 17","times":"\n  Doors: 10:00 pm / Show: 10:30 pm ","ticketfly":"1542701","tuneStub":"","href":"http://www.eveningmuse.com/event/1542701-one-love-nola-tour-dust-bowl-charlotte/","desc":"Patchwork Symphony is a unique collection of pieces, saved, and assembled. Rock / synthesizers. Wesley Harper | Alex P. | Danny Sher | Aaron Martin","img":""},{"venue":"Evening Muse","event":"DAVID CHOI","date":"10 18 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1534206","tuneStub":"","href":"http://www.eveningmuse.com/event/1534206-david-choi-charlotte/","desc":"Southern California based singer-songwriter David Choi found fame after posting his first music video on YouTube, titled YouTube: A Love Song and in a week it had received an overwhelming half-a-million views. This launched Choi’s idea to continue producing witty lyrics and high quality content for his soon to be reckoned fans and viewership.\n\nA father who is also a recognized musician in his own rights, and a mother who runs a record store, Choi’s parents undoubtedly had a huge influence on his music career. At a young age, David was required to play the piano and violin--an experience that he did not enjoy. Presently, David has three original albums and currently working on a fourth.\n\nChoi’s original songs and covers have been heard on NBC, FOX, VH1, MTV, A&E, E!, Travel Channel, Style Network, PBS, Food Network Disney, Samsung, and various soap operas internationally. David has also partnered up with companies such as W Hotel, Kellogg’s, Starburst, the American Cancer Society, General Electric, Samsung, JCPenney, and AT&T (It Can Wait).\n\nAs of September 2014, David Choi’s YouTube Channel had over 995,000+ subscribers, over 92,000,000 total views, followed by a his FB, with over 371,000+, Instagram at 70,000+. His social reach has brought him to countries including but not limited to Hong Kong, Japan, South Korea, Indonesia, Australia, Singapore, Malaysia, Philippines, and many more.\n\nDavid Choi was recently featured at the TedXTalks Orange County, A Beautiful Mind where he spoke about how, “...creativity is boundless.” Choi was also recognized and landed front page on the nationally circulated magazine, KoreAm Journal, December 2013 issue. Working with celebrity musicians like Macy Gray and interviewed by Larry King, David enjoys talking about his journey from from posting, “YouTube A Love Song” to receiving over 7 Million Views on his hit original “That Girl,” on youtube.\n\nIn early 2014, David’s hit original, “By My Side”, was licensed by an Indonesian based music label. David partnered up with the beautiful Maudy Ayunda, an acclaimed singer-songwriter from Jakarta, Indonesia to re-release the hit song. “By My Side” hit #1 in iTunes Indonesia, and is played in radio daily.","img":""},{"venue":"Evening Muse","event":"David Ryan Harris","date":"09 19 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1513757","tuneStub":"","href":"http://www.eveningmuse.com/event/1513757-david-ryan-harris-charlotte/","desc":"You’ve either got soul or you don’t. David Ryan Harris most definitely does. The singer, songwriter, and multi-instrumentalist has built an impressive catalog of soulful stories that instantly captivate.“Soulfulness comes from telling stories in in the most honest and direct way that you can,” he says. “People relate to what you’re saying when you sing from the heart.”\n\nThat’s exactly what Harris has done throughout his near three-decade career.Whether itbe in early bands such as Follow For Now, Brand New Immortals or over the course of six full-length solo albums, he tells stories that resonate. He’s carried this same spirit while producing, writing and/or performing with the likes of John Mayer, Dave Matthews, India.Arie, Cassandra Wilson and Guy Sebastian—with whom he co-wrote the RIAA platinum-certified “Battle Scars”. Most recently, it drove Harris’2015’s Lightyears, which boasted guest spots from John Mayer, India.Arie, and Nikka Costa. Along the way, he received acclaim from All Music Guide, Glide Magazine, Elmore Magazine, Performer Magazine, AXS, Relix Magazine, and many others in addition to performing on Fox, CBS, and The CW in between packed tours. His next chapter unfolds on his 2017 seventh offering,Songs For Other People. The songs were culled from collaborations with a multitude of co-writers over the course of the last year or so.\n\n“I wasn’t really intending to make a record,” he admits. “I had co-written written some songs intending to give them to other artists and there were a few thatjust never found homes. The idea of singing these songs myself was something I’d though about for a little while and slowly I started to get excited at how wide open this project could be. There were no boundaries musically or thematically other than the the fact that these songs are for and about other people.”\n\nIn order to track Songs For Other People, he tapped the talents of drummer Terrence Clark who he met via a YouTube audition, keyboard player Zac Rae, Cellist Keith Tutt and GRAMMY® Award-winning producer Mike Elizondo [Eminem, Dr. Dre, Fiona Apple, Maroon 5] on bass. They cut the album’s seven jams in less than three weeks’ time during 2016.\n\nOn the record, Harrisbrings a pronounced sense of passion and power to pop music. The single “Coldplay” balances delicate clean guitar and airy percussion with his dynamic vocal range, fluctuating from a soft croon to a simmeringand soaring falsetto.\n\n“Basically, the song walks you through the beginning of a relationship until the end, and this girl’s love for Coldplay is the backdrop,” he goes on. “The guy finds the tickets in his drawer, and it immediately brings him back. I think everybody has had one of those ‘Coldplay Moments,’as I like to call them.”\n\nElsewhere, “Kerosene” proves both incendiary and intoxicating all at once as it paints a portrait of “a heartbroken guy who’s drinking kerosene and wants to do some damage.”A clean riff drives the upbeat swing of “Good,” which culminates on the unshakable refrain, “You’re the kind of bad girl that would make a good wife.” With its mellotron hum and narrative lyricism, “Average Joe” tackles longing and regret through a tongue-in-cheek visual. “It’s this dudehiding in the bushes looking at his ex-girlfriend with her new guy,” he adds. “The protagonist doesn’t realize he’s the one who’s average.\n\n”In between returning to the road on guitar duty for John Mayerin 2017, Harris will be performing across North Americaon solo shows. \n\nNo matter what he does, that sense of soul ultimately defines him.“When anybody listens to Songs For Other People, I’d love for them to experience a feeling of escape,” he leaves off. “These little vignettes are relatable, but they’re also a respite. Everyone can relate to heartbreak and love. It’s real.”","img":""},{"venue":"Evening Muse","event":"Find Your Muse Open Mic with guest Ray Buckner","date":"09 18 17","times":"\n  Doors: 7:00 pm / Show: 8:00 pm ","ticketfly":"1536484","tuneStub":"","href":"http://www.eveningmuse.com/event/1536484-find-your-muse-open-mic-guest-charlotte/","desc":"For more than half of his life, singer-songwriter Ray Buckner has lived in the space between desire and need when it comes to music. Whether fronting indie rock band Hemingway, producing records for other artists, or simply singing alone in the living room with an acoustic, the drive to create earnest and genuine music is the same. \n\nRay Buckner's music is a healthy blend of americana and indie rock, bringing together the driving energy of a youth steeped in punk rock and the intimate, honest songwriting of a man gaining perspective. Embodying a strong DIY work ethic, Ray has self released two EP's, a split with Denver songwriter Ben Sooy, and a full length acoustic record. At the same time he has maintained a steady touring schedule throughout the east coast, sharing the stage with artists such as Aaron Gillespie, Atlas Genius, and more.","img":""},{"venue":"Evening Muse","event":"Find Your Muse Open Mic with guest Ray Buckner","date":"09 18 17","times":"\n  Doors: 7:00 pm / Show: 8:00 pm ","ticketfly":"1536484","tuneStub":"","href":"http://www.eveningmuse.com/event/1536484-find-your-muse-open-mic-guest-charlotte/","desc":"For more than half of his life, singer-songwriter Ray Buckner has lived in the space between desire and need when it comes to music. Whether fronting indie rock band Hemingway, producing records for other artists, or simply singing alone in the living room with an acoustic, the drive to create earnest and genuine music is the same. \n\nRay Buckner's music is a healthy blend of americana and indie rock, bringing together the driving energy of a youth steeped in punk rock and the intimate, honest songwriting of a man gaining perspective. Embodying a strong DIY work ethic, Ray has self released two EP's, a split with Denver songwriter Ben Sooy, and a full length acoustic record. At the same time he has maintained a steady touring schedule throughout the east coast, sharing the stage with artists such as Aaron Gillespie, Atlas Genius, and more.","img":""},{"venue":"Evening Muse","event":"My 3 Sons","date":"09 22 17","times":"\n  Doors: 10:00 pm / Show: 10:30 pm ","ticketfly":"1540843","tuneStub":"","href":"http://www.eveningmuse.com/event/1540843-my-3-sons-charlotte/","desc":"MY 3 SONS, from Raleigh, NC led by guitarist/composer Pete Petty, is an electric jazz/rock/funk power trio. On bass is Bobby Patterson (DAG, Go There). On drums is Kenny Soule (DAG, Go There, Nantucket, PKM, Mary McBride, Demolition String Band). Pete Petty notes “Being able to play with Bobby and Kenny and all the different elements that they bring to the table is a major inspiration.”\n\nMy 3 Sons puts tight rhythms, ambitious musicianship and undeniable energy to good use: making the case for the live music experience. \n\nFor fans of Jimi Hendrix, Joni Mitchell, Jaco Pastorius, Jeff Beck, John Coltrane.","img":""},{"venue":"Evening Muse","event":"THE NATIONAL PARKS","date":"10 14 17","times":"\n  Doors: 10:00 pm / Show: 10:30 pm ","ticketfly":"1536980","tuneStub":"","href":"http://www.eveningmuse.com/event/1536980-national-parks-charlotte/","desc":"The National Parks formed in Provo, Utah in early 2013.\n\nTo date, the band has released two full length albums (\"Young\" and \"Until I Live\") and one standalone single (\"As We Ran\" - written for the documentary film \"Love in the Tetons\")\n\nDespite operating as a true independent, the group's music has climbed to #13 on the iTunes singer/songwriter chart, top 50 on the iTunes’ Pop Chart, #5 on Billboard’s regional Heatseekers Chart, and has amassed over 10,000,000 Spotify streams. In April 2016, “Monsters of the North,” a lead single from their second album, was awarded 1st Prize in the International Songwriting Competition for all unsigned artists. The National Parks was named Utah’s “Band of the Year” in 2016 by Salt Lake City Weekly and press from national outlets such as NPR’s All Songs Considered, CMT Edge, and Pop Matters has fueled additional momentum. To date, The National Parks has played in over 50 cities including performances at SXSW, Snowmass Mammoth Fest, MusikFest, School Nights at Bardot’s and Canadian Music Week.","img":""},{"venue":"Evening Muse","event":"WAKER","date":"09 16 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1527984","tuneStub":"","href":"http://www.eveningmuse.com/event/1527984-waker-charlotte/","desc":"\"These guys can make music and elevate a scene.\"\n- Music City Roots\n\nWaker was founded by childhood friends  and songwriting duo Chase Bader (Vocals, Acoustic) and Conor Kelly (Electric guitar). The group hails from Nashville, mashing soul, rock & roll , & funk into an eclectic, danceable sound, focusing on songs that aim for the heart, head... and feet.\n\nOriginally known as Koa, Waker was christened in late summer 2016 following the addition of Dave Czuba (drums) & David Crutcher (keys) to the already talented lineup of Ryan Ladd (bass), Alex Mathews (sax), and Ryan McClanahan (percussion).\n\nWith a name that stems from the line, “Getting close to bedtime, time to wake,” in their song, “Fever,” The intention has always been clear, to “wake people” with their music. In a short amount of time, the band has already conquered festival stages at Bonnaroo, ACL, Hangout, SXSW, Firefly, and Wakarusa. They’ve toured with Blues Traveler, JJ Grey & Mofro, Moon Taxi, Galactic, the Wailers, recorded a session for Audiotree live, and headlined theater shows across the country.\n\nSince the release of their 2015 EP, the band has continued their nonstop regiment of touring & writing. Look for new music in 2017.\n\nWaker is an experience meant to be shared with others.","img":""},{"venue":"Evening Muse","event":"One Special Night with Patrick Davis - Two different shows!","date":"12 01 17","times":"\n  Doors: 9:00 pm / Show: 9:30 pm ","ticketfly":"1536027","tuneStub":"","href":"http://www.eveningmuse.com/event/1536027-one-special-night-patrick-charlotte/","desc":"PATRICK DAVIS & HIS MIDNIGHT CHOIR\n\nPatrick Davis is a southern singer, songwriter, storyteller & showman originally from Camden, South Carolina who has spent the last fourteen years making his musical mark in Nashville, TN.  Patrick learned the finer points of music & performance growing up in a household that not only included a talented guitar playing father, but also an extensive record collection always readily available for his absorption.  At the age of 16 Patrick joined his father Rusty on stage for his first ever performance and since that initial “gig” music has been the only job Patrick has ever held. \n\nAfter graduating from The University of South Carolina in 2000 Patrick moved to Nashville, TN where for almost 15 years he has continued to build his songwriting, artist and touring career.  Patrick has released four well received full length albums, toured the US & Europe as both a headliner & support act for Darius Rucker, Jewel & others while also being employed as a staff writer for Warner Chappell Music Publishing & having over 50 songs recorded by artist like Jimmy Buffet, Lady Antebellum, Imelda May, Darius Rucker, Jewel, Robert Randolph, Guy Clark and many more. \n\nPatrick’s “Patrick Davis & Midnight Choir” is an 11-piece band featuring horns & background singers created by PD in early 2016 from both his own artistic vision & the soundscapes of his songwriting & performing heroes Van Morrison, Lyle Lovett & Bruce Springsteen.  Davis borrowed the name “Midnight Choir” from a line in one of his favorite Leonard Cohen songs “Bird On a Wire” & since his eleven-piece outfit starting playing dates Davis & “His Midnight Choir” have witnessed growing congregations across the Southeast.\n\nTHIS IS A VERY SPECIAL ENGAGEMENT FEATURING TWO ENTIRELY DIFFERENT PATRICK DAVIS SHOWS:\n\n7:30pm Solo-Acoustic show ($22advanced/$25day-of-show)\n\n10:30pm Full Band - The Midnight Choir ($22advanced/$25day-of-show)\n\nSPECIAL TICKET FOR BOTH SHOWS IS ONLY $40","img":""},{"venue":"Evening Muse","event":"SARAH PEACOCK","date":"12 08 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1534208","tuneStub":"","href":"http://www.eveningmuse.com/event/1534208-sarah-peacock-charlotte/","desc":"Georgia grown singer songwriter, Sarah Peacock, swings the pendulum across the spectrum of what's considered to be today's country music; bridging gaps between modern country, alternative country, folk, americana, and even classic rock. You'll find a truthful rawness in her music and real life themes of faith, overcoming struggle, and un-acquitted love that will leave you oddly feeling closer to home. \n\nSarah is unstoppable. After 12 years on the road as an independent artist, watching her tour bus burn down before her eyes, signing a bad record deal right out of college and buying back the rights to her music, she knows a little bit about what it means to fall and get back up again. Peacock is a country-rock powerhouse, and she's got one of the most dynamic voices in the business. Her soft, sultry ballad, \"Hurricane\" won best song in the 2014 American Songwriting Awards, and her song, \"Beautiful\" was a winner in the 2014 International Unsigned Only Competition. In 2013, Peacock was named Listening Room Network's Artist of the Year. Sarah was nominated for Best Female Artist in the 2015 International Acoustic Music Awards for her song, \"Are We There Yet.” Her song, “The Cool Kids” was a nominee for best song in the 2015 American Songwriting Awards. Peacock has released 7 albums and her 8th is on the way. \n\nPeacock was recently signed to Nashville label, American Roots Records. Her first EP under the new label, Beauty In The Ashes, Unplugged Vol. 1 released May 12, 2017, and her second full band EP will release in September or October 2017.","img":""},{"venue":"Evening Muse","event":"Jams For Holly","date":"09 16 17","times":"\n  Doors: 1:30 pm / Show: 2:00 pm ","ticketfly":"1541009","tuneStub":"","href":"http://www.eveningmuse.com/event/1541009-jams-for-holly-charlotte/","desc":"Jams for Holly is a fundraising event featuring live music performances by local area high school talent. Over 25 high school students from 9 different high schools will come together on September 16th to raise funds and awareness for the Hands for Holly Fund. \n\nThis non-profit organization was started last summer in memory of 14-year-old Community House Middle School student Holly Wade who lost a seven month battle with brain cancer. Hands for Holly Fund has been able to donate  $150K so far for families caring for critically ill or injured children living within Mecklenburg County by offering financial aid for emergency expenses not covered by insurance. This fundraiser will give 100% of the profit to Hands for Holly Fund.\n\nThis talented group of local teens will use music to bring our community together. Each performer will present a unique musical style, crossing various genres of music including classic rock, indie, and many others.  Follow Jams for Holly on Instagram for individual bios posted daily in the coming weeks!","img":""},{"venue":"Evening Muse","event":"The Cactus Blossoms","date":"09 17 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1524252","tuneStub":"","href":"http://www.eveningmuse.com/event/1524252-cactus-blossoms-charlotte/","desc":"Our new album, You’re Dreaming, didn’t happen overnight. It is the culmination of several years of songwriting and the kindness of thousands of miles and friends. A cast of characters, experiences, and personal perspectives set in simple rhymes and sung in harmony to paint a picture in your mind.\n\nWhen my brother and I started making music as The Cactus Blossoms there wasn’t a big plan. We cut our teeth performing some well known and obscure country songs that were popular or unpopular pre-1960, partly out of curiosity and deep appreciation, but mostly because it was fun. Early on, we were offered a residency at the Turf Club in St. Paul, Minnesota, so we got a band together and it became our weekly “practice-in-public” where we would pull out every song we could think of, no matter how well we knew it. It was our first chance to play all night and do whatever we wanted. Over the course of our year and a half at the Turf Club our repertoire had snowballed into an amalgam of original songs and a bunch of gut wrenching, “tongue-in-cheek” heartbreakers, that were 30 years older than us. Not everyone could tell what was new and what was old, and it didn’t really matter. They just seemed to enjoy it. That’s how the wheel got going and gave the illusion of spin\nning backwards. We weren’t born in the wrong era. We just got into some music from a different era and happened to make it our own.\n\nEvery step of the way we’ve had the good fortune of being offered an opportunity that seems just beyond what we’re ready for. It always stretches us out and makes us feel lucky as hell. When JD McPherson called us up and said he was interested in producing our record it was the latest in a series of serendipitous events that have brought us to where we are today. We had opened for him at a hometown gig in Minneapolis a few months earlier and had met him briefly, but could never have imagined then that within a year we would be recording a new album with his help and criss-crossing America on tour with his band. He’s got the singing voice of an angel, a connoisseur’s taste, the boundless creative energy of a child, a scholar’s mind, and he can hear like a wolf. This guy was the guy. He wanted to do something sparse and rhythmic with simple melodic arrangements and it lined up perfectly with the direction our new songs were leading us.\n\nWe wanted to record live with the best rhythm section we could find, which led us to Chicago where JD enlisted the amazing talents of drummer/engineer Alex Hall, guitarist Joel Paterson, and Beau Sample on upright bass. Three musicians who practice their respective crafts to genius proportions and bring it all to the studio. At the start of our first recording session we barely knew these guys and they barely knew our music. Alex was setting up microphones and running cables while the rest of us were drinking coffee and cracking jokes to wake up. Within a couple hours we had cut the first song for the album, “Queen Of Them All”, and we knew we were in the right place at the right time.","img":""},{"venue":"Evening Muse","event":"Find Your Muse Open Mic with special guest Neil McLaren","date":"10 09 17","times":"\n  Doors: 7:00 pm / Show: 8:00 pm ","ticketfly":"1542862","tuneStub":"","href":"http://www.eveningmuse.com/event/1542862-find-your-muse-open-mic-charlotte/","desc":"Neil McLaren is a singer/songwriter from Dundee, Scotland. The Scottish troubadour has been making a name for himself north of the border since he started to write and perform in 2012. Following a path first trodden by the likes of Nick Drake in the ‘70s and, more recently, popular artists such as Ben Howard, Damien Rice and David Gray, Neil McLaren has been able to run with these influences and push them that little bit further by creating a sound that is very much his own.\nNeil McLaren’s journey to becoming a recording artist has been anything but ordinary. He is registered partially sighted and was the first person in Britain to receive pioneering eye surgery having been born completely blind. He also has an unorthodox playing style due to being self taught. Neil has no knowledge of guitar chords or of reading music, instead preferring to experiment with instruments in order to find a sound that fits the lyrics he has written. This hasn’t stopped him from succeeding as he is now able to creating music on both piano and guitar.\nSince the release of his debut self titled E.P Neil has toured the U.K and America with his lively and energetic performances that you don’t normally see from a solo artist. He is in the process of writing a new record and also setting overseas to return to America in September/October.","img":""},{"venue":"Evening Muse","event":"Find Your Muse Open Mic with special guest Neil McLaren","date":"10 09 17","times":"\n  Doors: 7:00 pm / Show: 8:00 pm ","ticketfly":"1542862","tuneStub":"","href":"http://www.eveningmuse.com/event/1542862-find-your-muse-open-mic-charlotte/","desc":"Neil McLaren is a singer/songwriter from Dundee, Scotland. The Scottish troubadour has been making a name for himself north of the border since he started to write and perform in 2012. Following a path first trodden by the likes of Nick Drake in the ‘70s and, more recently, popular artists such as Ben Howard, Damien Rice and David Gray, Neil McLaren has been able to run with these influences and push them that little bit further by creating a sound that is very much his own.\nNeil McLaren’s journey to becoming a recording artist has been anything but ordinary. He is registered partially sighted and was the first person in Britain to receive pioneering eye surgery having been born completely blind. He also has an unorthodox playing style due to being self taught. Neil has no knowledge of guitar chords or of reading music, instead preferring to experiment with instruments in order to find a sound that fits the lyrics he has written. This hasn’t stopped him from succeeding as he is now able to creating music on both piano and guitar.\nSince the release of his debut self titled E.P Neil has toured the U.K and America with his lively and energetic performances that you don’t normally see from a solo artist. He is in the process of writing a new record and also setting overseas to return to America in September/October.","img":""},{"venue":"Evening Muse","event":"Alash","date":"09 17 17","times":"\n  Doors: 4:30 pm / Show: 5:00 pm ","ticketfly":"1497825","tuneStub":"","href":"http://www.eveningmuse.com/event/1497825-alash-charlotte/","desc":"ALASH are masters of Tuvan throat singing (xöömei), a remarkable technique for singing multiple pitches at the same time. What distinguishes this gifted trio from earlier generations of Tuvan throat singers is the subtle infusion of modern influences into their traditional music. One can find complex harmonies, western instruments, and contemporary song forms in Alash’s music, but its overall sound and spirit is decidedly Tuvan.\n\n\nTrained in traditional Tuvan music since childhood, the Alash musicians studied at Kyzyl Arts College just as Tuva was beginning to open up to the West. They formed a traditional ensemble and won multiple awards for traditional throat singing in international xöömei competitions, both as an ensemble and as individuals. At the same time, they paid close attention to new trends coming out of the West. They have borrowed new ideas that mesh well with the sound and feel of traditional Tuvan music, but they have never sacrificed the integrity of their own heritage in an effort to make their music more hip.\n\n\nAlash first toured the U.S. under the sponsorship of the Open World Leadership program of the Library of Congress and the National Endowment for the Arts. Since then they have returned many times, to the delight of American audiences. The Washington Post described their music as “utterly stunning,” quipping that after the performance “audience members picked their jaws up off the floor.”\n\n\nAlash enjoys collaborating with musicians of all stripes. They appear as guest artists on Béla Fleck & the Flecktones’ holiday CD Jingle All the Way (2008), which won a Grammy. The Denver Post remarked, “As electrifying as the Flecktones’ performance was, the band were nearly upstaged by Alash Ensemble.” Alash also enjoys a longstanding musical partnership with the legendary Sun Ra Arkestra, and they have collaborated with musicians across the spectrum, from country to classical to beatboxing.\n\n\nBeyond performing, Alash has a passion for teaching and promoting understanding between cultures. Their tours often include workshops where they introduce Tuvan music to students from primary, middle and high schools, colleges, universities, and music conservatories. Children as young as 8 and 9 have learned to throat-sing. As one student exclaimed, “Alash opened my eyes to a whole new world!”\n\n\nAlash has released four CDs of its own: Alash Live at the Enchanted Garden (2006), Alash (2007), Buura (2011), and Achai (2015). The members of Alash are:\n\n\nBady-Dorzhu Ondar: vocals, igil, guitar. Kyzyl Arts College, East Siberia State Academy of Culture and Art. Best soloist, 2005 All-Russian Festival of traditional ensembles and orchestras. Best in Maxim Dakpai xöömei competition, 2006. Named People’s Xöömeizhi, 2007. Grand prize, International Xöömei Symposium, 2008.\n\n\nAyan-ool Sam: vocals, doshpuluur, igil, guitar. Republic School of the Arts, Kyzyl Arts College, Moscow State Pedagogical University. First prize, International Xöömei Symposium, 2008. Named People’s Xöömeizhi, 2015.\n\n\nAyan Shirizhik: vocals, kengirge, shyngyrash, shoor, murgu, xomus. Kyzyl Arts College, East Siberia State Academy of Culture and Art. Second prize, International Xöömei Symposium, 2008. Named Distinguished Artist of Tuva, 2009.\n\n\nSean Quirk: interpreter and manager. Studied music in Tuva on a Fulbright fellowship. Named Distinguished Artist of Tuva, 2008.","img":""},{"venue":"Evening Muse","event":"The Tosco Music Open Mic - A GREAT way to welcome autumn!","date":"10 04 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1542777","tuneStub":"","href":"http://www.eveningmuse.com/event/1542777-tosco-music-open-mic-great-charlotte/","desc":"Open Mic format for the Tosco Music Open Mic is we gather for a sing-a-long session from 7:30 to 8 pm or so, then we start going down the list of performers.  Everyone gets one song, so be in tune and ready to play when your name is called.  It is first come, first play on the sign up sheet, however we give priority to school aged performers.  \n\nTosco Music’s mission is to…\npresent a wide variety of music through performances and outreach programs;\nfoster a sense of community among listeners and performers through inclusive participation; and\nconnect professional and amateur musicians to share and inspire one another.","img":""},{"venue":"Evening Muse","event":"HOLLY BOWLING","date":"10 11 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1539108","tuneStub":"","href":"http://www.eveningmuse.com/event/1539108-holly-bowling-charlotte/","desc":"Texture, nuance, and a gift for dexterous high-wire improvisation are the hallmarks of San Francisco-based classically trained pianist Holly Bowling, who is infuses jam band music with a technically advanced, emotionally rich style.  After studying piano performance at SF State University, Bowling has turned her agile mind and interpretive prowess to the works of Phish on 2013’s Distillation Of A Dream album and the newly released Grateful Dead focused Better Left Unsung (released December 9, 2016 through The Royal Potato Family).  Her instantly compelling playing and unerring ability to successfully collaborate with other musicians in an impressive array of styles has brought her to the attention of Bob Weir, Phil Lesh, Gov’t Mule’s Warren Haynes, and other luminaries who’ve asked Bowling to perform with them.  Already a rising star on the festival circuit, Bowling plans to expand her solo touring in 2017 and beyond.","img":""},{"venue":"Evening Muse","event":"Little StrangerSondorBlue","date":"09 30 17","times":"\n  Doors: 10:00 pm / Show: 10:30 pm ","ticketfly":"1542713","tuneStub":"","href":"http://www.eveningmuse.com/event/1542713-little-stranger-sondorblue-charlotte/","desc":"The members of Charleston, South Carolina’s SondorBlue have the markers of the so-called ‘New Bohemian’ movement – with focus on a healthy lifestyle, brotherly love, and individuality.  From TIME Magazine in the US to THE GUARDIAN in the UK, people are talking about the return to this free-thinking way of life.  While SondorBlue is a rock band writing tight pop songs, they share the relentless touring schedule, the fan culture and the raw musicianship of artists on the ever-expanding jam band scene.\n\nThe band is comprised of three exceptionally talented vocalists who could each easily front their own bands – Connor Hollifield on lead guitar, John Sheehan on guitar and keyboards and Andrew Halley at center stage on bass – with drummer, Drew Lewis holding down a clockwork backbeat.  They come together to create harmonies unlike any you have ever heard. Connor explained of the arrangement “We had all had our own songwriting side projects when we were younger, but when we came together to play music — that's when we were the happiest.”  Sheehan added “I wanted to share this experience with my best friends.  I knew we could go a lot further together than any of us could alone.”\n\nIf longevity for bands is determined by their ability to pull off their recorded material in a live setting, then SondorBlue is set up for a long, fruitful career.  They have been aggressively touring all along the East Coast and make pulling off their complex harmonies and playing their intricate arrangements look easy. The band loves to play live. “It is one of my favorite things,” says Lewis.  “It has been great to watch the songs develop as we take them out of the studio and onto the stage.”\n\n“We’ve been lucky to connect with some great people on the road and they have been enormously supportive,” explains Halley.  \"We’ve been able to replicate some of our experience through social media, and it has been rewarding to engage and keep in touch with everyone we've met along the way.”  It shows - the band’s single, “OPINIONS,” has over 125k streams on Spotify and a track off their 2016 REALOMETER EP release, “The Moon And You,” has over 110k streams.  BuzzArtists called their musical combination “swirling, harmony-driven indie rock,” though you might want to add a touch of ‘pop’ to the band’s ever-evolving recipe.  With YOU WILL FIND LOVE ON ASHLEY AVENUE, the band’s brand new EP, they bring context to their recent hit, “OPINIONS,” by wearing their Beatles influence on their proverbial sleeve.  Gorgeous melodies, harmonies and expert instrumentation are the hallmarks of the other tracks “Escape!,” “A Beautiful Dream,” “I hate living like this” and the single “Ashley Ave.”  \n\nSondorBlue are poised for big things in the future.  Look for them at a venue near you.","img":""},{"venue":"Evening Muse","event":"Little StrangerSondorBlue","date":"09 30 17","times":"\n  Doors: 10:00 pm / Show: 10:30 pm ","ticketfly":"1542713","tuneStub":"","href":"http://www.eveningmuse.com/event/1542713-little-stranger-sondorblue-charlotte/","desc":"The members of Charleston, South Carolina’s SondorBlue have the markers of the so-called ‘New Bohemian’ movement – with focus on a healthy lifestyle, brotherly love, and individuality.  From TIME Magazine in the US to THE GUARDIAN in the UK, people are talking about the return to this free-thinking way of life.  While SondorBlue is a rock band writing tight pop songs, they share the relentless touring schedule, the fan culture and the raw musicianship of artists on the ever-expanding jam band scene.\n\nThe band is comprised of three exceptionally talented vocalists who could each easily front their own bands – Connor Hollifield on lead guitar, John Sheehan on guitar and keyboards and Andrew Halley at center stage on bass – with drummer, Drew Lewis holding down a clockwork backbeat.  They come together to create harmonies unlike any you have ever heard. Connor explained of the arrangement “We had all had our own songwriting side projects when we were younger, but when we came together to play music — that's when we were the happiest.”  Sheehan added “I wanted to share this experience with my best friends.  I knew we could go a lot further together than any of us could alone.”\n\nIf longevity for bands is determined by their ability to pull off their recorded material in a live setting, then SondorBlue is set up for a long, fruitful career.  They have been aggressively touring all along the East Coast and make pulling off their complex harmonies and playing their intricate arrangements look easy. The band loves to play live. “It is one of my favorite things,” says Lewis.  “It has been great to watch the songs develop as we take them out of the studio and onto the stage.”\n\n“We’ve been lucky to connect with some great people on the road and they have been enormously supportive,” explains Halley.  \"We’ve been able to replicate some of our experience through social media, and it has been rewarding to engage and keep in touch with everyone we've met along the way.”  It shows - the band’s single, “OPINIONS,” has over 125k streams on Spotify and a track off their 2016 REALOMETER EP release, “The Moon And You,” has over 110k streams.  BuzzArtists called their musical combination “swirling, harmony-driven indie rock,” though you might want to add a touch of ‘pop’ to the band’s ever-evolving recipe.  With YOU WILL FIND LOVE ON ASHLEY AVENUE, the band’s brand new EP, they bring context to their recent hit, “OPINIONS,” by wearing their Beatles influence on their proverbial sleeve.  Gorgeous melodies, harmonies and expert instrumentation are the hallmarks of the other tracks “Escape!,” “A Beautiful Dream,” “I hate living like this” and the single “Ashley Ave.”  \n\nSondorBlue are poised for big things in the future.  Look for them at a venue near you.","img":""},{"venue":"Evening Muse","event":"PARSONSFIELD","date":"09 16 17","times":"\n  Doors: 10:00 pm / Show: 10:30 pm ","ticketfly":"1546826","tuneStub":"","href":"http://www.eveningmuse.com/event/1546826-parsonsfield-charlotte/","desc":"May 6, 2015: Day One in the abandoned axe factory hadn't gone as planned, so today is the first time the five members of Parsonsfield will actually get to make music here. They'd been looking forward to converting this cavernous industrial space on the banks of the Farmington River in Collinsville, CT, ever since singer/banjo player Chris Freeman, who grew up nearby, brought it to their attention. The idea of recording in such a reverberant, reactive space held great appeal after the past six months spent in Canada exclusively performing their critically acclaimed original songs for 'The Heart Of Robin Hood,' a musical that required them to wear in-ear monitors for eight shows a week in theaters designed to be sonically dead.\n\nThey've got their amps and PA plugged in now, and there's a faint layer of sawdust on top of all the gear. It's nothing compared to yesterday, when they opened the doors for the first time and discovered sawdust an inch thick coating every imaginable surface. It was so bad they had to purchase respirators and devote the entire day to sweeping and vacuuming, trying to outwit the neighbor's overzealous guard dog every time they came and went from the building. The whole process left so much dust still floating in the air that every time they take a break, another layer settles back down to earth, but at least they can comfortably breathe now.\n\nAbove them, a cyclist crosses the rickety bridge over the river, making a distinctive clatter as the wheels hit a particularly loose plank. It's time to begin 'Blooming Through The Black.'\n\nThough they call western Massachusetts home, Parsonsfield draws their name from the rural Maine town that's home to the Great North Sound Society, the farmhouse-turned- recording-studio of Josh Ritter keyboardist/producer Sam Kassirer. It was there that they cut their outstanding debut, 'Poor Old Shine,' which established them as a roots force to be reckoned with. Folk Alley dubbed their songs \"the most jubilant and danceable indie roots music this side of the Carolinas.\" Their rowdy live performances only upped the ante, with The Bluegrass Situation falling for their \"fun and frenzy\" and No Depression raving that they'll \"give you rich five-part harmonies one minute, sound like bluegrass on steroids the next, and then rock you over the head with unbearably cool and raucous Celtic rhythms.\"\n\nIt was only natural, then, that they called on Kassirer once again for their follow-up, 'Blooming Through The Black,' enlisting his engineering and production ingenuity to help convert the axe factory into a temporary recording studio. In addition to placing microphones on each instrument, Kassirer set up additional mics throughout the factory just to capture the feel of the enormous space, which itself became another instrument in the band's already-impressive repertoire.\n\nParsonsfield spent nearly six months writing and rehearsing in the factory, discovering that song ideas that had begun life in Canada radically transformed in their new home. The space demanded understatement and subtlety to balance out the band's exuberance and energy, and by the time they were ready to hit record, they were sitting on a collection chock full of the most infectious, emotionally mature songs of their career.\n\n'Blooming Through The Black' opens with 'Stronger,' a slow-burner that begins as an acoustic folk number and builds to an electrified tumult. It's a showcase for their instrumental prowess, lyrical chops, and unbridled passion, and it's just the start. The title track—inspired by the sight of the first flowers growing back in the forest fire- charred landscape of Hell Canyon, South Dakota—finds Freeman blending punk energy with earnest sincerity in his delivery, while \"Across Your Mind\" rides a feel-good groove driven by bassist Harrison Goodale and drummer Erik Hischman, and \"Water Through A Mill\" ebbs and flows like a solemn hymn on top of Max Shakun's meditative pump organ.\nAs the band explored the quirks and eccentricities of the factory, unexpected sounds and moments sometimes became permanent fixtures of the songs, but a particularly happy accident occurred outside the studio entirely, when Shakun called mandolin player Antonio Alcorn for help setting up his new record player. Upon dropping the needle somewhere in the middle of a copy of 'Poor Old Shine,' they discovered it was spinning backwards, but the melody coming out of the speakers was perhaps even more of an infectious earworm than it was when played forward. They brought the new riff to the rest of the band, where it morphed into \"The Ties That Bind Us,\" a stand-out foot-stomper and a highlight of their live show.\n\nCatch Parsonsfield onstage any night and the band's joy is palpable. They trade instruments, share microphones, and shoot each other big grins. They sing in tight multi-part harmonies, their voices blending like they've been doing this together all their lives. That's because Parsonsfield is a family band, not by birth but by choice. And with an album this thrilling, it's only a matter of time before you share their same enthusiasm.\n\nListen closely at the top of \"Don't Get Excited\" and you'll hear the clatter of a cyclist crossing the rickety bridge over the river. That's the sound of Parsonsfield inviting you into the axe factory. It's time to begin 'Blooming Through The Black.' Good luck not getting excited.","img":""},{"venue":"Evening Muse","event":"Sun SeekerThe Speedbumps","date":"10 13 17","times":"\n  Doors: 10:00 pm / Show: 10:30 pm ","ticketfly":"1536079","tuneStub":"","href":"http://www.eveningmuse.com/event/1536079-sun-seeker-speedbumps-charlotte/","desc":"The Speedbumps are an award-winning American band with a warm, authentic sound, built on a passion for hollow-bodied instruments, indie-folk influences, and singer-songwriter Erik Urycki’s breathy, commanding vocals and canny phrasing.\n\nThe band’s roots lie deep in the Rustbelt, where quiet strength and limited embellishment define the culture. The working class towns around Akron, the former rubber capital, from which artists like The Black Keys, Jessica Lea Mayfield, and Joseph Arthur have emerged, have provided the band with an aesthetic that seeks to tease out beauty from the gritty details of everyday life.\n\nThe band consists of Erik Urycki on vocals and guitar, Abby Luri on vocals, guitar, banjo and keys, Sam Kristoff playing cello -- often where you’d expect a guitar riff, Kevin Martinez on acoustic and electric bass, and two members on drums and percussion, Pat Hawkins and Danny Jenkins. In addition to her ethereal vocals, Luri is also a songwriter and has co-written several of the band’s tunes.\n\nThe Speedbumps have won IMA and AMA awards and performed with artists including Andrew Bird, G-Love and OKGO. Daryl Rowland, writing for the Huffington Post, said that singer Erik Urycki’s lyrics “often tackle complex human emotions with elegant economy.”\n\nWhile the band cites influences from Paul Simon to Nick Drake to Radiohead, their material and vibe have more in common with festival favorites like The Decemberists, Wilco, Ryan Adams or Mumford & Sons, with their consistently smart, spare and rootsy approach.\n\nTheir latest album, “Soil to the Seed,” was recorded in a remote cabin in the woods of Pennsylvania, where the band lived together, writing songs and laying down tracks at all hours. The resulting recording reflects that total emersion. As with seminal house-based recordings like The Band’s “Music from Big Pink,” the songs have an effortless unity.  \n\nThe Speedbumps’ unique live shows include instruments like Cello, Banjo, Ukulele, Wurlitzer, Glockenspiel, Vibraslap and Mandolin. On several occasions, the band has performed with a 40 piece symphony orchestra, featuring arrangements written by bass player, Kevin Martinez, who holds a degree in Music Theory and Composition.\n\nThe Speedbumps winning combination of thought-provoking singer-songwriter material and high-caliber musicianship have earned the band a large and loyal fan base in the Northeast and Midwest. With the May 5th release of the their new album, the band will be touring United States and abroad, sharing their new songs and soaking up the world to feed the next batch of tunes.","img":""},{"venue":"Evening Muse","event":"Sun SeekerThe Speedbumps","date":"10 13 17","times":"\n  Doors: 10:00 pm / Show: 10:30 pm ","ticketfly":"1536079","tuneStub":"","href":"http://www.eveningmuse.com/event/1536079-sun-seeker-speedbumps-charlotte/","desc":"The Speedbumps are an award-winning American band with a warm, authentic sound, built on a passion for hollow-bodied instruments, indie-folk influences, and singer-songwriter Erik Urycki’s breathy, commanding vocals and canny phrasing.\n\nThe band’s roots lie deep in the Rustbelt, where quiet strength and limited embellishment define the culture. The working class towns around Akron, the former rubber capital, from which artists like The Black Keys, Jessica Lea Mayfield, and Joseph Arthur have emerged, have provided the band with an aesthetic that seeks to tease out beauty from the gritty details of everyday life.\n\nThe band consists of Erik Urycki on vocals and guitar, Abby Luri on vocals, guitar, banjo and keys, Sam Kristoff playing cello -- often where you’d expect a guitar riff, Kevin Martinez on acoustic and electric bass, and two members on drums and percussion, Pat Hawkins and Danny Jenkins. In addition to her ethereal vocals, Luri is also a songwriter and has co-written several of the band’s tunes.\n\nThe Speedbumps have won IMA and AMA awards and performed with artists including Andrew Bird, G-Love and OKGO. Daryl Rowland, writing for the Huffington Post, said that singer Erik Urycki’s lyrics “often tackle complex human emotions with elegant economy.”\n\nWhile the band cites influences from Paul Simon to Nick Drake to Radiohead, their material and vibe have more in common with festival favorites like The Decemberists, Wilco, Ryan Adams or Mumford & Sons, with their consistently smart, spare and rootsy approach.\n\nTheir latest album, “Soil to the Seed,” was recorded in a remote cabin in the woods of Pennsylvania, where the band lived together, writing songs and laying down tracks at all hours. The resulting recording reflects that total emersion. As with seminal house-based recordings like The Band’s “Music from Big Pink,” the songs have an effortless unity.  \n\nThe Speedbumps’ unique live shows include instruments like Cello, Banjo, Ukulele, Wurlitzer, Glockenspiel, Vibraslap and Mandolin. On several occasions, the band has performed with a 40 piece symphony orchestra, featuring arrangements written by bass player, Kevin Martinez, who holds a degree in Music Theory and Composition.\n\nThe Speedbumps winning combination of thought-provoking singer-songwriter material and high-caliber musicianship have earned the band a large and loyal fan base in the Northeast and Midwest. With the May 5th release of the their new album, the band will be touring United States and abroad, sharing their new songs and soaking up the world to feed the next batch of tunes.","img":""},{"venue":"Evening Muse","event":"The \"All Strung Up\" Tour...Daniel Champagne, Hussy Hicks, Christie Lenee","date":"10 19 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1542912","tuneStub":"","href":"http://www.eveningmuse.com/event/1542912-all-strung-up-tour-daniel-charlotte/","desc":"Christie Lenée’s unique guitar work is often compared to visionaries like Michael Hedges, Joni Mitchell and Dave Matthews, delivering profound instrumental compositions with heartfelt, consciously uplifting songs. Christie Lenée’s pieces have been showcased at the NAMM Show in Anaheim and Nashville, live on National Television and Radio, on stage with artists such as Tim Reynolds (guitarist for Dave Matthews Band), Andy McKee, Amy Ray from the Indigo Girls, and Stanley Jordan to name a few. Her album “Live at the Hideaway Cafe” was one of three finalists for “Best Album of 2014” (Indie Acoustic Project Awards), including the song “Love Who You Are” nominated for a 2016 Posi Award in the category “Songs for Personal Transformation.”\nThe new album “STAY” is a collection of hopeful, inspiring songs featuring special guest Tim Reynolds (Guitarist from Dave Matthews Band) on the title track “Stay,” “Sun Shines Through” and “Journey of My Own”. The album also contains 3 instrumental pieces produced by the legendary and Multi-Grammy Award Winning Producer Will Ackerman (founder of Windham Hill Records). These glorious instrumental pieces vary, from “Soaring Over Glacier Bay” with 27 cellos and a symphonic essence, to “Sunset Rebirth” with a bamboo flute, and the simplicity of “Sweet Little Piece” on the 12 string Veillette Gryphon Guitar.\nThe title track “Stay” shines a bright light on suicide awareness and prevention. Christie’s message is that every person is special and has something unique to contribute to this world. In her own words: “I intend to translate to the listener that it’s okay to go through rough times. In those moments when you feel like running… whether from a job, a relationship, or running from life itself… Take a breath. Stay, and know that there is another way. You’re the only one who can be you.”\nThe new album “Stay” was released on October 1st and will be followed by expansive touring in the US, Australia, Asia, Canada and Europe in 2017.","img":""},{"venue":"Evening Muse","event":"The \"All Strung Up\" Tour...Daniel Champagne, Hussy Hicks, Christie Lenee","date":"10 19 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1542912","tuneStub":"","href":"http://www.eveningmuse.com/event/1542912-all-strung-up-tour-daniel-charlotte/","desc":"Christie Lenée’s unique guitar work is often compared to visionaries like Michael Hedges, Joni Mitchell and Dave Matthews, delivering profound instrumental compositions with heartfelt, consciously uplifting songs. Christie Lenée’s pieces have been showcased at the NAMM Show in Anaheim and Nashville, live on National Television and Radio, on stage with artists such as Tim Reynolds (guitarist for Dave Matthews Band), Andy McKee, Amy Ray from the Indigo Girls, and Stanley Jordan to name a few. Her album “Live at the Hideaway Cafe” was one of three finalists for “Best Album of 2014” (Indie Acoustic Project Awards), including the song “Love Who You Are” nominated for a 2016 Posi Award in the category “Songs for Personal Transformation.”\nThe new album “STAY” is a collection of hopeful, inspiring songs featuring special guest Tim Reynolds (Guitarist from Dave Matthews Band) on the title track “Stay,” “Sun Shines Through” and “Journey of My Own”. The album also contains 3 instrumental pieces produced by the legendary and Multi-Grammy Award Winning Producer Will Ackerman (founder of Windham Hill Records). These glorious instrumental pieces vary, from “Soaring Over Glacier Bay” with 27 cellos and a symphonic essence, to “Sunset Rebirth” with a bamboo flute, and the simplicity of “Sweet Little Piece” on the 12 string Veillette Gryphon Guitar.\nThe title track “Stay” shines a bright light on suicide awareness and prevention. Christie’s message is that every person is special and has something unique to contribute to this world. In her own words: “I intend to translate to the listener that it’s okay to go through rough times. In those moments when you feel like running… whether from a job, a relationship, or running from life itself… Take a breath. Stay, and know that there is another way. You’re the only one who can be you.”\nThe new album “Stay” was released on October 1st and will be followed by expansive touring in the US, Australia, Asia, Canada and Europe in 2017.","img":""},{"venue":"Evening Muse","event":"The \"All Strung Up\" Tour...Daniel Champagne, Hussy Hicks, Christie Lenee","date":"10 19 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1542912","tuneStub":"","href":"http://www.eveningmuse.com/event/1542912-all-strung-up-tour-daniel-charlotte/","desc":"Christie Lenée’s unique guitar work is often compared to visionaries like Michael Hedges, Joni Mitchell and Dave Matthews, delivering profound instrumental compositions with heartfelt, consciously uplifting songs. Christie Lenée’s pieces have been showcased at the NAMM Show in Anaheim and Nashville, live on National Television and Radio, on stage with artists such as Tim Reynolds (guitarist for Dave Matthews Band), Andy McKee, Amy Ray from the Indigo Girls, and Stanley Jordan to name a few. Her album “Live at the Hideaway Cafe” was one of three finalists for “Best Album of 2014” (Indie Acoustic Project Awards), including the song “Love Who You Are” nominated for a 2016 Posi Award in the category “Songs for Personal Transformation.”\nThe new album “STAY” is a collection of hopeful, inspiring songs featuring special guest Tim Reynolds (Guitarist from Dave Matthews Band) on the title track “Stay,” “Sun Shines Through” and “Journey of My Own”. The album also contains 3 instrumental pieces produced by the legendary and Multi-Grammy Award Winning Producer Will Ackerman (founder of Windham Hill Records). These glorious instrumental pieces vary, from “Soaring Over Glacier Bay” with 27 cellos and a symphonic essence, to “Sunset Rebirth” with a bamboo flute, and the simplicity of “Sweet Little Piece” on the 12 string Veillette Gryphon Guitar.\nThe title track “Stay” shines a bright light on suicide awareness and prevention. Christie’s message is that every person is special and has something unique to contribute to this world. In her own words: “I intend to translate to the listener that it’s okay to go through rough times. In those moments when you feel like running… whether from a job, a relationship, or running from life itself… Take a breath. Stay, and know that there is another way. You’re the only one who can be you.”\nThe new album “Stay” was released on October 1st and will be followed by expansive touring in the US, Australia, Asia, Canada and Europe in 2017.","img":""},{"venue":"Evening Muse","event":"Roots Of A RebellionJahlistic","date":"10 28 17","times":"\n  Doors: 10:00 pm / Show: 10:30 pm ","ticketfly":"1539504","tuneStub":"","href":"http://www.eveningmuse.com/event/1539504-roots-rebellion-jahlistic-charlotte/","desc":"Jahlistic is a 4-piece Latin, Reggae Roots band based from Charlotte, North Carolina. Their sound is easy identified by the heavy Drum and Bass driven structures, Smooth Soulful Voices, and a strong Reggae Roots Rhythm Section. Their sound is also highly influenced by their Latin Roots as three of the members are from South America.\n\nThe concept of “Jahlistic” was born in 2007 when brothers Ezequiel Aloise and Joel Aloise put a band together to perform in a talent show. During this time, the brothers were still discovering their musical identity and their mission with music.\n\nLead singer, Tania Aloise came along in 2011 when she married Joel Aloise. The band took form, and they started performing in local events from time to time.\n\nMany musicians passed through the band, but it was not until 2013 when Josh Livingston (Guitarist) joined the band, and Jahlistic was officially formed. Since then, Jahlistic has been creating original music and performing regularly in the Carolinas as well as other states.\n\nJahlistic released their Debut, EP Album “Higher Places” on July of 2015.\n\nSince then, they have been performing in well-known regional reggae festivals and have shared the stage with leading East-coast reggae acts. In 2014, they performed in the renowned Woodbury Reggae Festival in Woodbury, Connecticut, which is the oldest annual Reggae festival in the United States and shared the stage with international reggae acts. In 2016 Jahlistic was the opening act and only band to share the stage for one of the most famous band in South America, GONDWANA. In the present, Jahlistic is planning a regional tour for 2017 and creating new music for what will be their full-length Debut Album in the same year.\n\nTheir EP Album “Higher Place Ep” is currently available on Itunes, Spotify, Amazon, Google Music, and many other online streaming services.","img":""},{"venue":"Evening Muse","event":"Roots Of A RebellionJahlistic","date":"10 28 17","times":"\n  Doors: 10:00 pm / Show: 10:30 pm ","ticketfly":"1539504","tuneStub":"","href":"http://www.eveningmuse.com/event/1539504-roots-rebellion-jahlistic-charlotte/","desc":"Jahlistic is a 4-piece Latin, Reggae Roots band based from Charlotte, North Carolina. Their sound is easy identified by the heavy Drum and Bass driven structures, Smooth Soulful Voices, and a strong Reggae Roots Rhythm Section. Their sound is also highly influenced by their Latin Roots as three of the members are from South America.\n\nThe concept of “Jahlistic” was born in 2007 when brothers Ezequiel Aloise and Joel Aloise put a band together to perform in a talent show. During this time, the brothers were still discovering their musical identity and their mission with music.\n\nLead singer, Tania Aloise came along in 2011 when she married Joel Aloise. The band took form, and they started performing in local events from time to time.\n\nMany musicians passed through the band, but it was not until 2013 when Josh Livingston (Guitarist) joined the band, and Jahlistic was officially formed. Since then, Jahlistic has been creating original music and performing regularly in the Carolinas as well as other states.\n\nJahlistic released their Debut, EP Album “Higher Places” on July of 2015.\n\nSince then, they have been performing in well-known regional reggae festivals and have shared the stage with leading East-coast reggae acts. In 2014, they performed in the renowned Woodbury Reggae Festival in Woodbury, Connecticut, which is the oldest annual Reggae festival in the United States and shared the stage with international reggae acts. In 2016 Jahlistic was the opening act and only band to share the stage for one of the most famous band in South America, GONDWANA. In the present, Jahlistic is planning a regional tour for 2017 and creating new music for what will be their full-length Debut Album in the same year.\n\nTheir EP Album “Higher Place Ep” is currently available on Itunes, Spotify, Amazon, Google Music, and many other online streaming services.","img":""},{"venue":"Evening Muse","event":"PATRICK SWEANY","date":"11 11 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1531497","tuneStub":"","href":"http://www.eveningmuse.com/event/1531497-patrick-sweany-charlotte/","desc":"Patrick Sweany likes the spaces in between.\n\nOn a given night (or on a given album) he'll swing through blues, folk, soul, bluegrass, maybe some classic 50s rock, or a punk speedball. He's a musical omnivore, devouring every popular music sound of the last 70 years, and mixing 'em all together seamlessly into his own stew. Yet, the one thing that most people notice about Patrick isn't his ability to copy - it's his authenticity. Like his heroes, artists like Bobby \"Blue\" Bland, Doug Sahm, Joe Tex, Patrick somehow manages to blend all of these influences into something all his own. \n\nIt's no wonder that as a kid he immersed himself in his dad's extensive record collection: 60s folk, vintage country, soul, and, of course, blues. Patrick spent hours teaching himself to fingerpick along to Leadbelly, Lightnin' Hopkins, and other folk-blues giants. \n\nIn his late teens, Patrick began playing the clubs and coffeehouses around Kent, OH. He quickly gained a reputation for the intricate country blues style he was developing: part Piedmont picking, part Delta slide - with an equally impressive deep, smooth vocal style. \n\nBut Patrick wouldn't stay in the acoustic world for long. His love of 50s era soul and rock fused with the adrenaline-soaked garage punk revival happening throughout the Rust Belt pushed him to form a band. \n\nAfter 6 critically acclaimed records (two produced by longtime collaborator Dan Auerbach of The Black Keys), Patrick has expanded his touring radius to 49 states and Europe. He's played premiere festivals (Newport Folk Fest, Merlefest, Montreal Jazz Fest, Telluride Blues & Brews) and supported international acts such as The Black Keys, The Tedeschi Trucks Band, The Wood Brothers, Hot Tuna, and others on tour. \n\nHis latest record, Daytime Turned To Nighttime, comes out in September 2015. It was recorded in his adopted community of E. Nasheville, TN and features contributions from long-time collaborator and producer Joe McMahan (Allsion Moorer, Webb Wilder), Ron Eoff (Cate Brothers, Levon Helm), Bryan Owings (Tony Joe White, Solomon Burke), among others. For Daytime Sweany took a fairly different approach than his usual raw, intense blues sound, opting for more subtle textures and playing. Seminal 70s records by Bill Withers, Bobbie Gentry and Bobby Charles & The Band provide the sonic blueprint, while Sweany wraps his trademark baritone and impeccable acoustic slide work around songs of longing, redemption and growing up.","img":""},{"venue":"Evening Muse","event":"Find Your Muse Open Mic welcomes back Philly's own Orion Freeman","date":"10 30 17","times":"\n  Doors: 7:00 pm / Show: 8:00 pm ","ticketfly":"1546565","tuneStub":"","href":"http://www.eveningmuse.com/event/1546565-find-your-muse-open-mic-charlotte/","desc":"\"Orion Freeman is a singing, songwriting, guitar-playing seeker from the woods just beyond the mortar and bricks of Philadelphia. His souled-out, reggae-infused, flamenco-tinged, bluesy folk-rock aspires to move: your shoes; your heart; the cobwebs, so as to peer into your soul. Hovering somewhere within the chasm between the worldly and the divine, his music is an intimate glimpse into the spiraling states of freedom and folly, playfulness and prayer.\n\n\"I saw Orion sing, one night on my radio show and I still haven't recovered. He has the music, the charm and a mystique about him, that touches my heart and soul… I believe he's the next big thing to come out of the Philly scene.\"\n\n--Gene Shay - \"The Dean of American Folk DJs\"\nFounder, Philadelphia Folk Fest\nDJ, WXPN & Folk Alley","img":""},{"venue":"Evening Muse","event":"Find Your Muse Open Mic welcomes back Philly's own Orion Freeman","date":"10 30 17","times":"\n  Doors: 7:00 pm / Show: 8:00 pm ","ticketfly":"1546565","tuneStub":"","href":"http://www.eveningmuse.com/event/1546565-find-your-muse-open-mic-charlotte/","desc":"\"Orion Freeman is a singing, songwriting, guitar-playing seeker from the woods just beyond the mortar and bricks of Philadelphia. His souled-out, reggae-infused, flamenco-tinged, bluesy folk-rock aspires to move: your shoes; your heart; the cobwebs, so as to peer into your soul. Hovering somewhere within the chasm between the worldly and the divine, his music is an intimate glimpse into the spiraling states of freedom and folly, playfulness and prayer.\n\n\"I saw Orion sing, one night on my radio show and I still haven't recovered. He has the music, the charm and a mystique about him, that touches my heart and soul… I believe he's the next big thing to come out of the Philly scene.\"\n\n--Gene Shay - \"The Dean of American Folk DJs\"\nFounder, Philadelphia Folk Fest\nDJ, WXPN & Folk Alley","img":""},{"venue":"Evening Muse","event":"Find Your Muse Open Mic welcomes back The Singing Butcher","date":"10 23 17","times":"\n  Doors: 7:00 pm / Show: 8:00 pm ","ticketfly":"1546551","tuneStub":"","href":"http://www.eveningmuse.com/event/1546551-find-your-muse-open-mic-charlotte/","desc":"The Singing Butcher is an identity that songwriter Timothy George holds dearest to his heart. Born during a tornado in Omaha, Nebraska and raised in a small town on the banks of the Wabash River in Indiana, George has hustled his way to Nashville, Tn. When he is not fighting his way through rough mornings in a cutting room at the butcher shop, he can be found on stage sharing his music on local and national stages. George's sound ranges from the most delicate and introspective acoustic song to an extended jam layered with perfectly overdriven twang. His songs are well-crafted and possess a brutal honesty that is hard to come by in the industry.","img":""},{"venue":"Evening Muse","event":"Find Your Muse Open Mic welcomes back The Singing Butcher","date":"10 23 17","times":"\n  Doors: 7:00 pm / Show: 8:00 pm ","ticketfly":"1546551","tuneStub":"","href":"http://www.eveningmuse.com/event/1546551-find-your-muse-open-mic-charlotte/","desc":"The Singing Butcher is an identity that songwriter Timothy George holds dearest to his heart. Born during a tornado in Omaha, Nebraska and raised in a small town on the banks of the Wabash River in Indiana, George has hustled his way to Nashville, Tn. When he is not fighting his way through rough mornings in a cutting room at the butcher shop, he can be found on stage sharing his music on local and national stages. George's sound ranges from the most delicate and introspective acoustic song to an extended jam layered with perfectly overdriven twang. His songs are well-crafted and possess a brutal honesty that is hard to come by in the industry.","img":""},{"venue":"Evening Muse","event":"The Trashcan Sinatras All Acoustic Seated Show","date":"11 02 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1536136","tuneStub":"","href":"http://www.eveningmuse.com/event/1536136-trashcan-sinatras-all-charlotte/","desc":"All Night With the Trashcan Sinatras\n2017 USA Acoustic Tour\nOver 5 weeks, late in 2017, Frank Reader, Paul Livingston and John Douglas from the Trashcan Sinatras will be touring the USA as a three-piece acoustic lineup. The band mates celebrate their 30th anniversary, having formed in Irvine, Scotland in 1987. “I’ve been in the band for thirty years now,” says Livingston. “That’s a long time to be in any relationship. I’s a good time to take stock, see how far we’ve come, and think about where we’re headed.”\nWith six well-spaced full-length albums to their credit, starting with debut Cake in 1990, through last year’s Wild Pendulum, the band has written and released just north of 100 songs. Over the course of the tour, they plan to play each one of those songs. “Now that we’ve reached a century of songs,” says Reader, “it feels like a good time to meet up with them all again, like a high school reunion.” He adds, “Those songs whose love and friendship we’ve nourished over the years will no doubt turn up most nights and show us why we’ve remained so close over the years, but it’ll be most interesting to see how those with whom we’ve lost touch have aged.” He expects that some songs will “turn up drunk and disheveled,” while others “may now be dashing and distinguishing, more so than we all would have guessed. I can’t wait to meet them all again and find out.”\nEvery show will consist of two unique sets and fans can expect to hear some covers, too. Although the band often delves into its back catalog for obscurities, particularly during acoustic tours, many songs have never been played live. Others may never be played again. “We will be playing some songs live that we have never attempted before, so in some ways, it’s a tightrope walk for us. But, these songs are what we have done with our lives, so I accept the challenge and will try to not look down,” says Douglas.\nPerforming acoustically will transport many of those 100 songs back to their origins. “Most of our songs are written with acoustic guitars and voices in quiet, solitary rooms, so it will be nervy but exciting to bring that sound out of the backroom and into the light,” says Douglas. According to Livingston, “touring with no rhythm section means you have to take your cues more from the vocal. You can bend time and create space for the emotion of the song to come through.”\nThirty years on, this is a chance for the band to reflect on its past, take a look at the present and imagine where they might go next. Playing all of the songs they’ve written seems a good way of celebrating the journey so far. Come along early, join the band in celebration and see which songs the evening brings.","img":""},{"venue":"Evening Muse","event":"OLD SALT UNION","date":"11 08 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1543611","tuneStub":"","href":"http://www.eveningmuse.com/event/1543611-old-salt-union-charlotte/","desc":"A great band is more than the proverbial sum of its parts, and in the pursuit of becoming something that can cut through the clutter of YouTube stars and contest show runner-ups, a great roots music band must become a way of life. Less likely to rely on production or image, they’ve got to connect with their audience only through the craftsmanship of their songs, the energy they channel on the stage and the story that brings them together.\n\nOld Salt Union is a string band founded by a horticulturist, cultivated by classically trained musicians, and fueled by a vocalist/bass player who is also a hip-hop producer with a fondness for the Four Freshmen. It is this collision of styles and musical vocabularies that informs their fresh approach to bluegrass and gives them an electric live performance vibe that seems to pull more from Vaudeville than the front porch.\n\nIn 2015 they won the FreshGrass Band contest and found the perfect collaborator in Compass Records co-founder and GRAMMY winning banjoist and composer, Alison Brown, whose attention to detail and high standards pushed the group to develop their influences from beyond a vocabulary to pull from during improvisation and into the foundation of something truly compelling in the roots music landscape.\n\nViolinist John Brighton mentions some names familiar to the Compass roster as key influences, musicians like Darol Anger, Edgar Meyer, Mike Marshall and Mark O’Connor, all of whom have collaborated with Brown in the past. Primary vocalist and bassist, Jesse Farrar (for the indie rock heads - yes, he’s related – Son Volt front man Jay Farrar is Jesse’s uncle) brings an alternative rock spirit as well as his unique formative experiences as a hip hop producer and bass player for a national tour of The Four Freshmen. The band’s self-titled Compass debut combines these instrumental proclivities with pop melodies and harmonies into a coherent piece of work that carves out a road-less-travelled for the band in the now crowded roots music genre.\n\nThe album kicks off with a nod to alternative rock sensibilities – a deconstructed symphonic drone creeps in slowly, while Farrar emerges through the atmospherics to deliver the first lines “Stranded on a lonely road/Trying to find my way back home/A dollar and a broken heart/Didn’t seem to get me very far”. His words are followed by a dramatic moment of silence (a trick often used in hip hop) that quickly launches into “Where I Stand”, a hard-driving bluegrass track that gets moving so powerfully you almost don’t notice the layer of angelic harmonies flowing consistently underneath.\n\nMandolinist Justin Wallace takes over lead vocal duties for the second track “Feel My Love” as well as a version of Paul Simon’s “You Can Call Me Al”. He pops up again on his composition “On My Way” and his no-frills, approachable voice is the perfect complement to Farrar’s more gymnastic style. The two work together beautifully on the Wallace-penned, “Hard Line”. Wallace is further showcased on the disc’s lone instrumental “Flatt Baroque”, composed by Brighton, who joins him in some twin mandolin, and it’s this more contemplative moment on the album where the listener hears him reaching to be in perfect sync with his bandmate, that best reflects Wallace’s role in the evolution story of the band. If Farrar has emerged as the heartbeat, then Wallace is the soul.\n\nPerhaps most surprisingly, the band was founded by banjoist Ryan Murphey, the aforementioned horticulturist who came to bluegrass music and the banjo later in life. Finding a kindred spirit in Dustin Eiskant, the band’sformer guitarist and Farrar’s cousin, the pair started the band in 2012 and Murphey played the banjo and led the band’s business through its early incarnations, including the recruitment of Farrar in 2014.\n\nWhen Eiskant quit in 2016, just as the band’s already impressive trajectory seemed to be taking a significant step forward, Murphey and the band were able to reset, adding guitarist Rob Kindle to the lineup. Kindle brings a bluegrass foundation from his early exposure to the music as a child in family settings, as well as a degree in jazz performance to the mix.\n\nThough the band had established themselves as a growing festival act with performances at LouFest, Stagecoach Festival, Bluegrass Underground, Winter Wondergrass, Freshgrass, Wakarusa, Yonder Mountain String Band's Harvest Festival, and the 2014 Daytona 500, it was their breakout track on Spotify, “Madam Plum” that seemed to amplify awareness of the band beyond the bluegrass bubble.\n\nOf working with the band in the studio, producer Brown says, “These post modern bluegrassers are true renegades. While they look like a bluegrass band, their musical sensibilities run much deeper and broader, borrowing as much from indie rock and jazz fusion as from Bill Monroe. And, even more exciting to me, they know no fear! They are wide open musical adventurers and we had a great time experimenting in the studio at the crossroads of these disparate influences.”\n\nThe most unexpected but possibly most fascinating song on the album is a ballad entitled “Bought and Sold”. Its earnest beauty is balanced with a youthful inventiveness that leaves a solemn mark on the listener who might wake up at the end of it thinking, “What just happened?”.\n\nAt this point, the future of the band seems marvelously unclear. The album closes with “Here and Off My Mind” which seems like the bluegrass song that Conor Oberst never wrote featuring a lyric that ends with the promise of “a better life” though from the all-hands-on-deck jam session that breaks out in the middle (is that a kazoo?) one gets the sense that the band can’t imagine a better one than they have in the beat up Winnebago they currently call home.\n\nOld Salt Union’s self-titled new album will be released August 4th.","img":""},{"venue":"Evening Muse","event":"An Evening With CALLAGHAN & JESSE TERRY","date":"11 10 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1541265","tuneStub":"","href":"http://www.eveningmuse.com/event/1541265-evening-callaghan-jesse-charlotte/","desc":"On the eponymous title track of Stargazer, the lushly orchestrated and existentially optimistic fourth LP from singer/songwriter Jesse Terry, the notion of personal unhappiness is framed in terms of a cosmic choice: “Go on stargazer, I know how much it hurts / But you are free now to pick your universe.” Infused with the warmth of a beautifully arranged string quartet and the otherworldly tremor of a lap steel guitar, “Stargazer” unfurls as a melodic Zen koan, a deep intuition all of us have at one point or another that the extent of our suffering — no matter its apparent source or point of origin — is largely up to us. The world’s frequent brutality and indifference are undeniable facts of life, facts that can feel oppressive and impenetrable. True freedom inheres in our ability to choose hope — to pick resilience over recrimination, optimism over oblivion. Taking that timeless and hard-won kernel of wisdom as his starting point — the recognition that hopelessness is the worst kind of human prison —  Terry’s lustrous, earnest Stargazer is precisely the kind of record we need in these seemingly hopeless times.\n\nIn a period of American life considered the most divisive and tribalistic in modern memory, the notion of hopefulness may feel misplaced to some. For Terry, though, it’s a byproduct of his own life experience. “I think I will always be innately hopeful, because I’ve seen how much life can change,” he says.  “And I’ve seen how much people can change, if they open up and allow themselves to do so.” After a turbulent adolescence defined by runaway shelters and reform schools, Terry grew up encountering other people in increasingly desperate situations. He credits the health of his outlook today to the pain he shared with others all those years ago. “I’m only happy because I know how difficult life can be. And then I become even more grateful, because even though I’ve traveled down some dark roads, I’ve met many more that have had it so much worse,” he says.  “People whose lives were devoid of love or light, without any family or without families that cared.” When he awoke hooked up to machines in a hospital bed in the aftermath of a substance-fueled binge at 18 years old, Terry says he realized that happiness is a choice, and he vowed to begin making it daily.  At a certain point, he says, a vision of what happiness would look like took hold in his mind. “I feel like I’ve been on that path for a long time now,” he says. “There always was a tiny spark in the shadows, even at my lowest points. If you’re working on it, the light gets brighter every day. Now I’m in a place that I love, with a wife that I love, with family in my life that I love. But it took a long while.”\n\nAround that time in his life, Terry’s mother lent him her old acoustic guitar — it was love at first pluck. Songwriting became a codified means for him to discover who he was, and he dropped out of art school to pursue it full-time. Though he had been on a path to become a painter, he says there was something vital in music that was missing in visual art. “Fine art at that time felt more like a chore than a gift,” he says. “I knew that I had some talent there with visual art, but it didn’t save my life like music did. I never needed it to survive.” Music had always been a part of Terry’s life, however. His earliest musical memories were the sounds emanating from his parents’ turntable: the Beatles, Roy Orbison, the Beach Boys, Electric Light Orchestra (sounds that, not coincidentally, largely inform the sonics of Stargazer). Both his parents had beautiful singing voices and were part of a successful local duo until they divorced when he was five. His father maintained a recording studio of one sort or another throughout Terry’s childhood, and he would often let his son record vocals on tracks. It wasn’t until he began writing his own songs that Terry truly began to realize music’s capacity to heal. Though he had turned to the Beatles and James Taylor for healing and guidance through some of the most difficult seasons of his own life, he realized that songwriting gave him that same capacity for connecting with another troubled soul. More powerful still was the realization that his songs might be able to help others heal. “At a certain point I realized that I might have the chance to ease someone else’s pain with my music, which is a much more powerful and humbling thing,” he says. “So I consider myself very lucky if the experiences that I went through gave me some empathy and helped me connect with other human beings at a foundational level – to understand some of that struggle and some of that resilience.”\n\nStargazer is very much an album representing the arc of that journey. Forged in the crucible of the artist’s earnest engagement with a chaotic, confusing world, the record is wonderfully difficult to classify. Drawing inspiration from a diverse pool of influences — from vintage Jeff Lynne-produced pop to the Roy Orbison of “In Dreams” to The Man Who-era Travis — Stargazer is an album commensurate with its moment, imbued with an unconquerably hopeful perspective. “I will always go back to hope and lean on that, because that’s what has gotten me here in the first place,” Terry says. Produced with multi-instrumentalist collaborator Josh Kaler in Nashville’s sumptuous EastSide Manor Studios, every aspect of the album went through an intentionally rigorous evaluative process. “Josh and I worked in the studio for months, making sure that we were bringing something fresh to every track, some kind of new sound or new harmony line or new string line,” Terry says. “I wanted Stargazer to be arranged and produced like the records I first fell in love with.” A significant part of that production process involved strings and renowned arranger Danny Mitchell. “I’ve worked with great string players in the past, but this is the first album where I’ve had the strings professionally arranged for a quartet,” Terry says. The inherent magic, power, and emotion in Mitchell’s arrangements are palpable throughout the record. “I wrote many of these songs with the strings in mind, knowing that they’d be taking my songs to new places.”\n\nOne need only listen to the soaring chorus of track “Woken the Wildflowers” to understand what Terry means. Begun while on holiday in New Zealand with his kiwi wife in the wake of the 2017 Women’s March, the song is a tribute to the renewal of American ideals made manifest that day. “Those are the American values that we read about in grade school – equality, justice, decency, freedom, truth – and I loved seeing millions of people across the world standing up for those beliefs,” Terry says. “I wanted to honor that in song.” Undergirding the chorus’ gentle call to “Wake up, wake up, wake up,” the strings swell with the possibility of regeneration felt across the world that day.\n\nStargazer is notable, too, for the diversity of its sonic palette. Terry is as adept at cross-pollinating spacey rockabilly with power pop (“Dance in Our Old Shoes”) as he is at writing dreamy, Beatles-esque ballads about a loved one’s toxic personality (“Kaleidoscope”); as comfortable at the helm of a charging, Springsteen-down-South ode to the new Nashville (“Runaway Town”) as he is singing a heartbreakingly tender lullaby to a European capital (“Dear Amsterdam”). “People, myself included, are always trying to categorize music into specific genres and I really wanted to avoid thinking that way while making this record,” he says. “In fact, the term ‘genre-less’ became a bit of a mantra for me as I was writing and recording Stargazer.”\n\nThe result is a record representing a clarity of vision and a creative pinnacle that, for Terry, has been a career in the making. The countless hours logged on the road and in the studio, he says, have primed him for this moment. “I’ve loved the slow and steady arc my career has taken, the places around the world it’s taken me and the people it’s put in my path,” he says. “Two years ago, even a year ago, I wasn’t ready to make this album.”\n\nHe remains anchored to the raw wonder he felt when first picked up his mother’s guitar all those years ago, to the period in his life when an optimist emerged from the black fog of early tribulations.\n\n“Everything feels like it’s happening at the right time.”","img":""},{"venue":"Evening Muse","event":"An Evening With CALLAGHAN & JESSE TERRY","date":"11 10 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1541265","tuneStub":"","href":"http://www.eveningmuse.com/event/1541265-evening-callaghan-jesse-charlotte/","desc":"On the eponymous title track of Stargazer, the lushly orchestrated and existentially optimistic fourth LP from singer/songwriter Jesse Terry, the notion of personal unhappiness is framed in terms of a cosmic choice: “Go on stargazer, I know how much it hurts / But you are free now to pick your universe.” Infused with the warmth of a beautifully arranged string quartet and the otherworldly tremor of a lap steel guitar, “Stargazer” unfurls as a melodic Zen koan, a deep intuition all of us have at one point or another that the extent of our suffering — no matter its apparent source or point of origin — is largely up to us. The world’s frequent brutality and indifference are undeniable facts of life, facts that can feel oppressive and impenetrable. True freedom inheres in our ability to choose hope — to pick resilience over recrimination, optimism over oblivion. Taking that timeless and hard-won kernel of wisdom as his starting point — the recognition that hopelessness is the worst kind of human prison —  Terry’s lustrous, earnest Stargazer is precisely the kind of record we need in these seemingly hopeless times.\n\nIn a period of American life considered the most divisive and tribalistic in modern memory, the notion of hopefulness may feel misplaced to some. For Terry, though, it’s a byproduct of his own life experience. “I think I will always be innately hopeful, because I’ve seen how much life can change,” he says.  “And I’ve seen how much people can change, if they open up and allow themselves to do so.” After a turbulent adolescence defined by runaway shelters and reform schools, Terry grew up encountering other people in increasingly desperate situations. He credits the health of his outlook today to the pain he shared with others all those years ago. “I’m only happy because I know how difficult life can be. And then I become even more grateful, because even though I’ve traveled down some dark roads, I’ve met many more that have had it so much worse,” he says.  “People whose lives were devoid of love or light, without any family or without families that cared.” When he awoke hooked up to machines in a hospital bed in the aftermath of a substance-fueled binge at 18 years old, Terry says he realized that happiness is a choice, and he vowed to begin making it daily.  At a certain point, he says, a vision of what happiness would look like took hold in his mind. “I feel like I’ve been on that path for a long time now,” he says. “There always was a tiny spark in the shadows, even at my lowest points. If you’re working on it, the light gets brighter every day. Now I’m in a place that I love, with a wife that I love, with family in my life that I love. But it took a long while.”\n\nAround that time in his life, Terry’s mother lent him her old acoustic guitar — it was love at first pluck. Songwriting became a codified means for him to discover who he was, and he dropped out of art school to pursue it full-time. Though he had been on a path to become a painter, he says there was something vital in music that was missing in visual art. “Fine art at that time felt more like a chore than a gift,” he says. “I knew that I had some talent there with visual art, but it didn’t save my life like music did. I never needed it to survive.” Music had always been a part of Terry’s life, however. His earliest musical memories were the sounds emanating from his parents’ turntable: the Beatles, Roy Orbison, the Beach Boys, Electric Light Orchestra (sounds that, not coincidentally, largely inform the sonics of Stargazer). Both his parents had beautiful singing voices and were part of a successful local duo until they divorced when he was five. His father maintained a recording studio of one sort or another throughout Terry’s childhood, and he would often let his son record vocals on tracks. It wasn’t until he began writing his own songs that Terry truly began to realize music’s capacity to heal. Though he had turned to the Beatles and James Taylor for healing and guidance through some of the most difficult seasons of his own life, he realized that songwriting gave him that same capacity for connecting with another troubled soul. More powerful still was the realization that his songs might be able to help others heal. “At a certain point I realized that I might have the chance to ease someone else’s pain with my music, which is a much more powerful and humbling thing,” he says. “So I consider myself very lucky if the experiences that I went through gave me some empathy and helped me connect with other human beings at a foundational level – to understand some of that struggle and some of that resilience.”\n\nStargazer is very much an album representing the arc of that journey. Forged in the crucible of the artist’s earnest engagement with a chaotic, confusing world, the record is wonderfully difficult to classify. Drawing inspiration from a diverse pool of influences — from vintage Jeff Lynne-produced pop to the Roy Orbison of “In Dreams” to The Man Who-era Travis — Stargazer is an album commensurate with its moment, imbued with an unconquerably hopeful perspective. “I will always go back to hope and lean on that, because that’s what has gotten me here in the first place,” Terry says. Produced with multi-instrumentalist collaborator Josh Kaler in Nashville’s sumptuous EastSide Manor Studios, every aspect of the album went through an intentionally rigorous evaluative process. “Josh and I worked in the studio for months, making sure that we were bringing something fresh to every track, some kind of new sound or new harmony line or new string line,” Terry says. “I wanted Stargazer to be arranged and produced like the records I first fell in love with.” A significant part of that production process involved strings and renowned arranger Danny Mitchell. “I’ve worked with great string players in the past, but this is the first album where I’ve had the strings professionally arranged for a quartet,” Terry says. The inherent magic, power, and emotion in Mitchell’s arrangements are palpable throughout the record. “I wrote many of these songs with the strings in mind, knowing that they’d be taking my songs to new places.”\n\nOne need only listen to the soaring chorus of track “Woken the Wildflowers” to understand what Terry means. Begun while on holiday in New Zealand with his kiwi wife in the wake of the 2017 Women’s March, the song is a tribute to the renewal of American ideals made manifest that day. “Those are the American values that we read about in grade school – equality, justice, decency, freedom, truth – and I loved seeing millions of people across the world standing up for those beliefs,” Terry says. “I wanted to honor that in song.” Undergirding the chorus’ gentle call to “Wake up, wake up, wake up,” the strings swell with the possibility of regeneration felt across the world that day.\n\nStargazer is notable, too, for the diversity of its sonic palette. Terry is as adept at cross-pollinating spacey rockabilly with power pop (“Dance in Our Old Shoes”) as he is at writing dreamy, Beatles-esque ballads about a loved one’s toxic personality (“Kaleidoscope”); as comfortable at the helm of a charging, Springsteen-down-South ode to the new Nashville (“Runaway Town”) as he is singing a heartbreakingly tender lullaby to a European capital (“Dear Amsterdam”). “People, myself included, are always trying to categorize music into specific genres and I really wanted to avoid thinking that way while making this record,” he says. “In fact, the term ‘genre-less’ became a bit of a mantra for me as I was writing and recording Stargazer.”\n\nThe result is a record representing a clarity of vision and a creative pinnacle that, for Terry, has been a career in the making. The countless hours logged on the road and in the studio, he says, have primed him for this moment. “I’ve loved the slow and steady arc my career has taken, the places around the world it’s taken me and the people it’s put in my path,” he says. “Two years ago, even a year ago, I wasn’t ready to make this album.”\n\nHe remains anchored to the raw wonder he felt when first picked up his mother’s guitar all those years ago, to the period in his life when an optimist emerged from the black fog of early tribulations.\n\n“Everything feels like it’s happening at the right time.”","img":""},{"venue":"Evening Muse","event":"STEPHANE WREMBEL","date":"09 22 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1501106","tuneStub":"","href":"http://www.eveningmuse.com/event/1501106-stephane-wrembel-charlotte/","desc":"The Stephane Wrembel Band is back on the road with two new recordings on Water Is Life Records, The Django Experiment I and II.  Both recordings primarily feature The Stephane Wrembel Band’s own interpretation of the songs of legendary jazz guitarist Django Reinhardt, as well as Wrembel’s original compositions, and those of other writers of the same vein of music. The Django Experiment I and II were released in conjunction with the Wrembel-produced Django A Gogo concert held at Carnegie Hall on March 3, 2017.  The event received rave reviews and included guitar masters Al Di Meola, Larry Keel, Stochelo Rosenberg and other gifted musicians all celebrating the music of Django Reinhardt.\n\nWrembel is best known for “Bistro Fada,” the theme song from the 2011 Woody Allen Oscar winning film, Midnight In Paris.  Subsequently, Wrembel was hand-selected by award winning composer/producer Hans Zimmer to perform at the 2012 Academy Awards® as part of his “All Star Band.” Later that year, Midnight in Paris won a Grammy Award for “Best Compilation Soundtrack for Visual Media”. Wrembel has contributed music to two other Allen films, a variety of commercials, and even helped Gentleman Shaver win a Clio Award for “Best Original Song Used in a Commercial”. He has toured around the world, and is hugely popular in many countries including France, India and Nigeria. New York Observer recently said, \"Stephane Wrembel represents the living face of Gypsy jazz.\"\n\nThe Stephane Wrembel Band includes long-time collaborators Thor Jensen (guitar), Ari Folman Cohen (bass), and Nick Anderson (drums).","img":""},{"venue":"Evening Muse","event":"Malcolm Holcombe","date":"11 29 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1526138","tuneStub":"","href":"http://www.eveningmuse.com/event/1526138-malcolm-holcombe-charlotte/","desc":"Acclaimed singer-songwriter, Malcolm Holcombe, whose \"heartfelt baritone\" (NPR) delivers \"haunted country, acoustic blues, and rugged folk\" (Rolling Stone), released his 14th studio album, Another Black Hole, on February 12, 2016.\n\nProduced by Grammy winning producer and engineer, Ray Kennedy, and Brian Brinkerhoff, Another Black Hole features Holcombe's rasping vocals and bright, percussive guitar accentuating his insightful lyrics. \"It is Malcolm's perception of the world that make his songs hit you like a gunpowder blast. His gruff and tough delivery are a primordial power full of grit, spit, and anthropomorphic expression,\" says Kennedy.\n\nRecorded at Room and Board Studios in Nashville, TN, the 10 song set features longtime musical compatriots including Jared Tyler (dobro, baritone guitar, banjo, mandolin, and harmony vocals), David Roe (upright and electric bass), Ken Coomer (drums and percussion), and special guests Tony Joe White (electric guitar), Future Man (percussion), and Drea Merritt (vocal harmony). \n\nBorn and raised in the Blue Ridge Mountains of NC, Holcombe is highly regarded and recognized by contemporaries in Americana music, including Emmylou Harris, Wilco, Steve Earle, and Lucinda Williams. An \"emotionally captivating\" (Isthmus), performer, Holcombe has shared the stage with Merle Haggard, Richard Thompson, John Hammond, Leon Russell, Wilco, Shelby Lynne, Cat Power, and Ray Wylie Hubbard.","img":""},{"venue":"Evening Muse","event":"The MammothsThe High DiversQuiet Hollers","date":"09 15 17","times":"\n  Doors: 8:00 pm / Show: 9:00 pm ","ticketfly":"1536528","tuneStub":"","href":"http://www.eveningmuse.com/event/1536528-mammoths-high-divers-quiet-charlotte/","desc":"Quiet Hollers are a cult/gang/band from Louisville, KY formed semi-accidentally in 2010 following an album release party for which the band was recruited.  \n\nIn 2013, the band’s debut album I Am the Morning, a “reverb-soaked dive into the stream-of-consciousness confessionals” (No Depression) of singer/songwriter Shadwick Wilde featured a drummer whose neck was literally broken-- the band refusing to postpone their session at the since-defunct Funeral Home studio of analog guru Kevin Ratterman (Murder By Death, Andrew Bird, My Morning Jacket) after a waterfall-diving accident.\n\nAlthough the album was received with polite applause from the European blogosphere, and a smattering of indie music writers for whom it was a “Best of 2013,”  it flew mostly under the radar in the band's hometown of Louisville, KY despite rotation on WFPK and a nomination for best album in the inaugural Louisville Music Awards.\n\nBooking a slew of tours across the eastern half of the US (often using connections from Wilde’s days as guitarist-for-hire for seminal Dischord Records band Iron Cross), Quiet Hollers produced their sophomore full-length without label support... relying instead on a small but dedicated cult following who funded nearly the entire project.\n\nReleased in October 2015, \"Quiet Hollers\" runs the proverbial gamut of the band’s eclectic influences to deliver literate, hook-laden narratives, blasting through tube amps in swirls of violin and piano.  Consequence of Sound called it a \"beautiful portrait,\" breaking the \"confines of roots music,\" and PopMatters deemed the album \"wonderfully unique,\" with a \"strong post-hardcore influence.\"","img":""},{"venue":"Evening Muse","event":"The MammothsThe High DiversQuiet Hollers","date":"09 15 17","times":"\n  Doors: 8:00 pm / Show: 9:00 pm ","ticketfly":"1536528","tuneStub":"","href":"http://www.eveningmuse.com/event/1536528-mammoths-high-divers-quiet-charlotte/","desc":"Quiet Hollers are a cult/gang/band from Louisville, KY formed semi-accidentally in 2010 following an album release party for which the band was recruited.  \n\nIn 2013, the band’s debut album I Am the Morning, a “reverb-soaked dive into the stream-of-consciousness confessionals” (No Depression) of singer/songwriter Shadwick Wilde featured a drummer whose neck was literally broken-- the band refusing to postpone their session at the since-defunct Funeral Home studio of analog guru Kevin Ratterman (Murder By Death, Andrew Bird, My Morning Jacket) after a waterfall-diving accident.\n\nAlthough the album was received with polite applause from the European blogosphere, and a smattering of indie music writers for whom it was a “Best of 2013,”  it flew mostly under the radar in the band's hometown of Louisville, KY despite rotation on WFPK and a nomination for best album in the inaugural Louisville Music Awards.\n\nBooking a slew of tours across the eastern half of the US (often using connections from Wilde’s days as guitarist-for-hire for seminal Dischord Records band Iron Cross), Quiet Hollers produced their sophomore full-length without label support... relying instead on a small but dedicated cult following who funded nearly the entire project.\n\nReleased in October 2015, \"Quiet Hollers\" runs the proverbial gamut of the band’s eclectic influences to deliver literate, hook-laden narratives, blasting through tube amps in swirls of violin and piano.  Consequence of Sound called it a \"beautiful portrait,\" breaking the \"confines of roots music,\" and PopMatters deemed the album \"wonderfully unique,\" with a \"strong post-hardcore influence.\"","img":""},{"venue":"Evening Muse","event":"The MammothsThe High DiversQuiet Hollers","date":"09 15 17","times":"\n  Doors: 8:00 pm / Show: 9:00 pm ","ticketfly":"1536528","tuneStub":"","href":"http://www.eveningmuse.com/event/1536528-mammoths-high-divers-quiet-charlotte/","desc":"Quiet Hollers are a cult/gang/band from Louisville, KY formed semi-accidentally in 2010 following an album release party for which the band was recruited.  \n\nIn 2013, the band’s debut album I Am the Morning, a “reverb-soaked dive into the stream-of-consciousness confessionals” (No Depression) of singer/songwriter Shadwick Wilde featured a drummer whose neck was literally broken-- the band refusing to postpone their session at the since-defunct Funeral Home studio of analog guru Kevin Ratterman (Murder By Death, Andrew Bird, My Morning Jacket) after a waterfall-diving accident.\n\nAlthough the album was received with polite applause from the European blogosphere, and a smattering of indie music writers for whom it was a “Best of 2013,”  it flew mostly under the radar in the band's hometown of Louisville, KY despite rotation on WFPK and a nomination for best album in the inaugural Louisville Music Awards.\n\nBooking a slew of tours across the eastern half of the US (often using connections from Wilde’s days as guitarist-for-hire for seminal Dischord Records band Iron Cross), Quiet Hollers produced their sophomore full-length without label support... relying instead on a small but dedicated cult following who funded nearly the entire project.\n\nReleased in October 2015, \"Quiet Hollers\" runs the proverbial gamut of the band’s eclectic influences to deliver literate, hook-laden narratives, blasting through tube amps in swirls of violin and piano.  Consequence of Sound called it a \"beautiful portrait,\" breaking the \"confines of roots music,\" and PopMatters deemed the album \"wonderfully unique,\" with a \"strong post-hardcore influence.\"","img":""},{"venue":"Evening Muse","event":"NORA JANE STRUTHERS: \"Champion\" Release Tour","date":"11 18 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1552773","tuneStub":"","href":"http://www.eveningmuse.com/event/1552773-nora-jane-struthers-charlotte/","desc":"Great vulnerability is often part and parcel of great artistry. The songs that last decades and weave themselves into the fabric of listeners' lives are usually the ones in which an artist lays her soul bare for the world to hear. Nora Jane Struthers' new album Champion is built on these kinds of songs. \n\nThe 13-song collection is the follow-up to 2015's Wake, which earned Struthers acclaim from major outlets like NPR Music, Rolling Stone Country, and \"Fresh Air.\" Struthers wrote and recorded the album with her longtime road band the Party Line, and the chemistry between her and the other players is palpable. The album, produced by Neilson Hubbard in Nashville, is full to the brim with stellar musicianship, unexpected arrangements that blur the lines between folk, roots, and rock, and an audible sense that everyone in the studio is having a damn good time.   \n\nWhere Wake explored themes like new love and new beginnings, Championfinds Struthers documenting the trials and tribulations of adult life; decrying the increasingly intrusive nature of technology; and plainly laying out the struggles faced by a young woman grappling with infertility. \n\n\"I’m 33 and want to start a family, but when I was 18 I was diagnosed with a condition called premature ovarian failure,\" she explains. \"I’ve known for a long time that I’m going to have to find other ways to have kids. A lot of the songs on the album are about my personal fertility quest.\"  \n\nThat quest has led Struthers and her husband -- musician and songwriter Joe Overton -- down many new paths: trying alternative fertility methods, exploring Eastern medicine, and finding new strength in the support system of theirpartnership. It also led Struthers to see the other parents in her life -- friends, relatives, fans -- in a new light, an eye-opening experience also reflected on Champion. \n\n\"I’ve been watching my friends and family members become new mothers and parents,\" she explains. \"Everybody’s path there is so different and there are always challenges, but they present in different ways for different people. That’s been really interesting.\" \n\nWhile opening up about such a painful personal journey hasn't been an easy task for Struthers, she's happy to have put these experiences to song, in doing sofinding her own personal catharsis and hoping that others will experience the same sense of connection and release upon listening. \n\n\"There’s a weird societal stigma with infertility,\" she explains. \"I definitely feel like, in the past whenever I’ve opened up to people I’ve always been met with support and often with stories of someone else’s struggle,” she explains. “I’ve realized that this kind of problem is naturally really isolating, so this is my way to combat that isolation by being a voice for it and also by opening myself up to connect with other people.\" \n\nThe first track that Struthers wrote for what would become Champion drew heavily from the experiences of others. \"Wonderful Home\" is a hopeful closing note to the record, though the subject matter that inspired the lyrics was initially painful and difficult.  \n\n\"I was visiting a friend of mine in West Virginia who was, at the time, four months pregnant, and she was having a really difficult pregnancy,\" Struthers shares. \"There was a 50/50 chance that it was going to end in a miscarriage, and it had been so hard for her. I was thinking about my own emotional dealings with my infertility and really feeling for her, so I wrote the song for her and her husband about how I think they would be such wonderful parents.\" \n\nBy the time Struthers and her band entered the studio to record \"Wonderful Home,\" her friends had tragically lost the first baby, but were happily seven months into a second, healthy, pregnancy. The song became something of an anthem for Struthers, enabling her to move forward with telling her own difficult story. \"The arc of that particular song is the arc I hope my own fertility journey takes,\" she adds. \n\nThere are many hopeful moments on the album. Standout track \"Belief\" is a nuanced look at the difficulties of staying optimistic in the face of setbacks, illustrating both the fragility and the resiliency of hope. The track builds from Struthers singing over a lone acoustic guitar to a harmony-drenched anthem, mirroring the song's message of hope and redemption.\n\n\"'Belief' is the bedrock of the record,\" Struthers says. \"I’ve really grappled with the mind-body connection. I really wanted to believe in my body but instead I was just on the side of hoping. There’s a strange shame that comes with that that I couldn’t fully grasp.\" \n\nWhile her journey in trying to start a family takes center stage in many on Champion, it's far from the only topic to which Struthers lends her thoughtful eye and singular voice. On opening song \"Each Season,\" she and Overton explore the strange, wonderful bond experienced in long-term relationships, the story told over crunchy guitars and gently rolling banjo. \n\n\"The first track on the album is a song that my husband and I wrote together,\" she says. \"It’s the second song we’ve ever written together. It’s about how when you have a partner and have love, time — which is such a strange thing anyway — everything circles and centers around them, and around you two as a unit, and how beautiful that is because it gives you an anchor in the tumultuous sea of time.\" \n\nThat tune is one of only two co-writes on the album, as Champion is, through and through, a showcase of Struthers' voice and preternatural gift for storytelling. Coupled with a more deeply realized sense of vulnerability, that narrative tendency makes for a collection of stories that should resonate long after the last notes of the last track end. \n\n\"My songwriting style on this album is a real marriage of the narrative style songs I was writing in my early career and then the really autobiographical style of my last album,\" Struthers says. \"It feels like a natural progression of artistic growth that was both hard and easy at the same time, and I think you can hear that when you listen to it.\"","img":""},{"venue":"Evening Muse","event":"One Special Night with Patrick Davis - Two different shows!","date":"12 01 17","times":"\n  Doors: 6:30 pm / Show: 7:00 pm ","ticketfly":"1536025","tuneStub":"","href":"http://www.eveningmuse.com/event/1536025-one-special-night-patrick-charlotte/","desc":"PATRICK DAVIS (Solo Acoustic)\n\nPatrick Davis is a southern singer, songwriter, storyteller & showman originally from Camden, South Carolina who has spent the last fourteen years making his musical mark in Nashville, TN. Patrick learned the finer points of music & performance growing up in a household that not only included a talented guitar playing father, but also an extensive record collection always readily available for his absorption. At the age of 16 Patrick joined his father Rusty on stage for his first ever performance and since that initial “gig” music has been the only job Patrick has ever held. \n\nAfter graduating from The University of South Carolina in 2000 Patrick moved to Nashville, TN where for almost 15 years he has continued to build his songwriting, artist and touring career. Patrick has released four well received full length albums, toured the US & Europe as both a headliner & support act for Darius Rucker, Jewel & others while also being employed as a staff writer for Warner Chappell Music Publishing & having over 50 songs recorded by artist like Jimmy Buffet, Lady Antebellum, Imelda May, Darius Rucker, Jewel, Robert Randolph, Guy Clark and many more. \n\nPatrick’s “Patrick Davis & Midnight Choir” is an 11-piece band featuring horns & background singers created by PD in early 2016 from both his own artistic vision & the soundscapes of his songwriting & performing heroes Van Morrison, Lyle Lovett & Bruce Springsteen. Davis borrowed the name “Midnight Choir” from a line in one of his favorite Leonard Cohen songs “Bird On a Wire” & since his eleven-piece outfit starting playing dates Davis & “His Midnight Choir” have witnessed growing congregations across the Southeast.\n\nTHIS IS A VERY SPECIAL ENGAGEMENT FEATURING TWO ENTIRELY DIFFERENT PATRICK DAVIS SHOWS:\n\n7:30pm Solo-Acoustic show ($22advanced/$25day-of-show)\n\n10:30pm Full Band - The Midnight Choir ($22advanced/$25day-of-show)\n\nSPECIAL TICKET FOR BOTH SHOWS IS ONLY $40","img":""},{"venue":"Evening Muse","event":"ELLIS PAUL","date":"11 24 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1441107","tuneStub":"","href":"http://www.eveningmuse.com/event/1441107-ellis-paul-charlotte/","desc":"\"Despite his success and sense of history, Mr. Paul remains an artist with his eye on the future and an interest in discovering the transformative potential in his music.\" - The New York Times\n\nSome artists document their lives through their music. Others chronicle their times. It’s a rare artist who can do both, telling their own story through songs that also encapsulate the essence of people and places who have helped define their era overall. Woody Guthrie comes to mind, and so does Bob Dylan. Bruce Springsteen certainly as well. Yet few others, for whatever genius they may possess, can relate their own history to the history experienced by those who find that common bond, be it in a coming of age, living through the same realities or sharing similar experiences.\n\nEllis Paul is one of those gifted singer/songwriters.Though some may refer to him as a folksinger, he is more, for lack of a better word, a singular storyteller, a musician whose words reach out from inside and yet also express the feelings, thoughts and sensibilities that most people can relate to in one way or another, regardless of age or upbringing. The exhilaration of the open road. A ​celebration of heroes.​ ​The hope for redemption. Descriptions of those things that are both near and dear. The sharing of love..., intimate, passionate and enduring.\n\nThese are the scenarios that emerge from Ellis Paul’s new album, Chasing Beauty, a set of songs which detail, in typical Paul fashion, stories of people and places that reflect larger truths about us all. “Kick Out the Lights (Johnny Cash)” pays tribute to that fearless American icon name-checked in its title. “Plastic Soldier” offers homage to a wounded soldier returning from Afghanistan. A real-life barnstorming pilot takes the spotlight in “Jimmie Angel’s Flying Circus,” while iconic Boston blue collar musician Dennis Brennan takes the focus in “Waiting on a Break.” Even the Empire State Building and the Boston Red Sox get their due, via “Empire State” and “UK Girl (Boston Calling),” respectively.\n\nIn reality, these stories are a continuation of tales Paul has told for more than a quarter century, over the expanse of nineteen albums, numerous critical kudos (15 Boston Music Awards alone), inclusion in several movie soundtracks, and stages he’s headlined both near and far. “I’ve got a car with over 4​75​,000 miles on it, and it's my third road vehicle,​” Paul declares. “I’ve been doing 200 shows a year for over twenty years. There isn’t a town in the country where I won’t find a friend. I’m a nomad. And I’m gonna write and play until I’m gone.”\n\nNo doubt he will. Still, it’s somewhat ironic that Paul gravitated towards this bigger world of intent and expression given that the place Paul considers his hometown these days isn’t New York or Nashville, or Boston or Austin or ​Charlottesville, VA. where he lives, but rather Presque Isle, Maine, a tiny enclave surrounded by three rivers. Not surprisingly, the name translates to “almost an island.” Presque Isle shares a vanishing tradition with many small towns these days, where family farms are giving way to industrializ​ation​ ​and giant corporations, and earning a livelihood from the land is no longer the simple option it once was. Nevertheless, it’s still a haven for traditional values and for people as real and authentic as the soil they once tilled. If there’s one grace left to cling to, it’s the grace of nature’s beauty, sealed off by the surrounding mountains and fields.\n\nLikewise, his geographical origins also couldn’t have been further from the world at large. He was born in the dead of winter in the small town of Fort Kent, Maine, a place nestled right up next to the Canadian border. He came from humble origins, a family of potato farmers who could count among their forebears a veteran of the battle of Gettysburg, whose heroism on that field of honor earned him the 140 acres of Maine farmland that his descendants would continue to sow. It was the place that taught Paul the meaning of hard work and self-reliance, and the values that accompany as much drive and determination any individual could muster.\n\nAs a boy, Paul found his escape in athletics, working out as a runner and testing his mettle in the open spaces near his home. He became a star competitor, and enjoyed the advantage of traveling throughout the nation after being given opportunities to compete. Along the way, he saw more of the country than most people do in a lifetime. “I was lucky to be able to travel for competitions all over the U.S. and to see places I once could only dream of,” he recalls. “The Olympic Stadium in Los Angeles, the endless plains of Texas, the Kansas prairie, the Rocky Mountain in Wyoming. Every trip was funded by a hat the town passed around on my behalf, and it never came back empty.” When Paul finished second in a nationwide track competition, he was met at the airport by the high school marching band and a fire engine with spinning lights that drove him in triumph through town. In an expression of hometown pride, the mayor handed him the key to the city.\n\n​No one ever told Paul he had to follow in his family’s tradition. He was a dreamer after all, and he had seen enough of America to know there was more out there than his little town could ever offer. Consequently, his ambitions were never destined to stay bottled up for long. He would write, paint, play trumpet and sing in the school choir. “I never had anyone tell me I had to be a farmer,” Paul insists. “I had plenty of people telling me how my hard work and talent ​c​ould take me places​. T​hat’s enough to get you dreaming, And enough to make you believe those dreams are within reach.”\n\nIndeed, Paul found those dreams were within his reach, at least in terms of his imagination. However​ their pursuit would take him far from home. His first destination was Boston College, courtesy of a ​​track​ scholarship. Yet as Paul describes it, his athletic endeavors, combined with his academic responsibilities, served to rob him of his creativity. It was only after he suffered a knee injury which forced him to take a year off that he rebounded with a new form of expression, made possible when his girlfriend’s sister gave him a secondhand guitar. “A mysterious, lustful partnership with the instrument followed,” Paul concedes. “It became a marriage, a friendship, a lifelong bond that only comes when you find that one thing that becomes an extension of yourself. I played for hours, choosing to write ​my own original ​​songs and sing instead of studying, socializing or exploring what the Boston streets could offer after hours.”\n\nAfter graduation, Paul did find time to explore those paths, while taking opportunities to indulge his creative ambitions. Working as a teacher and social worker with inner city children by day and pursuing the possibilities offered by Boston’s fertile music scene at night, he gained prominence in local coffeehouses and open mic nights. It was the same circuit that opened the door for other like-minded artists of the day, and in turn, gave Paul exposure to such creative contemporaries as Shawn Colvin, Dar Williams, Patty Larkin, John Gorka, Catie Curtis, and Bill Morrissey. It also helped him win a Boston Underground Songwriting competition and placement on a Windham Hill Records singer/songwriter compilation, bringing him his first hint of national exposure at the same time.\n\nThe major tipping point in his career came with the opportunity to open for Bill Morrissey, one of New England’s most prominent folk artists. Paul would repeatedly ask Morrissey about his own influences and seek his advice on who he ought to listen to. “You know, that’s a very smart thing to do,” Morrissey muses. “It helped set him apart. A lot of young singers I meet are not curious about what went on before; they just say, ‘I want to sing another song about my life.’ Paul has a sense of roots, of connectedness to the whole history of folk music; he sees the thread that runs through all the generations of this music.”\n\nIt was mutual admiration that caused Paul to ask Morrissey to produce his first full album, 1993‘s Say ​Something. It was released on Black Wolf Records, the label he founded with ​Ralph​ Jaccodine, the man who would become his manager. “​Ralph was fulfilling a dream to get into the music business,” Paul recalls. “Starting with a folk singer isn’t a rocket​ launch, but we got off the ground. We started a label and began a lifelong​, DIY​ ​partnership and have been​ ​in the trenches​ for over 20 years.​”\n\nPaul also became infatuated with the music of Woody Guthrie, drawn to Woody’s social consciousness and the humanitarian streak that ran through his work. He even had a tattoo of Guthrie imprinted on his right shoulder, referring to it as “a badge of who he ​was.” His commitment to Guthrie’s legacy eventually led to his inclusion in a ten day celebration of Woody’s work held at the Rock and Roll Hall of Fame in September 1996, an event that included such notables as Bruce Springsteen, Billy Bragg, the Indigo Girls and Ani DiFranco and which was presided over by Guthrie’s daughter Nora. Later, when Guthrie’s hometown of Okemah, Oklahoma hosted the first Woody Guthrie Folk Festival in July, 1998, Paul was tapped as one of the headliners. He has since made this an annual part of his touring schedule,​ garnering the honor of being named an honorary citizen of Okemah in the process. The connection with Guthrie continued into the new millennium when Nora Guthrie invited him to put music to a set of her father’s lyrics. He later participated in the “Ribbon of Highway” tour, a communal salute featuring such luminaries as Arlo Guthrie, Marty Stuart, Ramblin’ Jack Ellott, Nanci Griffith, Guy Clark and Janis Ian, among others. ​\n\nThere’s likely no greater evidence of how Guthrie’s insights and humanity have rubbed off on Paul than in this particularly telling tribute from Nora Guthrie. \"A singer songwriter is only as good as the times he reflects,”she said in praising Paul. “In times like these, when so many nuts are running the show, it's comforting to know that Ellis Paul is actually holding our sanity on his own stage! Wise, tender, brilliant and biting, Ellis is one of our best human compasses, marking in melodies and poems where we've been and where we might go if we so choose to. Personally Ellis, I'm goin' where you're goin'!​\"​\n\nWhere Paul is “goin’” is to practically every place a microphone beckons and a crowd of the folk faithful awaits. He’s become a staple at the Newport Folk Festival, ​played Carnegie hall, and venues from Alaska to Miami, Paris and London. In addition to his 19 albums released on the Rounder and Black Wolf record labels, his music has appeared on dozens of distinguished compilations. A ​Film/​DVD entitled ​3000 Miles​​ -- part concert film, part documentary, part instructional video -- provides a further prospective on both the man and his music. He’s also released a pair of children’s albums, earning him honors from the Parent’s Choice Foundation ​for both.​ ​H​is latest, ​\"​The Hero In You​\" has been turned into a​ picture book, detailing the lives of great American heroes​.​ Ellis' literate, evocative and insightful writings are further showcased in a book of poetry and short stories entitled “Notes from the Road,​\" already in it's third pressing. ​\n\nIt’s no wonder then that recently Paul received ​a ​prestigious​ honor: an honorary Doctor of Humane Letters degree from the University of Maine, which also asked him to ​write the school's ​a​lma ​mater a​s well as ​deliver its commencement address in May 2014.\n\nHappily, his music has been shared with a wider audience as well, through commercials, documentaries, TV shows and in the soundtracks of several blockbuster films, among them three by the Farrelly Brothers -- “Hall Pass” (starring Owen Wilson and Alyssa Milano), “Me, Myself, & Irene” (starring Jim Carrey) and “Shallow Hal” (starring Jack Black and Gwyneth Paltrow). Peter Farrelly summed up the sentiments of all those who have come to know and appreciate Paul’s music by referring to him as “a national treasure.”\n\nNot surprisingly, Paul’s consistently been heralded by others as well. ​O​ne writer noted “that it reminds you how much we need storytellers back in pop music -- storytellers with empathy, fine eyes and an understanding that even though we live in a soulless, indifferent would, out music doesn’t have to reflect our culture.\" ​Another reviewer was even more pointed. “Ellis Paul is one of the best singer/songwriters of his generation,” she commented. “And for many of us he is the face of contemporary folk music. Few are as smart, as literate, as poetic as Paul. I cannot think of another artist on the acoustic music scene is better loved by fans, or more respected by his contemporaries.”\n\nIndeed, he is all that, and in a very real sense, even more. He’s an observer, a philosopher, and an astute storyteller who shares with his listeners the life lessons he’s learned, and in turn, life lessons they ought to heed as well. By affirming and defining who he is, Ellis Paul affirms and uncovers the essence of us all.\n\n-- Lee Zimmerman (writer/reviewer for American Songwriter, No Depression, New Times, Country Standard Time, Blurt, Relix, and M Music and Musicians​)​","img":""},{"venue":"Evening Muse","event":"Kevin MarshallTony EltoraYes Ma'am","date":"08 31 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1520861","tuneStub":"","href":"http://www.eveningmuse.com/event/1520861-kevin-marshall-tony-eltora-charlotte/","desc":"Yes Ma'am - A country-folk group based in Charlotte, NC.  2 Guitars, tight harmonies and a hammer dulcimer.  Their songs are a blend of romantic remorse and upbeat stories of overcoming demons and double-homicides.  Yes Ma'am will keep you tapping your foot and wishing you'd dumped that ex a few years earlier than you did.","img":""},{"venue":"Evening Muse","event":"Kevin MarshallTony EltoraYes Ma'am","date":"08 31 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1520861","tuneStub":"","href":"http://www.eveningmuse.com/event/1520861-kevin-marshall-tony-eltora-charlotte/","desc":"Yes Ma'am - A country-folk group based in Charlotte, NC.  2 Guitars, tight harmonies and a hammer dulcimer.  Their songs are a blend of romantic remorse and upbeat stories of overcoming demons and double-homicides.  Yes Ma'am will keep you tapping your foot and wishing you'd dumped that ex a few years earlier than you did.","img":""},{"venue":"Evening Muse","event":"Kevin MarshallTony EltoraYes Ma'am","date":"08 31 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1520861","tuneStub":"","href":"http://www.eveningmuse.com/event/1520861-kevin-marshall-tony-eltora-charlotte/","desc":"Yes Ma'am - A country-folk group based in Charlotte, NC.  2 Guitars, tight harmonies and a hammer dulcimer.  Their songs are a blend of romantic remorse and upbeat stories of overcoming demons and double-homicides.  Yes Ma'am will keep you tapping your foot and wishing you'd dumped that ex a few years earlier than you did.","img":""},{"venue":"Evening Muse","event":"Find Your Muse Open Mic with special guest ZEALYN","date":"09 25 17","times":"\n  Doors: 7:00 pm / Show: 8:00 pm ","ticketfly":"1536448","tuneStub":"","href":"http://www.eveningmuse.com/event/1536448-find-your-muse-open-mic-charlotte/","desc":"Zealyn, a Los Angeles based alternative / electronic artist, made her debut by releasing an EP titled Limbic System that received high praise for occupying the middle ground between the digital and the organic. She followed up Limbic System by releasing an alternate version of the EP, titled Limbic System: Reimagined which features 7 different producers re-interpreting each song as their own. In July, Zealyn completed Part 1 of the Limbic System Tour, a 2.5 week run of the West Coast stretching from Phoenix to Seattle. Now, starting on September 12th, she will be embarking on Part 2, where Zealyn and her band will spend 5 weeks covering the entire United States. Later this year Zealyn has plans to start releasing new singles to showcase where she is headed next in her musical career and how she's grown as an independent artist.","img":""},{"venue":"Evening Muse","event":"Find Your Muse Open Mic with special guest ZEALYN","date":"09 25 17","times":"\n  Doors: 7:00 pm / Show: 8:00 pm ","ticketfly":"1536448","tuneStub":"","href":"http://www.eveningmuse.com/event/1536448-find-your-muse-open-mic-charlotte/","desc":"Zealyn, a Los Angeles based alternative / electronic artist, made her debut by releasing an EP titled Limbic System that received high praise for occupying the middle ground between the digital and the organic. She followed up Limbic System by releasing an alternate version of the EP, titled Limbic System: Reimagined which features 7 different producers re-interpreting each song as their own. In July, Zealyn completed Part 1 of the Limbic System Tour, a 2.5 week run of the West Coast stretching from Phoenix to Seattle. Now, starting on September 12th, she will be embarking on Part 2, where Zealyn and her band will spend 5 weeks covering the entire United States. Later this year Zealyn has plans to start releasing new singles to showcase where she is headed next in her musical career and how she's grown as an independent artist.","img":""},{"venue":"Evening Muse","event":"DEAD HORSES","date":"10 08 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1536931","tuneStub":"","href":"http://www.eveningmuse.com/event/1536931-dead-horses-charlotte/","desc":"Since forming in 2010, Milwaukee-based folk band Dead Horses have cultivated a soulful roots sensibility well beyond their years due in part to the powerful musical and literary force that is their frontwoman and songwriter, Sarah Vos. Raised on Bible hymns by her preacher father, Vos' backstory sounds more like that of an old bluesman from the Mississippi Delta than a young folk singer from Wisconsin. Despite their youth, Dead Horses have crafted a timeless sound, informed as much by early-American prose as it is modern Americana music.","img":""},{"venue":"Evening Muse","event":"Find Your Muse Open Mic with special guest DAVID GOODIER","date":"10 16 17","times":"\n  Doors: 7:00 pm / Show: 8:00 pm ","ticketfly":"1546542","tuneStub":"","href":"http://www.eveningmuse.com/event/1546542-find-your-muse-open-mic-charlotte/","desc":"David Goodier was born at the crossroads of America in Terre Haute, Indiana. He started writing songs about as quickly as he began to play guitar and he has been performing, recording, and composing since he was 15. He has actively toured and played with multiple acts most notably the folk super group Yearbook Committee and rock band Nativemind. Along the way he's picked up the necessary skills to produce albums and has spent the last ten years as a sound engineer as well. However, at his core Goodier is a performer. Known for a powerful voice, well written songs, and an accessible and friendly stage presence his 20 years of stage experience shows the minute he smiles and picks up his guitar. His plan has always been to make music and he'd love to sit on a front porch or stand on a stage and sing pretty songs with you. His first full length studio album is set to be released this summer.","img":""},{"venue":"Evening Muse","event":"Find Your Muse Open Mic with special guest DAVID GOODIER","date":"10 16 17","times":"\n  Doors: 7:00 pm / Show: 8:00 pm ","ticketfly":"1546542","tuneStub":"","href":"http://www.eveningmuse.com/event/1546542-find-your-muse-open-mic-charlotte/","desc":"David Goodier was born at the crossroads of America in Terre Haute, Indiana. He started writing songs about as quickly as he began to play guitar and he has been performing, recording, and composing since he was 15. He has actively toured and played with multiple acts most notably the folk super group Yearbook Committee and rock band Nativemind. Along the way he's picked up the necessary skills to produce albums and has spent the last ten years as a sound engineer as well. However, at his core Goodier is a performer. Known for a powerful voice, well written songs, and an accessible and friendly stage presence his 20 years of stage experience shows the minute he smiles and picks up his guitar. His plan has always been to make music and he'd love to sit on a front porch or stand on a stage and sing pretty songs with you. His first full length studio album is set to be released this summer.","img":""},{"venue":"Evening Muse","event":"ZOE & CLOYD","date":"10 14 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1528822","tuneStub":"","href":"http://www.eveningmuse.com/event/1528822-zoe-cloyd-charlotte/","desc":"Zoe & Cloyd spring from deep roots in American music. Founding members of the acclaimed Americana trio, Red June, and long-time veterans of the Asheville, NC music scene, Natalya Zoe Weinstein and John Cloyd Miller are set to release their second full-length album in spring of 2017. Highlighting their emotive songwriting and signature harmonies, this new recording finds the duo returning to a full band sound with Kevin Kehrberg on bass, and special appearances from Will Straughan of Red June on dobro and Jens Kruger of the Kruger Brothers on banjo. The new record showcases the breadth of their collective musical spirit, seamlessly combining original folk, country, old-time and bluegrass with sincerity and zeal. Zoe & Cloyd’s debut recording, Equinox (2015), met with high acclaim and the pair have continued to gain momentum with a 1st place win at the prestigious FreshGrass Festival Duo Contest along with performances at MerleFest, Music City Roots and more.\n\nJohn Cloyd Miller’s foundation in traditional bluegrass and old-time music coupled with his modern sensibility combine to make him a natural musician and performer. A twelfth generation North Carolina native and the grandson of pioneering bluegrass fiddler and NC Folk Heritage Award winner Jim Shumate, his Appalachian roots run deep. John is well known for his haunting mountain voice as well as his instrumental prowess and award-winning songwriting. He is a 1st place winner of the prestigious Chris Austin Songwriting Contest and a recipient of an Artist Fellowship for songwriting by the North Carolina Arts Council. \n\nNatalya Zoe Weinstein also comes from a musical family: her father is master jazz pianist and her grandfather, originally from Russia, was a professional klezmer musician. She is an accomplished fiddler in a variety of styles as well as an inspired singer and songwriter. While trained classically in her home state of Massachusetts, she has spent many years fine-tuning her bluegrass and old-time fiddling with some of the country’s top traditional musicians. Now a mentor to many young players, Natalya is a sought after instructor and is in high demand as a teacher and session musician.","img":""},{"venue":"Evening Muse","event":"\"Candyrat Guitar Night\" featuring Peter Ciluzzi and Spencer Elliott","date":"09 30 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1526141","tuneStub":"","href":"http://www.eveningmuse.com/event/1526141-candyrat-guitar-night-peter-charlotte/","desc":"Spencer Elliott began composing instrumental piano music in his early years -- his influences mainly consisting of contemporary composers like George Winston.  It was later that he picked up the guitar, yet he was still more influenced by punk and alternative genres at that time. It wasn’t until 2007 that Spencer turned his focus to progressive steel string guitar. Spencer spent several years taking inspiration from artists such as Hedges, Ross, McKee and Dufour. Once Spencer began to write progressive finger style pieces, his compositional elements pulled not only from his piano background but also from his affinity for edgy guitar music. Spencer views modern finger style as part of the \"Free Space\", to borrow a phrase from Ian MacKaye (singer for Minor Threat and Fugazi and owner of Dischord Records). It is a place where new and original artistic ideas continue to bloom.  These ideas are not produced with profit in mind, but from a desire and a need to create.  Spencer’s compositions possess a cinematic quality, painting rich melodic landscapes that fuse his contrasting influences.\n \n \n\"To say that Spencer’s music has a cinematic quality would be an understatement. This is wordless music that takes you places.\" - Rudy Panucci (Pop Cult)\n \n\"Spencer's music is definitely unique.\" - Antoine Dufour","img":""},{"venue":"Evening Muse","event":"\"Candyrat Guitar Night\" featuring Peter Ciluzzi and Spencer Elliott","date":"09 30 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1526141","tuneStub":"","href":"http://www.eveningmuse.com/event/1526141-candyrat-guitar-night-peter-charlotte/","desc":"Spencer Elliott began composing instrumental piano music in his early years -- his influences mainly consisting of contemporary composers like George Winston.  It was later that he picked up the guitar, yet he was still more influenced by punk and alternative genres at that time. It wasn’t until 2007 that Spencer turned his focus to progressive steel string guitar. Spencer spent several years taking inspiration from artists such as Hedges, Ross, McKee and Dufour. Once Spencer began to write progressive finger style pieces, his compositional elements pulled not only from his piano background but also from his affinity for edgy guitar music. Spencer views modern finger style as part of the \"Free Space\", to borrow a phrase from Ian MacKaye (singer for Minor Threat and Fugazi and owner of Dischord Records). It is a place where new and original artistic ideas continue to bloom.  These ideas are not produced with profit in mind, but from a desire and a need to create.  Spencer’s compositions possess a cinematic quality, painting rich melodic landscapes that fuse his contrasting influences.\n \n \n\"To say that Spencer’s music has a cinematic quality would be an understatement. This is wordless music that takes you places.\" - Rudy Panucci (Pop Cult)\n \n\"Spencer's music is definitely unique.\" - Antoine Dufour","img":""},{"venue":"Evening Muse","event":"Mike MainsBrett Newski","date":"10 13 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1543814","tuneStub":"","href":"http://www.eveningmuse.com/event/1543814-mike-mains-brett-newski-charlotte/","desc":"Brett Newski has existed on the fringe of society and avoided the “American Dream” at all costs. At age 25, he took matters into his own hands by quitting all of his part-time jobs and becoming a full-time nomad, posting up in the nooks and crannies of earth and sub-letting rooms in Vietnam, South Africa, Germany and Wisconsin to write songs and recharge between tours. Newski’s sophomore LP “Land, Air, Sea, Garage” was recorded at a surf camp in the Sri Lankan jungle, and at home in Wisconsin. The album is about diving into the world with no safety net and landing on your feet. It’s a smart indie rock n’ roll record with tongue-in-cheek moments that show parallels to Violent Femmes, Jonathan Richman, Mountain Goats, early Weezer, Frank Turner, & Elliot Smith.","img":""},{"venue":"Evening Muse","event":"Mike MainsBrett Newski","date":"10 13 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1543814","tuneStub":"","href":"http://www.eveningmuse.com/event/1543814-mike-mains-brett-newski-charlotte/","desc":"Brett Newski has existed on the fringe of society and avoided the “American Dream” at all costs. At age 25, he took matters into his own hands by quitting all of his part-time jobs and becoming a full-time nomad, posting up in the nooks and crannies of earth and sub-letting rooms in Vietnam, South Africa, Germany and Wisconsin to write songs and recharge between tours. Newski’s sophomore LP “Land, Air, Sea, Garage” was recorded at a surf camp in the Sri Lankan jungle, and at home in Wisconsin. The album is about diving into the world with no safety net and landing on your feet. It’s a smart indie rock n’ roll record with tongue-in-cheek moments that show parallels to Violent Femmes, Jonathan Richman, Mountain Goats, early Weezer, Frank Turner, & Elliot Smith.","img":""},{"venue":"Evening Muse","event":"Barnaby BrightDriftwood","date":"10 20 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1544252","tuneStub":"","href":"http://www.eveningmuse.com/event/1544252-barnaby-bright-driftwood-charlotte/","desc":"The energy of rock n' roll is impossible to categorize – mercurial, specific to its beholder and profoundly reflective.\n\nFormed in 2005, the band spent four years playing just about anywhere they could. \"We just wanted to be able to play for any crowd and turn heads,\" says banjo player Joe Kollar. \"We played everywhere. Coffee houses, bars, churches, rock clubs, Bluegrass festivals and the streets…a lot on the streets. We didn't make any money, but what we learned was invaluable.\"\n\nFrom the Binghamton, New York music scene comes Driftwood, a band with a rock 'n' roll soul and a folk art mind. Carving out a name for themselves with electrifying live performances, they bring one of the most unique, raw sounds to the Americana/roots music scene. Incorporating upright bass, banjo, acoustic guitar and violin, the ghost of traditional American folk music lives in their palette. But the melodies, the harmonies and the lyrics are something else entirely.\n\nIn November 2012, Driftwood started work on their third and latest CD. Despite a grueling tour schedule and very little time at home, the recordings were finished in the summer of 2013. The self-titled new disc was recorded in a church outside of Ithaca, NY with Grammy-winning engineer Robby Hunter. It was released on December 3rd, 2013.\"","img":""},{"venue":"Evening Muse","event":"Barnaby BrightDriftwood","date":"10 20 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1544252","tuneStub":"","href":"http://www.eveningmuse.com/event/1544252-barnaby-bright-driftwood-charlotte/","desc":"The energy of rock n' roll is impossible to categorize – mercurial, specific to its beholder and profoundly reflective.\n\nFormed in 2005, the band spent four years playing just about anywhere they could. \"We just wanted to be able to play for any crowd and turn heads,\" says banjo player Joe Kollar. \"We played everywhere. Coffee houses, bars, churches, rock clubs, Bluegrass festivals and the streets…a lot on the streets. We didn't make any money, but what we learned was invaluable.\"\n\nFrom the Binghamton, New York music scene comes Driftwood, a band with a rock 'n' roll soul and a folk art mind. Carving out a name for themselves with electrifying live performances, they bring one of the most unique, raw sounds to the Americana/roots music scene. Incorporating upright bass, banjo, acoustic guitar and violin, the ghost of traditional American folk music lives in their palette. But the melodies, the harmonies and the lyrics are something else entirely.\n\nIn November 2012, Driftwood started work on their third and latest CD. Despite a grueling tour schedule and very little time at home, the recordings were finished in the summer of 2013. The self-titled new disc was recorded in a church outside of Ithaca, NY with Grammy-winning engineer Robby Hunter. It was released on December 3rd, 2013.\"","img":""},{"venue":"Evening Muse","event":"CAYETANA","date":"10 07 17","times":"\n  Doors: 6:30 pm / Show: 7:00 pm ","ticketfly":"1529993","tuneStub":"","href":"http://www.eveningmuse.com/event/1529993-cayetana-charlotte/","desc":"The follow up to Cayetana’s debut LP Nervous Like Me, which gained the band critical acclaim, a dedicated fan following, and tours with bands like The Menzingers, Against Me!, Waxahatchee and The Bouncing Souls in The US, Canada and Australia, New Kind of Normal retains the pop sensibility and candid songwriting of its predecessor yet exhibits a clear growth in sonic diversity. Although many of the songs were worked out at Koch’s barnyard studio in the Poconos, the band returned to Matt Schimelfenig at Philly’s Miner Street Studios to record the record. The collaboration resulted in a diverse output of expertly crafted, hooky pop songs like “Mesa” coupled with sparse, dark, and deeply emotional synth-laden tracks like “World.” Musically, the record captures the quiet moments of crushing vulnerability and the hardened highs of personal strength as expertly as Koch’s lyrical craft.\n\nIf Cayetana’s newest album had a tagline it would be “how to stop self-sabotaging and accept love.” Thematically, the Philadelphia indie rock three-piece - comprised of Augusta Koch, Allegra Anka and Kelly Olsen - has been exploring the delicate interplay of mental illness and wellness, since they began releasing music in 2014, but never so gracefully and poignantly as on New Kind of Normal. “The record is about mental health…struggling with that and settling into a new kind of normal where you can finally recognize your own your destructive behaviors and accept love into your life.” Cayetana explore the concept of normality when living with mental illness, that what you know as normal can be self-destructive, and that finding a new way of living, a new kind of normal, where self-care and self-respect are the norm is an often painful and lifelong process that can feel foreign and undeserving. New Kind of Normal, however, reminds us that self-love is merited and palpable and delivers us a soundtrack for finding it.\n\nSongs like “Certain for Miles,” embody the concept of the record beautifully. Koch sings, “When the world bears down on me will I laugh at it’s audacity and be able to comprehend? When the world bears down on me will I laugh at it’s audacity and be able to start again?” The answer, apparently, is yes and always has been.\n\nFrom the group’s inception Cayetana has exemplified the beauty and spirit of perseverance and DIY. They started as three friends who had barely been acquainted with their instruments and in just three years have become one of the most promising bands in indie music. They prove on New Kind of Normal that growth takes self-responsibility, accepting the help of others, and resilience proving that the risk is worth the writhing. \n\nProving themselves masters of self-actualization, Cayetana has formed their own record label – Plum Records – to release their second LP. Koch says of Plum, “We believe in ourselves so much more than anyone else is going to believe in us, so why not put all of our energy into releasing the record?” Koch is as candid about the financial, emotional and sometimes creative sacrifice that being a musician entails as she is about her own personal internal experiences. For their second record, Cayetana refused to compromise and hope to help other artists to do the same in the future. “We want to empower people and show them that they don’t have to wait for something to happen. They can do it themselves.”\n\nEvidently, there is a new kind of normal not only in the mind but also in music and Cayetana is determined to help us find it.\n\n*Written by Anika Pyle","img":""},{"venue":"Evening Muse","event":"THE STEPPIN STONES","date":"10 07 17","times":"\n  Doors: 10:00 pm / Show: 10:30 pm ","ticketfly":"1528039","tuneStub":"","href":"http://www.eveningmuse.com/event/1528039-steppin-stones-charlotte/","desc":"Hannah Wicklund and The Steppin Stones is an American rock ‘n’ roll band from Hilton Head Island, South Carolina. Wicklund formed The Steppin Stones at the age of nine. While most were accomplishing third grade reading lists, Wicklund was forming a rock ‘n’ roll band. Playing over 1,500 shows, sharing stages with acts including Kansas, Jefferson Starship, Outlaws, Lyle Lovett, Jason Isbell, and Rusted Root before legal voting age, Wicklund and The Steppin Stones have evolved over a decade.\n\n“18-year-old vocalist and guitarist Hannah Wicklund who delivers melodies and styles from multiple genres with both expert precision and original adventurism...it’s astonishing how they achieve such a mature rock sound on their 2015 self-title album,” wrote Modern Rock Review’s Ric Albano.\n\nNow in Nashville, Tennessee, Wicklund, guitarist, pianist, singer and songwriter is accompanied on stage by bass and drums. Wicklund’s signature curls flying through the air transport back to the time of the first female rock star, Janis Joplin. Capturing the old soul of a new generation, Wicklund’s singing voice and guitar playing have earned her comparisons to blues/soul musician Susan Tedeschi.\n\nWith the band’s musical influences from Jimi Hendrix, Fleetwood Mac, Tom Petty & the Heartbreakers and Jeff Beck, Wicklund’s classic rock look get fans listening, but her guitar skills keep them wanting more.\n“I remember the first time I saw Nirvana in 1990 in a small club in Jax Beach with a handful of long hairs and shoe gazers. I will never forget that night, but I was more blown away tonight by Hannah than by Kurt. She is a monster talent and her trio is cool as shit. Tonight was one of those once in a life time moments when you catch a superstar on the way up. Please support her so everyone else who plays guitar can retire,” said Josh Talbot, Nashville native.\n\nWhile touring and playing private events including parties for AC/DC’s Brian Johnson, the band has managed to release four albums. The latest, a self-titled album recorded at Echo Mountain Recording Studios in Asheville, NC in 2015. The band is set to release a new album in October of 2017 upon the kick off of their first European tour.","img":""},{"venue":"Evening Muse","event":"VANCE GILBERT","date":"10 06 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1503390","tuneStub":"","href":"http://www.eveningmuse.com/event/1503390-vance-gilbert-charlotte/","desc":"Vance Gilbert burst onto the singer/songwriter scene in the early 90's when buzz started spreading in the folk clubs of Boston about an ex-multicultural arts teacher who was knocking 'em dead at open mics. Born and raised in the Philadelphia area, Vance started out hoping to be a jazz singer, and then discovered his affinity for the storytelling sensibilities of acoustic folk music. Once word got out about Gilbert's stage-owning singing and playing, Shawn Colvin invited him to be special guest on her Fat City Tour. Noted not only for being the ever consummate performer, Gilbert has recorded 12 albums, including 4 for Philo/Rounder Records and a duo album with friend Ellis Paul. Along with being opener of choice for artists as varied as Aretha Franklin, Arlo Guthrie, and Anita Baker, 2006 and 2007 found Gilbert opening 140+ shows for comedian George Carlin. Most recently he’s the opener of choice for Paul Reiser and The Subdudes.\n\nConsidered by many to be an integral part of the national folk scene, Gilbert's approach to the acoustic singer songwriter idiom is significant. Gilbert's compositions, while frequently employing sophisticated melodies and harmonies that attest to his jazz roots, remain sublime attestations to the storyteller's craft. He even has a tune on a Grammy Nominated children’s album. How rounded is that?","img":""},{"venue":"Evening Muse","event":"PigPen Theatre Co.","date":"09 28 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1504523","tuneStub":"","href":"http://www.eveningmuse.com/event/1504523-pigpen-theatre-co-charlotte/","desc":"PigPen Theatre Co. began creating their unique brand of theatre, music, and film as freshmen at the Carnegie Mellon School of Drama in 2007. Their debut album, “Bremen”, was named #10 album of the year in The Huffington Post’s 2012 Grammy preview sending PigPen on tour playing to sold-out crowds across the country. American Songwriter premiered their follow-up EP, “The Way I’m Running”, in 2013 while the band was playing a series of concerts that became one of the most popular residencies of the past decade at the legendary Schuba’s Tavern in Chicago. In 2015 PigPen released their sophomore album, \"Whole Sun\", performed at Mumford & Sons' return to the Gentlemen of the Road Festival, and made their feature film debut in Jonathan Demme's \"Ricki and the Flash\" starring Meryl Streep. They are currently writing their debut children’s novel and performing Shakespeare's Pericles directed by Sir Trevor Nunn at Theatre For A New Audience in Brooklyn, NY.","img":""},{"venue":"Evening Muse","event":"The BrevetCrane","date":"09 29 17","times":"\n  Doors: 10:00 pm / Show: 10:30 pm ","ticketfly":"1540886","tuneStub":"","href":"http://www.eveningmuse.com/event/1540886-brevet-crane-charlotte/","desc":"Best described as crossover music, Crane has a sound that is all his own. Musical influences range across the board, but most prevalent in his current writing would be Soul, Reggae, R&B, and Pop. Hypothetically, you might find him on tour with Jack Johnson, G Love, The Dirty Heads, Allen Stone, or The Neighbourhood. \n\nIn September of 2014, Crane released his first solo endeavor, The \"I Love Women\" EP. The EP was a collaborative effort from himself and producer Marshall Coats. The two put together an all-star lineup of musicians to create a dynamic collection of 5 songs. Some of the song co writes from the EP include Grammy Award winners and international touring artists. \n\nSince the release of the \"I Love Women\" EP, Crane has toured non-stop performing over 250 dates within a year’s time. In the midst of a rigorous live performance regime, he's managed to find himself with a new management team, impressive new content based on the new material, and writing with even more Grammy Award winners and International-touring artists. We look forward for what the future has in store for us!","img":""},{"venue":"Evening Muse","event":"The BrevetCrane","date":"09 29 17","times":"\n  Doors: 10:00 pm / Show: 10:30 pm ","ticketfly":"1540886","tuneStub":"","href":"http://www.eveningmuse.com/event/1540886-brevet-crane-charlotte/","desc":"Best described as crossover music, Crane has a sound that is all his own. Musical influences range across the board, but most prevalent in his current writing would be Soul, Reggae, R&B, and Pop. Hypothetically, you might find him on tour with Jack Johnson, G Love, The Dirty Heads, Allen Stone, or The Neighbourhood. \n\nIn September of 2014, Crane released his first solo endeavor, The \"I Love Women\" EP. The EP was a collaborative effort from himself and producer Marshall Coats. The two put together an all-star lineup of musicians to create a dynamic collection of 5 songs. Some of the song co writes from the EP include Grammy Award winners and international touring artists. \n\nSince the release of the \"I Love Women\" EP, Crane has toured non-stop performing over 250 dates within a year’s time. In the midst of a rigorous live performance regime, he's managed to find himself with a new management team, impressive new content based on the new material, and writing with even more Grammy Award winners and International-touring artists. We look forward for what the future has in store for us!","img":""},{"venue":"Evening Muse","event":"Find Your Muse Open Mic with special guest Travers Geoffray","date":"10 02 17","times":"\n  Doors: 7:00 pm / Show: 8:00 pm ","ticketfly":"1542756","tuneStub":"","href":"http://www.eveningmuse.com/event/1542756-find-your-muse-open-mic-charlotte/","desc":"The music of New Orleans courses through singer/songwriter/pianist Travers Geoffray’s veins like the Mississippi River cuts across the South. His great-grandfather Fernand Maris Geoffray arrived there from Paris in 1910 and played viola for the New Orleans Opera, as did his son Rudolph Cesar, who was good friends with trumpet player Al Hirt. His father was the leader of the USO band while stationed in Vietnam, and passed that musical legacy to Travers, who studied classical, then jazz, piano at the prestigious Levine School of Music in Washington, DC. His solo debut, Highway Kings, is steeped in the sounds of the city where he moved from his hometown of Alexandria, VA, at 18 to attend Tulane University. While still an undergraduate, Travers formed his first band, Mississippi Rail Company, which made its mark with appearances at the New Orleans Jazz & Heritage Festival and Voodoo Fest.\n\nYou can hear the Crescent City in his piano playing, steeped in the classic ragtime-turned- stride styles of Ferdinand Joseph “Jelly Roll Morton,” LaMothe Henry “Professor Longhair” Byrd, Mac “Dr. John” Rebennack, Antoine “Fats” Domino and James Booker, honed under the tutelage of legendary local keyboardist Tom McDermott.\nProduced by Grammy-winning gospel/bluegrass vet Michael Latterel (Jim Lauderdale, Rhonda Vincent] at Nashville’s House of Blues Studio, Highway Kings is about the lures and pitfalls of the open road, stretching like an empty canvas before him, as Travers starts up the engine of his solo career, examining what makes him tick. The new songs were more introspective, varied, and less about maintaining that party atmosphere all night long.\n\n“This album became such an intense and personal project that I felt it had to come out under my name,” he explains. “It sounded like me. And that’s how other people seemed to relate to it. It’s more transparent as the statement of an individual, rather than a band.” Combining the organic Americana roots of Sturgill Simpson, the lyrical depth of Jason Isbell and Tom Waits’ Tin Pan Alley/country-blues hybrid story-telling, Highway Kings’ songs are both literary and cinematic, evoking the epic sweep of The Grapes of Wrath in the title track, with its trip through Oklahoma and “the buffalos on golden prairies up above the Utah sky,” ending up at the “crystal shores” of California. \n\n“I love the mystique of the open road and traveling,” he says. “Many of these songs are not just about physical trips, but the imaginary ones we go on in our heads, because a lot of people can’t just pick up and go when they please.” There are echoes of Cormac McCarthy’s All the Pretty Horses and the Border trilogy in the\nwide-screen orchestral scope of “Ride Out West,” its melodic peak riding a south-of- the-border feel which evokes both Orson Welles’ Touch of Evil and Sergio Leone’s The Good, the Bad and the Ugly, a fantasy about being a cowboy, “even when the reality can be pretty cruel.”“McCarthy’s books just hit home for me,” says Travers, who also gleaned some inspiration from a college course he took at Tulane dubbed, “The American Hobo Hero,” where he saw movies like John Schlesinger’s gritty Midnight Cowboy. “His style is just very simple and elegant in writing about the basis of what it means to be human. There’s nothing complicated – just you live, you die and in between, you go where you need to go. Your fate is in your own hands, until it’s not.”\n\nAnd then there are tracks that offer the pure exhilarating rush of the dance floor in the speeded-up, chugging Chuck Berry rockabilly of “Drive” and the ragtime funk of “Mabel,” reminiscent of both The Band at its most downhome and the boozy, tongue-in- cheek playfulness of “Rainy Day Women #12 & 35.” Counterbalancing that are the sepulchral, plaintive “Oh, Alabama” and the dirge-like “Wake,” the former featuring the mournful clarinet of Jeff Coffin, the ex-Flecktone member who now plays with the Dave Matthews Band, the latter a wailing, chilling saxophone solo.\n\nWhat makes Geoffray’s music endure, though, is his commitment to the melodies and harmonies of classic American songwriting tropes, from the musical theater to the Brill Building. You can hear it in the simple pop piano progression on “Don’t Stop,” a song that wouldn’t sound out of place on your local Top 40 station, at least the ones who still play Coldplay or U2. “Hold over my ears magnificent sound,” sings Travers, and that’s exactly what he’s created here.\n\nInfluenced equally by the travels of Harry and Lloyd in Dumb and Dumber, Tommy Callahan and Richard Hayden in Tommy Boy and his favorite childhood comic strip, Calvin and Hobbes, Highway Kings puts the listener in the driver’s seat, behind the wheel and invites us to turn the key.\n\nBy the time, we get to the album closer, “Take Me Home,” a tribute to his sweet Virginia birthplace, Travers admits, “There are times when you have to take off your shoes, eat a warm meal and be with family and friends. It just makes going out on the road that much better.” \n\nAnd that’s exactly where Geoffray will find himself in the coming months. With an appearance at this year’s New Orleans Jazz & Heritage Festival on tap, he is ready to take his band and play the new songs to see how audiences react. “I walked across temperamental seas/Writing stories never told/Over hills and purple meadows\n/I found heaven on my own,” “Take Me Home” “My biggest goal would be just to be able to get to the point where I can make another record,” he says when asked about future ambitions. I’ve already started developing more material that’s even better. This album helped me develop that process, and I just want to continue mastering it.\n\nIf I can get there, I’ll be happy.” Start the car and drive. This trip is just beginning.","img":""},{"venue":"Evening Muse","event":"Find Your Muse Open Mic with special guest Travers Geoffray","date":"10 02 17","times":"\n  Doors: 7:00 pm / Show: 8:00 pm ","ticketfly":"1542756","tuneStub":"","href":"http://www.eveningmuse.com/event/1542756-find-your-muse-open-mic-charlotte/","desc":"The music of New Orleans courses through singer/songwriter/pianist Travers Geoffray’s veins like the Mississippi River cuts across the South. His great-grandfather Fernand Maris Geoffray arrived there from Paris in 1910 and played viola for the New Orleans Opera, as did his son Rudolph Cesar, who was good friends with trumpet player Al Hirt. His father was the leader of the USO band while stationed in Vietnam, and passed that musical legacy to Travers, who studied classical, then jazz, piano at the prestigious Levine School of Music in Washington, DC. His solo debut, Highway Kings, is steeped in the sounds of the city where he moved from his hometown of Alexandria, VA, at 18 to attend Tulane University. While still an undergraduate, Travers formed his first band, Mississippi Rail Company, which made its mark with appearances at the New Orleans Jazz & Heritage Festival and Voodoo Fest.\n\nYou can hear the Crescent City in his piano playing, steeped in the classic ragtime-turned- stride styles of Ferdinand Joseph “Jelly Roll Morton,” LaMothe Henry “Professor Longhair” Byrd, Mac “Dr. John” Rebennack, Antoine “Fats” Domino and James Booker, honed under the tutelage of legendary local keyboardist Tom McDermott.\nProduced by Grammy-winning gospel/bluegrass vet Michael Latterel (Jim Lauderdale, Rhonda Vincent] at Nashville’s House of Blues Studio, Highway Kings is about the lures and pitfalls of the open road, stretching like an empty canvas before him, as Travers starts up the engine of his solo career, examining what makes him tick. The new songs were more introspective, varied, and less about maintaining that party atmosphere all night long.\n\n“This album became such an intense and personal project that I felt it had to come out under my name,” he explains. “It sounded like me. And that’s how other people seemed to relate to it. It’s more transparent as the statement of an individual, rather than a band.” Combining the organic Americana roots of Sturgill Simpson, the lyrical depth of Jason Isbell and Tom Waits’ Tin Pan Alley/country-blues hybrid story-telling, Highway Kings’ songs are both literary and cinematic, evoking the epic sweep of The Grapes of Wrath in the title track, with its trip through Oklahoma and “the buffalos on golden prairies up above the Utah sky,” ending up at the “crystal shores” of California. \n\n“I love the mystique of the open road and traveling,” he says. “Many of these songs are not just about physical trips, but the imaginary ones we go on in our heads, because a lot of people can’t just pick up and go when they please.” There are echoes of Cormac McCarthy’s All the Pretty Horses and the Border trilogy in the\nwide-screen orchestral scope of “Ride Out West,” its melodic peak riding a south-of- the-border feel which evokes both Orson Welles’ Touch of Evil and Sergio Leone’s The Good, the Bad and the Ugly, a fantasy about being a cowboy, “even when the reality can be pretty cruel.”“McCarthy’s books just hit home for me,” says Travers, who also gleaned some inspiration from a college course he took at Tulane dubbed, “The American Hobo Hero,” where he saw movies like John Schlesinger’s gritty Midnight Cowboy. “His style is just very simple and elegant in writing about the basis of what it means to be human. There’s nothing complicated – just you live, you die and in between, you go where you need to go. Your fate is in your own hands, until it’s not.”\n\nAnd then there are tracks that offer the pure exhilarating rush of the dance floor in the speeded-up, chugging Chuck Berry rockabilly of “Drive” and the ragtime funk of “Mabel,” reminiscent of both The Band at its most downhome and the boozy, tongue-in- cheek playfulness of “Rainy Day Women #12 & 35.” Counterbalancing that are the sepulchral, plaintive “Oh, Alabama” and the dirge-like “Wake,” the former featuring the mournful clarinet of Jeff Coffin, the ex-Flecktone member who now plays with the Dave Matthews Band, the latter a wailing, chilling saxophone solo.\n\nWhat makes Geoffray’s music endure, though, is his commitment to the melodies and harmonies of classic American songwriting tropes, from the musical theater to the Brill Building. You can hear it in the simple pop piano progression on “Don’t Stop,” a song that wouldn’t sound out of place on your local Top 40 station, at least the ones who still play Coldplay or U2. “Hold over my ears magnificent sound,” sings Travers, and that’s exactly what he’s created here.\n\nInfluenced equally by the travels of Harry and Lloyd in Dumb and Dumber, Tommy Callahan and Richard Hayden in Tommy Boy and his favorite childhood comic strip, Calvin and Hobbes, Highway Kings puts the listener in the driver’s seat, behind the wheel and invites us to turn the key.\n\nBy the time, we get to the album closer, “Take Me Home,” a tribute to his sweet Virginia birthplace, Travers admits, “There are times when you have to take off your shoes, eat a warm meal and be with family and friends. It just makes going out on the road that much better.” \n\nAnd that’s exactly where Geoffray will find himself in the coming months. With an appearance at this year’s New Orleans Jazz & Heritage Festival on tap, he is ready to take his band and play the new songs to see how audiences react. “I walked across temperamental seas/Writing stories never told/Over hills and purple meadows\n/I found heaven on my own,” “Take Me Home” “My biggest goal would be just to be able to get to the point where I can make another record,” he says when asked about future ambitions. I’ve already started developing more material that’s even better. This album helped me develop that process, and I just want to continue mastering it.\n\nIf I can get there, I’ll be happy.” Start the car and drive. This trip is just beginning.","img":""},{"venue":"Evening Muse","event":"TONY LUCCA + DERIK HULTQUIST","date":"09 20 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1520087","tuneStub":"","href":"http://www.eveningmuse.com/event/1520087-tony-lucca-derik-hultquist-charlotte/","desc":"When Derik Hultquist declares, “my life is defined by parallel lines” one is tempted to assume he/she is listening to a road weary troubadour who is reflecting on a long musical journey of one night stands playing for tip jars. While Hultquist certainly hasn’t been exempt from these experiences, the twenty-something is sharing more of his narrative of life, than simply recounting his musical reality. An East Tennessee native, Hultquist has always been drawn to a life equal parts imagined as realized. \n\nAfter leaving Alcoa, TN he spent time at Kentucky Wesleyan College tending to the business of getting an education and defending the net as goalie for the men’s soccer team. After an injury left him sidelined with too much time on his hands, he fell back into the familiar practice of songwriting, which he had been mining since before high school. The next few years, while waiting on graduation, he spent reinvigorated with the art of the song. Upon graduation, on a whim, he migrated to Nashville. While this might seem like a cliche?d, predictable move, Hultquist didn’t show up ‘demo tape in hand’ and start beating on the doors of music row. He decided to make his own path and took on flexible jobs (legislative legal clerk, server, handyman, paperboy, pharmacy tech, valet, and others), which didn’t merit much income, but did allow him time enough to write everyday. He continued making an earnest attempt to craft his songwriting into a symbolic tale of the potential in all of humanity. From this writing spawned the self-released, Anthologies and Blue Blues. \n\nHultquist eventually did find his way to Carnival Music, a multi-faceted company who has established itself as one of the last holistic breeding grounds of the artist/writer in Nashville. Carnival released two EPs on Hultquist, Whether Report, in early 2012 and Leaning On The Rain, later the same year. These releases revisited a few songs on his previous self-released albums in the hopes of honing in on a definitive sound. “I’m a perfect stranger in a strange place,” he laments on “Cowboy Cliche?” a track off of the Whether Report set. With such a simple statement, Hultquist immediately invites the listener to identify with his plight. It’s his subtle reflectiveness that is at the core of these songs. \n\nOn his forthcoming release, Mockingbird’s Mouth, due out in February 2014, Hultquist builds on the cerebral nature of Whether Report and Leaning On The Rain almost seamlessly; transitioning from the stark atmospheric nature of the 2012 releases to a blithely journeyman’s account of past, present, and future. The opening track, “For The Good Of The Rose” situates itself exceptionally as the tone- setting cornerstone of the seven-song collection and tempts the listener to ponder what might have been if James Taylor had developed his sound in Laurel Canyon, CA. \n\nWhile the EP is loaded with imagery of life on the road, sonically, the set explores new territory for Hultquist. The upbeat “Give Me The Highway” beckons one to speculate what country radio might sound like if the ‘powers that be’ were willing to promote a more pensive agenda. The entire album juggles an introspective sentiment with an optimistic attitude, one that is certainly a testament to the values of Hultquist. It only requires a first listen to selections like “Strange Love” and “Stay Young” for one to realize he/she is witnessing a complexity that is created by a marriage eager anticipation and brooding carefulness. Hultquist beautifully assumes the role of storyteller on “#29.” He employs the four-minute vehicle to convey his observations of life, instead of letting it become just another train song. \n\nHultquist’s work could lead one to draw obvious comparisons to the likes of Jack Kerouac or John Steinbeck. After delving deeper into the crux of Hultquist writing, though, one might shift his/her semblance towards a Langston Hughes or Ernest Hemingway association instead, as witnessed when he closes the new project with his own spin on a love song with “Parallel Lines” and the meditative “Country Song.” In the closing number, when Hultquist asserts, “Questions don’t get clearer, just more often asked. If I knew the future, I’d still want to wait, to see if I use it before the past gets in the way” it unveils the spirit of Mockingbird’s Mouth, an album that summons a deeper examination of the ordinary.","img":""},{"venue":"Evening Muse","event":"TONY LUCCA + DERIK HULTQUIST","date":"09 20 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1520087","tuneStub":"","href":"http://www.eveningmuse.com/event/1520087-tony-lucca-derik-hultquist-charlotte/","desc":"When Derik Hultquist declares, “my life is defined by parallel lines” one is tempted to assume he/she is listening to a road weary troubadour who is reflecting on a long musical journey of one night stands playing for tip jars. While Hultquist certainly hasn’t been exempt from these experiences, the twenty-something is sharing more of his narrative of life, than simply recounting his musical reality. An East Tennessee native, Hultquist has always been drawn to a life equal parts imagined as realized. \n\nAfter leaving Alcoa, TN he spent time at Kentucky Wesleyan College tending to the business of getting an education and defending the net as goalie for the men’s soccer team. After an injury left him sidelined with too much time on his hands, he fell back into the familiar practice of songwriting, which he had been mining since before high school. The next few years, while waiting on graduation, he spent reinvigorated with the art of the song. Upon graduation, on a whim, he migrated to Nashville. While this might seem like a cliche?d, predictable move, Hultquist didn’t show up ‘demo tape in hand’ and start beating on the doors of music row. He decided to make his own path and took on flexible jobs (legislative legal clerk, server, handyman, paperboy, pharmacy tech, valet, and others), which didn’t merit much income, but did allow him time enough to write everyday. He continued making an earnest attempt to craft his songwriting into a symbolic tale of the potential in all of humanity. From this writing spawned the self-released, Anthologies and Blue Blues. \n\nHultquist eventually did find his way to Carnival Music, a multi-faceted company who has established itself as one of the last holistic breeding grounds of the artist/writer in Nashville. Carnival released two EPs on Hultquist, Whether Report, in early 2012 and Leaning On The Rain, later the same year. These releases revisited a few songs on his previous self-released albums in the hopes of honing in on a definitive sound. “I’m a perfect stranger in a strange place,” he laments on “Cowboy Cliche?” a track off of the Whether Report set. With such a simple statement, Hultquist immediately invites the listener to identify with his plight. It’s his subtle reflectiveness that is at the core of these songs. \n\nOn his forthcoming release, Mockingbird’s Mouth, due out in February 2014, Hultquist builds on the cerebral nature of Whether Report and Leaning On The Rain almost seamlessly; transitioning from the stark atmospheric nature of the 2012 releases to a blithely journeyman’s account of past, present, and future. The opening track, “For The Good Of The Rose” situates itself exceptionally as the tone- setting cornerstone of the seven-song collection and tempts the listener to ponder what might have been if James Taylor had developed his sound in Laurel Canyon, CA. \n\nWhile the EP is loaded with imagery of life on the road, sonically, the set explores new territory for Hultquist. The upbeat “Give Me The Highway” beckons one to speculate what country radio might sound like if the ‘powers that be’ were willing to promote a more pensive agenda. The entire album juggles an introspective sentiment with an optimistic attitude, one that is certainly a testament to the values of Hultquist. It only requires a first listen to selections like “Strange Love” and “Stay Young” for one to realize he/she is witnessing a complexity that is created by a marriage eager anticipation and brooding carefulness. Hultquist beautifully assumes the role of storyteller on “#29.” He employs the four-minute vehicle to convey his observations of life, instead of letting it become just another train song. \n\nHultquist’s work could lead one to draw obvious comparisons to the likes of Jack Kerouac or John Steinbeck. After delving deeper into the crux of Hultquist writing, though, one might shift his/her semblance towards a Langston Hughes or Ernest Hemingway association instead, as witnessed when he closes the new project with his own spin on a love song with “Parallel Lines” and the meditative “Country Song.” In the closing number, when Hultquist asserts, “Questions don’t get clearer, just more often asked. If I knew the future, I’d still want to wait, to see if I use it before the past gets in the way” it unveils the spirit of Mockingbird’s Mouth, an album that summons a deeper examination of the ordinary.","img":""},{"venue":"Evening Muse","event":"Charley Crockett","date":"09 26 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1551371","tuneStub":"","href":"http://www.eveningmuse.com/event/1551371-charley-crockett-charlotte/","desc":"Growing up with a single mother in San Benito, Texas, the hometown of Tejano star Freddy Fender was not easy for blues singer Charley Crockett. Hitchhiking across the country exposed Crockett to the street life at a young age, following in the footsteps of his relative, American folk hero Davy Crockett, who also lived a wild life on the American frontier. After train hopping across the country, singing on the streets for change in New Orleans’ French Quarter, busking in New York City and performing across Texas and Northern California, Crockett set off to travel the world and lived on the streets of Paris for nearly a year before searching for home in Spain, Morocco, and Northern Africa. \n\nThe blues artist returned home to Texas and released his debut solo album titled A Stolen Jewel in 2015, receiving critical acclaim in Dallas and ultimately landing him a Dallas Observer Music Award that year for “Best Blues Act”. A record “rich with Southern flavor, a musical gumbo of Delta blues, honky-tonk, gospel and Cajun jazz,” Jewel proved that Crockett, born into poverty in the Rio Grande, had come home to make his musical mark on the South. Crockett, who is self-described as elusive, rebellious and self-taught, has been compared to legends like Bill Withers, Merle Haggard, and Gary Clark Jr. \n\nHe released his sophomore record In The Night, an admirable nod to his Texas country and Louisiana blues roots, on June 4 and ended 2016 having played over 125 shows. “In the Night” and Crockett’s song “I Am Not Afraid” received international recognition from top tastemakers after being picked by NPR Music as one of the \"Top 10 Songs Public Radio Can't Stop Playing” and selected by David Dye to be featured on World Cafe in late July. The Fort Worth Star-Telegram called it “an impressive calling card, full of Crockett's plaintive soulfulness and swinging tempos\" and Central Track noted the artist as having \"the well-rounded songwriting capabilities of Van Morrison and a vocal approach that finds common ground between Bill Withers and early Dr. John.\" Crockett graced the cover of Buddy Magazine in May 2016, who called him “the archetype of the new American vagabond.” \n\nHe has shared the stage with artists like Justin Townes Earle, Citizen Cope, Alejandro Escovedo, Joe Ely, Sean Hayes, Tab Benoit, Ace Enders, and Leon Bridges.","img":""},{"venue":"Evening Muse","event":"Caleb Caudle Full Band Show","date":"10 06 17","times":"\n  Doors: 10:00 pm / Show: 10:30 pm ","ticketfly":"1542830","tuneStub":"","href":"http://www.eveningmuse.com/event/1542830-caleb-caudle-full-band-show-charlotte/","desc":"Caleb Caudle is a singer-songwriter based in Winston-Salem, NC with seven albums to his credit over more than a decade playing music. He's toured the country many times over, playing clubs, theaters, festivals and corner bars while sharing the stage with friends including Jason Isbell, Margo Price, Dawes, Robert Ellis, Patterson Hood, Justin Townes Earle, Aaron Lee Tasjan, and John Moreland, among many others. \n\nHis last album, 2016's Carolina Ghost, drew widespread critical acclaim from the likes of NPR Music, Rolling Stone, Huffington Post, Paste, Bitter Southerner, and American Songwriter. Crushed Coins, his new album out in late 2017, was recorded in both Los Angeles and Nashville and produced by Caudle in collaboration with long-time engineer Jon Ashley (Avett Brothers, Band of Horses, Hiss Golden Messenger, War on Drugs).","img":""},{"venue":"Evening Muse","event":"PHOEBE HUNT & THE GATHERERS","date":"09 23 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1542218","tuneStub":"","href":"http://www.eveningmuse.com/event/1542218-phoebe-hunt-gatherers-charlotte/","desc":"An accomplished Americana instrumentalist with foundations in jazz and swing music, Phoebe makes an impressive creative leap with this record. It’s the culmination of a five year journey that has taken her from her Austin roots through Music Row, Brooklyn, and even to India to study with seventh-generation master violinist Kala Ramnath.  Along the way, Phoebe found her voice and delivered her most inspired set of songs to date — the soundtrack to her self-discovery.\n\nShanti’s Shadow marks an arrival for Phoebe Hunt, whose artistic and personal journey has deep storylines. These masterfully crafted songs are brought to life by the musicians Phoebe has gathered – each a virtuoso in their own right. Phoebe is skilled at taking seemingly disparate elements and pulling them together into a dazzling kaleidoscope of lush, coherent sound and rhythm patterns. The result is music that swells, crashes and breathes organically under Phoebe’s soulful, plaintive voice. Sounds of Americana and Texas Tinged Swing are woven with exotic rhythmic concepts culled from Phoebe’s time in India.\n\nShanti’s Shadow is always surprising yet comfortingly familiar.  Prior to recording this album, the entire band traveled to India to study at an ashram outside of Pune with master violinist Kala Ramnath. In India, they practiced music, meditation and philosophy – sometimes spending as many as 10 hours a day working and re-working Tats and Ragas. This intense, experiential study is apparent in the seamless musical play and improvisation of Shanti’s Shadow.","img":""},{"venue":"Evening Muse","event":"Find Your Muse Open Mic with Matt Hectorne","date":"09 11 17","times":"\n  Doors: 7:00 pm / Show: 8:00 pm ","ticketfly":"1536429","tuneStub":"","href":"http://www.eveningmuse.com/event/1536429-find-your-muse-open-mic-matt-charlotte/","desc":"As a Memphis, Tennessee-born, Northwest Mississippi-raised singer-songwriter, Matt Hectorne has a love for classic American songwriting. Finding inspiration from the likes of Tom Petty, Neil Young, and Big Star with modern flourishes of indie rock and Americana that are sometimes compared to Jason Isbell, Ryan Adams, and Damien Jurado, Hectorne continues to bridge the old and the new. A natural songsmith, Hectorne’s smooth Mid-South drawl sails over songs that pay tribute to his heroes while still finding a refreshing place in today’s musical landscape. Since releasing his first EP in 2012, as well as 2013’s mini-LP Show Your Love, Hectorne has toured extensively across the country, garnering glowing show reviews and attracting new fans who are drawn to his intimate yet universal themes.\n\nWith the release of his 2015 debut LP Days While Away, Matt Hectorne has found himself and his work in the most realized point of his young career. Songs of traveling, despondency, and learning to let go, these songs are at once highly melodic and cuttingly lyrical. Tracks that are deceptively easy-listening draw you in only to hit you over the head with stories and ruminations both profound and aware.\n\nDays While Away is out now on Hem & Haw Recordings.","img":""},{"venue":"Evening Muse","event":"Find Your Muse Open Mic with Matt Hectorne","date":"09 11 17","times":"\n  Doors: 7:00 pm / Show: 8:00 pm ","ticketfly":"1536429","tuneStub":"","href":"http://www.eveningmuse.com/event/1536429-find-your-muse-open-mic-matt-charlotte/","desc":"As a Memphis, Tennessee-born, Northwest Mississippi-raised singer-songwriter, Matt Hectorne has a love for classic American songwriting. Finding inspiration from the likes of Tom Petty, Neil Young, and Big Star with modern flourishes of indie rock and Americana that are sometimes compared to Jason Isbell, Ryan Adams, and Damien Jurado, Hectorne continues to bridge the old and the new. A natural songsmith, Hectorne’s smooth Mid-South drawl sails over songs that pay tribute to his heroes while still finding a refreshing place in today’s musical landscape. Since releasing his first EP in 2012, as well as 2013’s mini-LP Show Your Love, Hectorne has toured extensively across the country, garnering glowing show reviews and attracting new fans who are drawn to his intimate yet universal themes.\n\nWith the release of his 2015 debut LP Days While Away, Matt Hectorne has found himself and his work in the most realized point of his young career. Songs of traveling, despondency, and learning to let go, these songs are at once highly melodic and cuttingly lyrical. Tracks that are deceptively easy-listening draw you in only to hit you over the head with stories and ruminations both profound and aware.\n\nDays While Away is out now on Hem & Haw Recordings.","img":""},{"venue":"Evening Muse","event":"Koo Koo Kanga Roo","date":"11 28 17","times":"\n  Doors: 5:30 pm / Show: 6:00 pm ","ticketfly":"1524341","tuneStub":"","href":"http://www.eveningmuse.com/event/1524341-koo-koo-kanga-roo-charlotte/","desc":"Koo Koo Kanga Roo is the dance-a-long comedy show from Bryan and Neil, two friends who set out to experiment with live music and make it more fun. Armed with nothing more than an iPod, two mics, one giant rainbow and some gold sneakers, Koo Koo Kanga Roo puts on an all-ages dance party that invites everyone to join in. Whether you know them from \"brain break\" videos in your classroom, the Warped Tour or a late night bar show, you’ve probably gotten sweaty dancing to their jams at some point.\n\n\nTheir latest album \"Celebrate This!\" is a collection of songs about holidays. With a new track released each month, this album features songs about well-known holiday such as Thanksgiving (“Gobble Gobble Turkey Wobble”) and Father's Day (“Dad Jokes”) as well as not so well-known holidays like Bubble Wrap Appreciation Day (“Bubble Wrap Rap”) and National Grilled Cheese Day (“Bread/Cheese/Bread”). Whatever your favorite day is, “Celebrate This!” will give you more reasons to party.","img":""},{"venue":"Evening Muse","event":"THE SECRET SISTERS","date":"09 29 17","times":"\n  Doors: 7:00 pm / Show: 7:30 pm ","ticketfly":"1484012","tuneStub":"","href":"http://www.eveningmuse.com/event/1484012-secret-sisters-charlotte/","desc":"There are two ways of handling a dangerous, raging river: you can surrender and let it carry you away, or you can swim against the flow. For The Secret Sisters, there was a point after the release of their last record when they could have chosen to do neither – instead, sinking to the bottom as the weight of the world washed away their dreams. They went from touring with Bob Dylan to losing their label, purging their team, filing bankruptcy and almost permanently trading harmonies for housecleaning. But there’s a mythical pull to music that kept sisters Laura and Lydia Rogers moving forward, and they came out with a biting and beautiful third LP, produced by Brandi Carlile, You Don’t Own Me Anymore. Their first as New West signees, it’s a document of hardship and redemption, of pushing forward when it would be so much easier to drown in grief. And it’s a story about how passion and pure artistry can be the strongest sort of salvation – how art is left, like perfect grains of sand, when everything else has washed away.\n\n“We are more proud of these songs than we have ever been,” says Laura. “Some of the songs are a little more cryptic, but some of them are very pointed and honest and direct. And we had to let those songs happen. We had to let ourselves be angry again, and bring up things we wanted to forget.” \n\nIt certainly would have been easier to just try and forget the past few years of The Secret Sisters’ life. After their second album, Put Your Needle Down, didn’t perform according to their label’s expectations – however unrealistic they were in this day and age – the duo was dropped, leaving them with barely enough money to stay on the road and keep making music. So they retreated home to Alabama, worn and weary from experiencing the devilish side of the industry first-hand, scraping together whatever they could while trying to embrace what seemed to be a future without music. But when Carlile – someone whom The Secret Sisters have admired for years and one of our truest talents – offered to produce their record, it made them think that a future was possible. Soon, a PledgeMusic campaign that completely exceeded their hopes and dreams made it fiscally so.\n\n“It was a nightmare that every day seemed to worsen,” says Laura. “We went through things we literally never thought we would come out of. “Adds Lydia, “it had just gotten so bad, the only option was to file bankruptcy.”\n\nEven once Carlile gave The Secret Sisters some renewed hope, things weren’t instantly easy: what they went through left huge, gaping wounds that needed to heal before they could pour themselves into songwriting. But when they did, everything changed. Laura and Lydia found themselves in a more creative and honest space than ever, with their experiences flowing and morphing into collective tales of triumph, rage and the indefatigable human spirit. The resulting songs of You Don’t Own Me Anymore are about life when everything you think defines you is stripped away: from “The Damage,” as gorgeous as it is haunting, that speaks directly to those that did them wrong, to the first single “Tennessee River Runs Low,” that imagines the willful flow of a powerful river. These are journeys as poetic as they are confessional, always anchored by the timeless, crystalline ring of Laura and Lydia’s voices in sweet unison.\n\n“This record is deeply personal because of what we endured,” says Lydia. “But it’s important as a songwriter and artist to talk about the times things weren’t great. This is a hard business, and it’s not all roses and rainbows. What we came out with is more honest than ever, and we couldn’t help that a lot of it is about the darkness.”\n\nIn the beginning, before that darkness moved in, things were a little like rainbows and roses for the sisters, who rose quickly through the music universe. An open audition in Nashville in 2009 lead them to a major label deal and a debut record produced by T Bone Burnett and Dave Cobb, followed by a tour with Levon Helm and Ray LaMontagne, a feat for any artist, let alone two that had just gotten started. From there, they opened for the likes of Dylan, Willie Nelson and Paul Simon, appeared on numerous late night shows and released a second album with Burnett. But the tides turned quickly – things can change in an instant, both for the good, and the bad. And when the clouds started to lift, Carlile was there to help usher in the sunshine.\n\n“Brandi, Phil, and Tim had never produced a record for anybody but themselves,” says Laura about their experience in the studio. “We are all artists, and we could include our opinions. I felt like everyone was an equal force in the room. It is often lost on producers that you actually have to go perform your song on a stage – it’s easy to get so caught up on the production that you don’t discuss how this all will translate – but Brandi innately understood that.” The end product finds the sisters taking their music to new places, with soulful, gospel grooves and stirring vocal deliveries that never seek perfection over power. From murder ballads to skewering roasts, it’s a guidebook for survival.\n\nAfter all, sometimes you have to lose everything to get a renewed version in return. Like the Tennessee River they sing about, only after a drought does fresh, new water come rushing in. The same could be said for The Secret Sisters, who were scraped dry and put through hell, coming out with their finest record, You Don’t Own Me Anymore. “The only way we could have completely healed was to have written an entire record,” says Laura. “I think we were just in the wrong parts of the machine,” says her sister. “We feel like we have learned where not to be, and where to go.” And that’s to never let anyone or anything own them again.","img":""}]